{
  "version": "1.0",
  "truncation": null,
  "padding": {
    "strategy": "BatchLongest",
    "direction": "Right",
    "pad_to_multiple_of": null,
    "pad_id": 2,
    "pad_type_id": 0,
    "pad_token": " "
  },
  "added_tokens": [
    {
      "id": 0,
      "content": "^",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "_",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": " ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "§",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "°",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": null,
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "^",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "_",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "^": {
        "id": "^",
        "ids": [
          0
        ],
        "tokens": [
          "^"
        ]
      },
      "_": {
        "id": "_",
        "ids": [
          1
        ],
        "tokens": [
          "_"
        ]
      }
    }
  },
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "§",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "vocab": {
      "^": 0,
      "_": 1,
      " ": 2,
      "§": 3,
      "°": 4,
      "#": 5,
      "(": 6,
      ")": 7,
      "+": 8,
      "-": 9,
      ".": 10,
      "/": 11,
      "0": 12,
      "1": 13,
      "2": 14,
      "3": 15,
      "4": 16,
      "5": 17,
      "6": 18,
      "7": 19,
      "8": 20,
      "9": 21,
      ":": 22,
      ";": 23,
      "=": 24,
      ">": 25,
      "@": 26,
      "B": 27,
      "C": 28,
      "D": 29,
      "F": 30,
      "H": 31,
      "I": 32,
      "M": 33,
      "N": 34,
      "O": 35,
      "P": 36,
      "S": 37,
      "Z": 38,
      "[": 39,
      "\\": 40,
      "]": 41,
      "a": 42,
      "c": 43,
      "g": 44,
      "i": 45,
      "l": 46,
      "n": 47,
      "o": 48,
      "r": 49,
      "s": 50,
      "u": 51,
      "-[": 52,
      ";D": 53,
      "0:": 54,
      ":[": 55,
      ";+": 56,
      ";+0:": 57,
      ";H": 58,
      "c:": 59,
      "-[C": 60,
      "])": 61,
      "]:[": 62,
      "](": 63,
      ";D1": 64,
      ";H0": 65,
      ";H0;D": 66,
      ";a": 67,
      ";a:": 68,
      "#7": 69,
      "3;+0:": 70,
      ";D1;H": 71,
      "=[": 72,
      ";H0;D3;+0:": 73,
      "-[C:": 74,
      "#7;a:": 75,
      "2;+0:": 76,
      "]:[c:": 77,
      "]-[": 78,
      ";D1;H0:": 79,
      ";D2;+0:": 80,
      ":[c:": 81,
      "O;D1;H0:": 82,
      "=[O;D1;H0:": 83,
      "1](": 84,
      ">>": 85,
      "]-[C:": 86,
      "c;H0;D3;+0:": 87,
      "2])": 88,
      "]>>": 89,
      "-[CH": 90,
      "].": 91,
      "]:[#7;a:": 92
    },
    "merges": [
      "- [",
      "; D",
      "0 :",
      ": [",
      "; +",
      ";+ 0:",
      "; H",
      "c :",
      "-[ C",
      "] )",
      "] :[",
      "] (",
      ";D 1",
      ";H 0",
      ";H0 ;D",
      "; a",
      ";a :",
      "# 7",
      "3 ;+0:",
      ";D1 ;H",
      "= [",
      ";H0;D 3;+0:",
      "-[C :",
      "#7 ;a:",
      "2 ;+0:",
      "]:[ c:",
      "] -[",
      ";D1;H 0:",
      ";D 2;+0:",
      ":[ c:",
      "O ;D1;H0:",
      "=[ O;D1;H0:",
      "1 ](",
      "> >",
      "] -[C:",
      "c ;H0;D3;+0:",
      "2 ])",
      "] >>",
      "-[C H",
      "] .",
      "]:[ #7;a:"
    ]
  }
}
