{
  "version": "1.0",
  "truncation": null,
  "padding": {
    "strategy": "BatchLongest",
    "direction": "Right",
    "pad_to_multiple_of": null,
    "pad_id": 2,
    "pad_type_id": 0,
    "pad_token": " "
  },
  "added_tokens": [
    {
      "id": 0,
      "content": "^",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "_",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": " ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "§",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "°",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": null,
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "^",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "_",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "^": {
        "id": "^",
        "ids": [
          0
        ],
        "tokens": [
          "^"
        ]
      },
      "_": {
        "id": "_",
        "ids": [
          1
        ],
        "tokens": [
          "_"
        ]
      }
    }
  },
  "decoder": {
    "type": "WordPiece",
    "prefix": "##",
    "cleanup": false
  },
  "model": {
    "type": "WordPiece",
    "unk_token": "§",
    "continuing_subword_prefix": "##",
    "max_input_chars_per_word": 1024,
    "vocab": {
      "^": 0,
      "_": 1,
      " ": 2,
      "§": 3,
      "°": 4,
      "#": 5,
      "(": 6,
      ")": 7,
      "+": 8,
      "-": 9,
      ".": 10,
      "/": 11,
      "0": 12,
      "1": 13,
      "2": 14,
      "3": 15,
      "4": 16,
      "5": 17,
      "6": 18,
      "7": 19,
      "8": 20,
      "9": 21,
      ":": 22,
      ";": 23,
      "=": 24,
      ">": 25,
      "@": 26,
      "B": 27,
      "C": 28,
      "D": 29,
      "F": 30,
      "H": 31,
      "I": 32,
      "M": 33,
      "N": 34,
      "O": 35,
      "P": 36,
      "S": 37,
      "Z": 38,
      "[": 39,
      "\\": 40,
      "]": 41,
      "a": 42,
      "c": 43,
      "g": 44,
      "i": 45,
      "l": 46,
      "n": 47,
      "o": 48,
      "r": 49,
      "s": 50,
      "u": 51,
      "##C": 52,
      "##:": 53,
      "##6": 54,
      "##]": 55,
      "##-": 56,
      "##[": 57,
      "##N": 58,
      "##;": 59,
      "##H": 60,
      "##0": 61,
      "##D": 62,
      "##3": 63,
      "##+": 64,
      "##7": 65,
      "##(": 66,
      "##8": 67,
      "##)": 68,
      "##c": 69,
      "##1": 70,
      "###": 71,
      "##a": 72,
      "##2": 73,
      "##4": 74,
      "##5": 75,
      "##>": 76,
      "##B": 77,
      "##r": 78,
      "##.": 79,
      "##S": 80,
      "##n": 81,
      "##=": 82,
      "##O": 83,
      "##9": 84,
      "##/": 85,
      "##I": 86,
      "##M": 87,
      "##g": 88,
      "##F": 89,
      "##l": 90,
      "##P": 91,
      "##@": 92,
      "##i": 93,
      "##\\": 94,
      "##s": 95,
      "##o": 96,
      "##Z": 97,
      "##u": 98
    }
  }
}
