{
  "version": "1.0",
  "truncation": null,
  "padding": {
    "strategy": "BatchLongest",
    "direction": "Right",
    "pad_to_multiple_of": null,
    "pad_id": 2,
    "pad_type_id": 0,
    "pad_token": " "
  },
  "added_tokens": [
    {
      "id": 0,
      "content": "^",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "_",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": " ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "§",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "°",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": null,
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "^",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "_",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "^": {
        "id": "^",
        "ids": [
          0
        ],
        "tokens": [
          "^"
        ]
      },
      "_": {
        "id": "_",
        "ids": [
          1
        ],
        "tokens": [
          "_"
        ]
      }
    }
  },
  "decoder": {
    "type": "WordPiece",
    "prefix": "##",
    "cleanup": false
  },
  "model": {
    "type": "WordPiece",
    "unk_token": "§",
    "continuing_subword_prefix": "##",
    "max_input_chars_per_word": 1024,
    "vocab": {
      "^": 0,
      "_": 1,
      " ": 2,
      "§": 3,
      "°": 4,
      "#": 5,
      "(": 6,
      ")": 7,
      "+": 8,
      "-": 9,
      "/": 10,
      "1": 11,
      "2": 12,
      "3": 13,
      "4": 14,
      "5": 15,
      "6": 16,
      "7": 17,
      "=": 18,
      "@": 19,
      "B": 20,
      "C": 21,
      "F": 22,
      "H": 23,
      "I": 24,
      "N": 25,
      "O": 26,
      "S": 27,
      "[": 28,
      "\\": 29,
      "]": 30,
      "c": 31,
      "l": 32,
      "n": 33,
      "o": 34,
      "r": 35,
      "s": 36,
      "##C": 37,
      "##c": 38,
      "##1": 39,
      "##s": 40,
      "##(": 41,
      "##=": 42,
      "##O": 43,
      "##)": 44,
      "##N": 45,
      "##2": 46,
      "##[": 47,
      "##@": 48,
      "##H": 49,
      "##]": 50,
      "##3": 51,
      "##F": 52,
      "##/": 53,
      "##S": 54,
      "##-": 55,
      "##n": 56,
      "##B": 57,
      "##r": 58,
      "##o": 59,
      "##l": 60,
      "###": 61,
      "##4": 62,
      "##+": 63,
      "##\\": 64,
      "##5": 65,
      "##I": 66,
      "##6": 67,
      "##7": 68,
      "##cc": 69,
      "##CC": 70,
      "##c1": 71,
      "##(C": 72,
      "##O)": 73,
      "##=O)": 74,
      "##(=O)": 75,
      "##c2": 76,
      "##H]": 77,
      "##C@": 78,
      "##[C@": 79,
      "##c1cc": 80,
      "##(C)": 81,
      "##c(": 82,
      "##C(=O)": 83,
      "##[C@H]": 84,
      "##[C@@": 85,
      "##c2cc": 86,
      "##[C@@H]": 87,
      "##)cc": 88,
      "##c3": 89,
      "##CCC": 90,
      "##NC(=O)": 91,
      "##+]": 92,
      "##[N": 93,
      "##2)": 94,
      "##=C": 95,
      "CC": 96,
      "##[NH": 97,
      "##c(C": 98,
      "##c1cccc": 99,
      "##)cc1": 100,
      "##(=O)N": 101,
      "##c1ccc(": 102,
      "##n1": 103,
      "##F)": 104,
      "##C1": 105,
      "##c2cccc": 106,
      "CO": 107,
      "##c3cc": 108,
      "##(C)C": 109,
      "##nn": 110,
      "##CC1": 111,
      "##3)": 112,
      "##C(=O)N": 113,
      "##2CC": 114,
      "##OC": 115,
      "##c2ccccc2": 116,
      "##[NH+]": 117,
      "##1CC": 118,
      "##c1ccccc1": 119,
      "##(N": 120,
      "##cn": 121,
      "##l)": 122,
      "O=C": 123,
      "##c(C)": 124,
      "##(F)": 125,
      "##-]": 126,
      "##c1n": 127,
      "##[C@H](": 128,
      "##O-]": 129,
      "##[O-]": 130,
      "##1C": 131,
      "##N(C": 132,
      "##1CCC": 133,
      "##(CC": 134,
      "##c3cccc": 135,
      "##2)cc1": 136,
      "##S(=O)": 137,
      "##[n": 138,
      "##c1ccc(C": 139,
      "##2C": 140,
      "##[C@@H](": 141,
      "##cs": 142,
      "##c2)": 143,
      "##[O-])": 144,
      "##c3ccccc3": 145,
      "##/C": 146,
      "##[C@@H](C)": 147,
      "##c2n": 148,
      "##[nH]": 149,
      "##c4": 150,
      "##cccc": 151,
      "##OCC": 152,
      "##)N": 153,
      "##c1C": 154,
      "##NC(=O)N": 155,
      "##2+]": 156,
      "##[NH2+]": 157,
      "##)C": 158,
      "##c2ccc(": 159,
      "##[C@H](C)": 160,
      "##Br": 161,
      "##2CCC": 162,
      "##c(-": 163,
      "##NC(=O)C": 164,
      "Cc1cc": 165,
      "##c2ccccc2)": 166,
      "##(-": 167,
      "##(C)C)": 168,
      "##3CC": 169,
      "##S(=O)(=O)": 170,
      "##n2": 171,
      "##(C(=O)N": 172,
      "##N(C(=O)": 173,
      "CC(C)": 174,
      "##cc1": 175,
      "##c1nn": 176,
      "COc1ccc(": 177,
      "CCC": 178,
      "Cc1ccc(": 179,
      "##F)cc": 180
    }
  }
}
