{
  "version": "1.0",
  "truncation": null,
  "padding": {
    "strategy": "BatchLongest",
    "direction": "Right",
    "pad_to_multiple_of": null,
    "pad_id": 2,
    "pad_type_id": 0,
    "pad_token": " "
  },
  "added_tokens": [
    {
      "id": 0,
      "content": "^",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "_",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": " ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "§",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "°",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": null,
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "^",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "_",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "^": {
        "id": "^",
        "ids": [
          0
        ],
        "tokens": [
          "^"
        ]
      },
      "_": {
        "id": "_",
        "ids": [
          1
        ],
        "tokens": [
          "_"
        ]
      }
    }
  },
  "decoder": null,
  "model": {
    "type": "Unigram",
    "unk_id": 3,
    "vocab": [
      [
        "^",
        0.0
      ],
      [
        "_",
        0.0
      ],
      [
        " ",
        0.0
      ],
      [
        "§",
        0.0
      ],
      [
        "°",
        0.0
      ],
      [
        "C",
        -1.903809870226512
      ],
      [
        "cc",
        -2.657823712172924
      ],
      [
        ")",
        -2.685447542750772
      ],
      [
        "N",
        -2.8042227554075634
      ],
      [
        "1",
        -3.100845616683875
      ],
      [
        "CC",
        -3.1167453923111683
      ],
      [
        "O",
        -3.133505155253289
      ],
      [
        "c2",
        -3.1445847036012857
      ],
      [
        "n",
        -3.148385428409485
      ],
      [
        "c",
        -3.16148110692175
      ],
      [
        "c1",
        -3.3201032038493032
      ],
      [
        "c(",
        -3.4292172195664
      ],
      [
        "=",
        -3.5630181635599616
      ],
      [
        "(",
        -3.7000686161348
      ],
      [
        "2",
        -3.703213071302052
      ],
      [
        "(C)",
        -3.9476036398641767
      ],
      [
        "3",
        -4.032172093353614
      ],
      [
        "4",
        -4.3456319427443475
      ],
      [
        "-",
        -4.429768651130519
      ],
      [
        "F",
        -4.924058450005386
      ],
      [
        "S",
        -5.177180932376631
      ],
      [
        "s",
        -5.451653154691963
      ],
      [
        "o",
        -5.471282693116118
      ],
      [
        "5",
        -5.8479587894742195
      ],
      [
        "#",
        -6.05812601533651
      ],
      [
        "]",
        -6.240643872617403
      ],
      [
        "[",
        -6.240643872617403
      ],
      [
        "B",
        -6.3538148569166175
      ],
      [
        "+",
        -6.786652939626091
      ],
      [
        "P",
        -7.44440274616364
      ],
      [
        "6",
        -7.625141202764638
      ],
      [
        "I",
        -8.403276598932894
      ],
      [
        "7",
        -9.39134772236847
      ],
      [
        "H",
        -10.093927976907528
      ],
      [
        "8",
        -11.003424484820185
      ],
      [
        "9",
        -11.947767496717995
      ],
      [
        "%",
        -13.46788164489584
      ],
      [
        "0",
        -13.839913407345596
      ],
      [
        "p",
        -14.05952378739618
      ],
      [
        "i",
        -17.98639482641526
      ],
      [
        "l",
        -17.98649482641526
      ],
      [
        "r",
        -17.98659482641526
      ],
      [
        "e",
        -17.98669482641526
      ],
      [
        "b",
        -17.98669482641526
      ]
    ],
    "byte_fallback": false
  }
}
