{
  "version": "1.0",
  "truncation": null,
  "padding": {
    "strategy": "BatchLongest",
    "direction": "Right",
    "pad_to_multiple_of": null,
    "pad_id": 2,
    "pad_type_id": 0,
    "pad_token": " "
  },
  "added_tokens": [
    {
      "id": 0,
      "content": "^",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "_",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": " ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "§",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "°",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Split",
    "pattern": {
      "Regex": "\\[[^\\]]+]|A[cglmrstu]?|B[aeihkr]?|C[adeflmorsu]?|D[bsy]?|E[rsu]?|F[emr]?|G[ade]?|H[efgos]?|I[nr]?|K[r]?|L[aru]?|M[dgnot]?|N[abdeiop]?|Os?|P[abdmortu]?|R[aefghnu]?|S[bcdegimnr]?|T[abcehilm]?|U|V|W|Xe|Yb?|Z[nr]?|as|b|c|n|o|p|se?|\\(|\\)|@@?|\\+\\d+|\\++|-\\d+|-+|\\.|-|=|#\\d{1}|\\$\\(?|:[0-9]*|~|@|\\/\\??|\\\\\\??|\\%[0-9]{2}|[0-9]|\\*|>>?|D\\d{1}|H\\d{1}|h\\d{1}|R\\d{1}|r\\d{1}|v\\d{1}|X\\d{1}|x\\d{1}|#\\d{1}|!|&|,|;"
    },
    "behavior": "Isolated",
    "invert": false
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "^",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "_",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "^": {
        "id": "^",
        "ids": [
          0
        ],
        "tokens": [
          "^"
        ]
      },
      "_": {
        "id": "_",
        "ids": [
          1
        ],
        "tokens": [
          "_"
        ]
      }
    }
  },
  "decoder": null,
  "model": {
    "type": "WordLevel",
    "vocab": {
      "^": 0,
      "_": 1,
      " ": 2,
      "§": 3,
      "°": 4,
      "c": 5,
      "C": 6,
      "(": 7,
      ")": 8,
      "1": 9,
      "O": 10,
      "2": 11,
      "=": 12,
      "N": 13,
      "n": 14,
      "3": 15,
      "F": 16,
      "4": 17,
      "-": 18,
      "S": 19,
      "Cl": 20,
      "[nH]": 21,
      "s": 22,
      "o": 23,
      "5": 24,
      "#": 25,
      "[O-]": 26,
      "[N+]": 27,
      "Br": 28,
      "Sc": 29,
      "P": 30,
      "6": 31,
      "[n+]": 32,
      "I": 33,
      "-2": 34,
      "[S+]": 35,
      "-3": 36,
      "7": 37,
      "[N-]": 38,
      "B": 39,
      "[Si]": 40,
      "[H]": 41,
      "-4": 42,
      "[Se]": 43,
      "-1": 44,
      "8": 45,
      "[C-]": 46,
      "[se]": 47,
      "[P+]": 48,
      "[O]": 49,
      "9": 50,
      "[s+]": 51,
      "[B-]": 52,
      "-5": 53,
      "[PH]": 54,
      "[o+]": 55,
      "[S-]": 56,
      "[NH3+]": 57,
      "[NH+]": 58,
      "[NH2+]": 59,
      "[BH2-]": 60,
      "[C+]": 61,
      "%10": 62,
      "[SH]": 63,
      "p": 64,
      "-6": 65,
      "[n-]": 66,
      "[O+]": 67,
      "[SeH]": 68,
      "%11": 69,
      "[SiH2]": 70,
      "[c+]": 71,
      "[IH2]": 72,
      "[se+]": 73,
      "[OH+]": 74,
      "Sn": 75,
      "[BH3-]": 76,
      "[I+]": 77,
      "[NH-]": 78,
      "[cH-]": 79,
      "[BH-]": 80,
      "[CH+]": 81,
      "[SiH]": 82,
      "[c-]": 83,
      "[nH+]": 84,
      "[Se+]": 85,
      "[cH+]": 86,
      "[CH-]": 87,
      "[F+]": 88,
      "[B]": 89,
      "[CH2+]": 90,
      "[CH]": 91,
      "[Cl+]": 92,
      "[N]": 93,
      "[P-]": 94,
      "-7": 95,
      "[Br+2]": 96,
      "[Br-]": 97,
      "[CH2]": 98,
      "[Cl+2]": 99,
      "[Cl+3]": 100,
      "[Cl-]": 101,
      "[F-]": 102,
      "[I+2]": 103,
      "[I+3]": 104,
      "[PH2+]": 105,
      "[Se-]": 106,
      "[SeH2]": 107,
      "[Si-]": 108,
      "[SiH-]": 109,
      "b": 110
    },
    "unk_token": "§"
  }
}
