{
  "version": "1.0",
  "truncation": null,
  "padding": {
    "strategy": "BatchLongest",
    "direction": "Right",
    "pad_to_multiple_of": null,
    "pad_id": 2,
    "pad_type_id": 0,
    "pad_token": " "
  },
  "added_tokens": [
    {
      "id": 0,
      "content": "^",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "_",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": " ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "§",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "°",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": null,
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "^",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "_",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "^": {
        "id": "^",
        "ids": [
          0
        ],
        "tokens": [
          "^"
        ]
      },
      "_": {
        "id": "_",
        "ids": [
          1
        ],
        "tokens": [
          "_"
        ]
      }
    }
  },
  "decoder": null,
  "model": {
    "type": "Unigram",
    "unk_id": 3,
    "vocab": [
      [
        "^",
        0.0
      ],
      [
        "_",
        0.0
      ],
      [
        " ",
        0.0
      ],
      [
        "§",
        0.0
      ],
      [
        "°",
        0.0
      ],
      [
        ")",
        -2.859733755729252
      ],
      [
        "(",
        -2.987780189688822
      ],
      [
        "4]",
        -3.0318673768058613
      ],
      [
        "5]",
        -3.080141239525865
      ],
      [
        ":[c:",
        -3.221282965284436
      ],
      [
        "-[C:",
        -3.240706453522911
      ],
      [
        "2]",
        -3.2941422760643917
      ],
      [
        "3]",
        -3.3605294055678527
      ],
      [
        "6]",
        -3.367981618505304
      ],
      [
        "7]",
        -3.4291301086090904
      ],
      [
        ":[#7;a:",
        -3.540232517491761
      ],
      [
        "1",
        -3.565611835008964
      ],
      [
        "-[",
        -3.5944127817328315
      ],
      [
        "1]",
        -3.6214611446859504
      ],
      [
        "-",
        -3.716242642360559
      ],
      [
        "8]",
        -3.758600070536328
      ],
      [
        ":",
        -3.799155540774059
      ],
      [
        "C",
        -3.923088478254865
      ],
      [
        "=[O;D1;H0:",
        -4.013582214336818
      ],
      [
        "-[c:",
        -4.021289770907607
      ],
      [
        "[",
        -4.116820898868612
      ],
      [
        "9]",
        -4.245532440179213
      ],
      [
        ".",
        -4.339465010561984
      ],
      [
        "[#7;a:",
        -4.4386346729719115
      ],
      [
        "C;D1;H3:",
        -4.453921949794131
      ],
      [
        "-[C;H0;D3;+0:",
        -4.576830861014219
      ],
      [
        "-[NH;D2;+0:",
        -4.606732101622347
      ],
      [
        "-[c;H0;D3;+0:",
        -4.673217301098287
      ],
      [
        "10]",
        -4.823230929228917
      ],
      [
        "[C:",
        -4.824140531752348
      ],
      [
        "[#7:",
        -4.887825623557932
      ],
      [
        "=",
        -4.908504890921864
      ],
      [
        "c",
        -4.9230620283740025
      ],
      [
        ";H0;D3;+0:",
        -4.943988295727687
      ],
      [
        "O",
        -4.945953137414068
      ],
      [
        "0",
        -4.99151199741277
      ],
      [
        "1](=[O;D1;H0:2])",
        -5.163212750333749
      ],
      [
        "[#8:",
        -5.2255906507151915
      ],
      [
        ">>Cl-[",
        -5.235436835688225
      ],
      [
        ";H0;D2;+0:",
        -5.254447768870837
      ],
      [
        "[#16;a:",
        -5.300340560434375
      ],
      [
        ">>Br-[",
        -5.3065115147179585
      ],
      [
        "-[NH2;D1;+0:",
        -5.330948820197705
      ],
      [
        "S",
        -5.344358982389406
      ],
      [
        ";H0;D",
        -5.432335141476204
      ],
      [
        "n",
        -5.531901465568342
      ],
      [
        "OH;D1;+0:",
        -5.551479223779098
      ],
      [
        "-[CH2;D2;+0:",
        -5.6381544196725795
      ],
      [
        "N",
        -5.6457610408602115
      ],
      [
        "1](:[c:2]):[c:3]",
        -5.730262874786736
      ],
      [
        "CH2;D2;+0:1]",
        -5.7777580581716865
      ],
      [
        "=[CH;D2;+0:",
        -5.827498955241607
      ],
      [
        "/",
        -5.842197381240647
      ],
      [
        "4",
        -5.921817497971147
      ],
      [
        "2",
        -5.962806590278594
      ],
      [
        ":[nH;D2;+0:",
        -6.239499122147252
      ],
      [
        "]",
        -6.286279266870709
      ],
      [
        "I",
        -6.33002139116263
      ],
      [
        "-[CH;D2;+0:",
        -6.3473980186257695
      ],
      [
        ":[cH;D2;+0:",
        -6.433374133598096
      ],
      [
        ".[NH2;D1;+0:",
        -6.514930216193092
      ],
      [
        "B",
        -6.866437007447586
      ],
      [
        "\\",
        -7.398096032727806
      ],
      [
        "3",
        -7.5952021932175455
      ],
      [
        "Z",
        -8.243189240382003
      ],
      [
        "M",
        -8.243289240382003
      ],
      [
        "D",
        -8.243389240382003
      ],
      [
        "r",
        -8.243489240382004
      ],
      [
        "F",
        -8.243589240382004
      ],
      [
        "u",
        -8.243689240382004
      ],
      [
        "H",
        -8.243789240382004
      ],
      [
        ">",
        -8.243889240382003
      ],
      [
        "P",
        -8.243989240382003
      ],
      [
        "9",
        -8.244089240382003
      ],
      [
        ";",
        -8.244189240382003
      ],
      [
        "8",
        -8.244289240382004
      ],
      [
        "5",
        -8.244389240382004
      ],
      [
        "o",
        -8.244489240382004
      ],
      [
        "@",
        -8.244589240382004
      ],
      [
        "+",
        -8.244689240382003
      ],
      [
        "#",
        -8.244789240382003
      ],
      [
        "l",
        -8.244889240382003
      ],
      [
        "i",
        -8.244989240382003
      ],
      [
        "g",
        -8.245089240382004
      ],
      [
        "6",
        -8.245189240382004
      ],
      [
        "a",
        -8.245289240382004
      ],
      [
        "7",
        -8.245389240382003
      ],
      [
        "s",
        -8.245389240382003
      ]
    ],
    "byte_fallback": false
  }
}
