{
  "version": "1.0",
  "truncation": null,
  "padding": {
    "strategy": "BatchLongest",
    "direction": "Right",
    "pad_to_multiple_of": null,
    "pad_id": 2,
    "pad_type_id": 0,
    "pad_token": " "
  },
  "added_tokens": [
    {
      "id": 0,
      "content": "^",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "_",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": " ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "§",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "°",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": null,
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "^",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "_",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "^": {
        "id": "^",
        "ids": [
          0
        ],
        "tokens": [
          "^"
        ]
      },
      "_": {
        "id": "_",
        "ids": [
          1
        ],
        "tokens": [
          "_"
        ]
      }
    }
  },
  "decoder": null,
  "model": {
    "type": "Unigram",
    "unk_id": 3,
    "vocab": [
      [
        "^",
        0.0
      ],
      [
        "_",
        0.0
      ],
      [
        " ",
        0.0
      ],
      [
        "§",
        0.0
      ],
      [
        "°",
        0.0
      ],
      [
        "C",
        -1.6001667997487026
      ],
      [
        "c",
        -3.197591774650446
      ],
      [
        "n",
        -3.2627388581623498
      ],
      [
        ")",
        -3.2999470497580337
      ],
      [
        "N",
        -3.3700640689013666
      ],
      [
        "(",
        -3.469216719199908
      ],
      [
        "c1",
        -3.5529870837694464
      ],
      [
        "2",
        -3.824379948608777
      ],
      [
        "(C)",
        -3.921477314212436
      ],
      [
        "O",
        -3.936373467425379
      ],
      [
        "c2",
        -3.9620343540387575
      ],
      [
        "1",
        -4.030936762063272
      ],
      [
        "C(=O)N",
        -4.039424011846963
      ],
      [
        "2)",
        -4.080234014274682
      ],
      [
        "C(=O)",
        -4.24899018543577
      ],
      [
        "=",
        -4.25178084819639
      ],
      [
        "3",
        -4.270500705749365
      ],
      [
        "NC(=O)",
        -4.2707968391048245
      ],
      [
        "c(",
        -4.3025164439044765
      ],
      [
        "C1",
        -4.337081487758349
      ],
      [
        "cc",
        -4.355523405556156
      ],
      [
        "CO",
        -4.357072010239376
      ],
      [
        "S",
        -4.483498920198172
      ],
      [
        "-",
        -4.530910098148305
      ],
      [
        "n1",
        -4.539568821464532
      ],
      [
        "3)",
        -4.557830337710949
      ],
      [
        "c2ccc",
        -4.5932005023278855
      ],
      [
        "c1cc",
        -4.651202680954456
      ],
      [
        "cc1",
        -4.744823823053006
      ],
      [
        "CCC",
        -4.806558483749363
      ],
      [
        "/",
        -4.867381172342688
      ],
      [
        "[C@@H](",
        -4.898257157954652
      ],
      [
        "nc(",
        -4.957252657841768
      ],
      [
        "o",
        -4.970646901950614
      ],
      [
        "c1ccccc1",
        -5.048526563083229
      ],
      [
        "CC1",
        -5.075125949309455
      ],
      [
        "s",
        -5.115937053884335
      ],
      [
        "c(F)c",
        -5.173166849289605
      ],
      [
        "(=O)",
        -5.197260278953867
      ],
      [
        "CCN(",
        -5.2141531829115015
      ],
      [
        "O=C(",
        -5.235913429357523
      ],
      [
        "O)",
        -5.25560332373467
      ],
      [
        "(Cl)c",
        -5.257200528281479
      ],
      [
        "2)cc1",
        -5.2654702004764
      ],
      [
        "F)",
        -5.275796654934888
      ],
      [
        "=O)",
        -5.2835676592060645
      ],
      [
        "[C@",
        -5.353356898012809
      ],
      [
        "S(=O)(=O)",
        -5.378285779050303
      ],
      [
        "c1cccc(",
        -5.386692454846906
      ],
      [
        "c2ccccc2",
        -5.394043397757154
      ],
      [
        "[C@@H](C)",
        -5.403312685350468
      ],
      [
        "[NH+]",
        -5.422284106205156
      ],
      [
        "[C@H](",
        -5.455536100868901
      ],
      [
        "[C@H]2",
        -5.484260591290352
      ],
      [
        "c3ccccc3",
        -5.49989009909808
      ],
      [
        "4",
        -5.512630804995988
      ],
      [
        "[C@H](C)",
        -5.536765403174328
      ],
      [
        "[nH]",
        -5.602915952264908
      ],
      [
        "[NH2+]",
        -5.6679781096856034
      ],
      [
        "[C@@H]2",
        -5.719712501187443
      ],
      [
        "C[NH+](C",
        -5.80408472198986
      ],
      [
        "[O-])",
        -5.831976517641253
      ],
      [
        "c3cc",
        -6.062851967972283
      ],
      [
        "[C@H]1",
        -6.070308269117449
      ],
      [
        "c(Br)c",
        -6.103279842675327
      ],
      [
        "F",
        -6.175002570056694
      ],
      [
        "[NH3+]",
        -6.3361947250502855
      ],
      [
        "[C@@H]1",
        -6.347164074187049
      ],
      [
        "C(F)(F)F)",
        -6.515223699524523
      ],
      [
        "c1ccc2c(c1)",
        -6.640372440066099
      ],
      [
        "[C@@H]3",
        -6.68582315120795
      ],
      [
        "C(N)=O",
        -6.686646168846435
      ],
      [
        "c4ccccc4",
        -6.836073792088756
      ],
      [
        "c([N+](=O)[O-])",
        -6.885328278949286
      ],
      [
        "5",
        -7.012952862741698
      ],
      [
        "\\",
        -9.330181856023442
      ],
      [
        "+",
        -9.330281856023442
      ],
      [
        "l",
        -9.330381856023442
      ],
      [
        "@",
        -9.33048185602344
      ],
      [
        "B",
        -9.33058185602344
      ],
      [
        "7",
        -9.33068185602344
      ],
      [
        "r",
        -9.33078185602344
      ],
      [
        "H",
        -9.330881856023442
      ],
      [
        "#",
        -9.330981856023442
      ],
      [
        "]",
        -9.331081856023442
      ],
      [
        "6",
        -9.331181856023314
      ],
      [
        "[",
        -9.33118185602344
      ],
      [
        "I",
        -9.33118185602344
      ]
    ],
    "byte_fallback": false
  }
}
