{
  "version": "1.0",
  "truncation": null,
  "padding": {
    "strategy": "BatchLongest",
    "direction": "Right",
    "pad_to_multiple_of": null,
    "pad_id": 2,
    "pad_type_id": 0,
    "pad_token": " "
  },
  "added_tokens": [
    {
      "id": 0,
      "content": "^",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "_",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": " ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "§",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "°",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": null,
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "^",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "_",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "^": {
        "id": "^",
        "ids": [
          0
        ],
        "tokens": [
          "^"
        ]
      },
      "_": {
        "id": "_",
        "ids": [
          1
        ],
        "tokens": [
          "_"
        ]
      }
    }
  },
  "decoder": null,
  "model": {
    "type": "Unigram",
    "unk_id": 3,
    "vocab": [
      [
        "^",
        0.0
      ],
      [
        "_",
        0.0
      ],
      [
        " ",
        0.0
      ],
      [
        "§",
        0.0
      ],
      [
        "°",
        0.0
      ],
      [
        "C",
        -1.6001667997487026
      ],
      [
        "c",
        -3.197591774650445
      ],
      [
        "n",
        -3.2627388581623498
      ],
      [
        ")",
        -3.299947049758032
      ],
      [
        "N",
        -3.3700640689013657
      ],
      [
        "(",
        -3.469216719199907
      ],
      [
        "c1",
        -3.5529870837694455
      ],
      [
        "2",
        -3.824379948608777
      ],
      [
        "(C)",
        -3.921477314212436
      ],
      [
        "O",
        -3.936373467425377
      ],
      [
        "c2",
        -3.9620343540387566
      ],
      [
        "1",
        -4.030936762063271
      ],
      [
        "C(=O)N",
        -4.039424011846964
      ],
      [
        "2)",
        -4.080234014274682
      ],
      [
        "C(=O)",
        -4.248990185435772
      ],
      [
        "=",
        -4.25178084819639
      ],
      [
        "3",
        -4.270500705749362
      ],
      [
        "NC(=O)",
        -4.270796839104827
      ],
      [
        "c(",
        -4.3025164439044765
      ],
      [
        "C1",
        -4.337081487758349
      ],
      [
        "cc",
        -4.355523405556155
      ],
      [
        "CO",
        -4.357072010239377
      ],
      [
        "S",
        -4.48349892019817
      ],
      [
        "-",
        -4.530910098148306
      ],
      [
        "n1",
        -4.539568821464533
      ],
      [
        "3)",
        -4.557830337710947
      ],
      [
        "c2ccc",
        -4.593200502327885
      ],
      [
        "c1cc",
        -4.651202680954456
      ],
      [
        "cc1",
        -4.744823823053006
      ],
      [
        "CCC",
        -4.806558483749368
      ],
      [
        "/",
        -4.867381172342688
      ],
      [
        "[C@@H](",
        -4.8982571579546486
      ],
      [
        "nc(",
        -4.957252657841771
      ],
      [
        "o",
        -4.970646901950615
      ],
      [
        "c1ccccc1",
        -5.04852656308323
      ],
      [
        "CC1",
        -5.075125949309457
      ],
      [
        "s",
        -5.115937053884334
      ],
      [
        "c(F)c",
        -5.173166849289604
      ],
      [
        "(=O)",
        -5.197260278953865
      ],
      [
        "CCN(",
        -5.214153182911504
      ],
      [
        "O=C(",
        -5.235913429357523
      ],
      [
        "O)",
        -5.255603323734671
      ],
      [
        "(Cl)c",
        -5.25720052828148
      ],
      [
        "2)cc1",
        -5.2654702004764
      ],
      [
        "F)",
        -5.27579665493489
      ],
      [
        "=O)",
        -5.283567659206063
      ],
      [
        "[C@",
        -5.353356898012802
      ],
      [
        "S(=O)(=O)",
        -5.378285779050305
      ],
      [
        "c1cccc(",
        -5.386692454846908
      ],
      [
        "c2ccccc2",
        -5.394043397757156
      ],
      [
        "[C@@H](C)",
        -5.403312685350469
      ],
      [
        "[NH+]",
        -5.422284106205155
      ],
      [
        "[C@H](",
        -5.4555361008689
      ],
      [
        "[C@H]2",
        -5.484260591290352
      ],
      [
        "c3ccccc3",
        -5.4998900990980815
      ],
      [
        "4",
        -5.512630804995981
      ],
      [
        "[C@H](C)",
        -5.53676540317433
      ],
      [
        "[nH]",
        -5.6029159522649055
      ],
      [
        "[NH2+]",
        -5.667978109685605
      ],
      [
        "[C@@H]2",
        -5.719712501187445
      ],
      [
        "C[NH+](C",
        -5.80408472198986
      ],
      [
        "[O-])",
        -5.83197651764125
      ],
      [
        "c3cc",
        -6.062851967972284
      ],
      [
        "[C@H]1",
        -6.070308269117453
      ],
      [
        "c(Br)c",
        -6.103279842675327
      ],
      [
        "F",
        -6.175002570056697
      ],
      [
        "[NH3+]",
        -6.336194725050287
      ],
      [
        "[C@@H]1",
        -6.347164074187045
      ],
      [
        "C(F)(F)F)",
        -6.515223699524527
      ],
      [
        "c1ccc2c(c1)",
        -6.640372440066095
      ],
      [
        "[C@@H]3",
        -6.685823151207946
      ],
      [
        "C(N)=O",
        -6.686646168846442
      ],
      [
        "c4ccccc4",
        -6.836073792088755
      ],
      [
        "c([N+](=O)[O-])",
        -6.885328278949284
      ],
      [
        "5",
        -7.012952862741679
      ],
      [
        "r",
        -9.33018185602326
      ],
      [
        "@",
        -9.33028185602326
      ],
      [
        "]",
        -9.33038185602326
      ],
      [
        "+",
        -9.330481856023258
      ],
      [
        "#",
        -9.330581856023258
      ],
      [
        "l",
        -9.330681856023258
      ],
      [
        "B",
        -9.330781856023258
      ],
      [
        "H",
        -9.33088185602326
      ],
      [
        "\\",
        -9.33098185602326
      ],
      [
        "7",
        -9.33108185602326
      ],
      [
        "I",
        -9.331181855983491
      ],
      [
        "[",
        -9.331181856023258
      ],
      [
        "6",
        -9.331181856023258
      ]
    ],
    "byte_fallback": false
  }
}
