{
  "version": "1.0",
  "truncation": null,
  "padding": {
    "strategy": "BatchLongest",
    "direction": "Right",
    "pad_to_multiple_of": null,
    "pad_id": 2,
    "pad_type_id": 0,
    "pad_token": " "
  },
  "added_tokens": [
    {
      "id": 0,
      "content": "^",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "_",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": " ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "§",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "°",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": null,
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "^",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "_",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "^": {
        "id": "^",
        "ids": [
          0
        ],
        "tokens": [
          "^"
        ]
      },
      "_": {
        "id": "_",
        "ids": [
          1
        ],
        "tokens": [
          "_"
        ]
      }
    }
  },
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "§",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "vocab": {
      "^": 0,
      "_": 1,
      " ": 2,
      "§": 3,
      "°": 4,
      "#": 5,
      "(": 6,
      ")": 7,
      "+": 8,
      "-": 9,
      ".": 10,
      "/": 11,
      "0": 12,
      "1": 13,
      "2": 14,
      "3": 15,
      "4": 16,
      "5": 17,
      "6": 18,
      "7": 19,
      "8": 20,
      "9": 21,
      ":": 22,
      ";": 23,
      "=": 24,
      ">": 25,
      "@": 26,
      "B": 27,
      "C": 28,
      "D": 29,
      "F": 30,
      "H": 31,
      "I": 32,
      "M": 33,
      "N": 34,
      "O": 35,
      "P": 36,
      "S": 37,
      "Z": 38,
      "[": 39,
      "\\": 40,
      "]": 41,
      "a": 42,
      "c": 43,
      "g": 44,
      "i": 45,
      "l": 46,
      "n": 47,
      "o": 48,
      "r": 49,
      "s": 50,
      "u": 51,
      "-[": 52,
      ";D": 53,
      "0:": 54,
      ":[": 55,
      ";+": 56,
      ";+0:": 57,
      ";H": 58,
      "c:": 59,
      "-[C": 60,
      "])": 61,
      "]:[": 62,
      "](": 63,
      ";D1": 64,
      ";H0": 65,
      ";H0;D": 66,
      ";a": 67,
      ";a:": 68,
      "#7": 69,
      "3;+0:": 70,
      ";D1;H": 71,
      "=[": 72,
      ";H0;D3;+0:": 73,
      "-[C:": 74,
      "#7;a:": 75,
      "2;+0:": 76,
      "]:[c:": 77,
      "]-[": 78,
      ";D1;H0:": 79,
      ";D2;+0:": 80,
      ":[c:": 81,
      "O;D1;H0:": 82,
      "=[O;D1;H0:": 83,
      "1](": 84,
      ">>": 85,
      "]-[C:": 86,
      "c;H0;D3;+0:": 87,
      "2])": 88,
      "]>>": 89,
      "-[CH": 90,
      "].": 91,
      "]:[#7;a:": 92,
      "C:": 93,
      "H;D2;+0:": 94,
      "].[": 95,
      ";D1;+0:": 96,
      "-C": 97,
      "])-[": 98,
      "]-[N": 99,
      ":1": 100,
      "2;D2;+0:": 101,
      "-[CH2;D2;+0:": 102,
      ":[#7;a:": 103,
      "-[C;H0;D3;+0:": 104,
      ";D1;H3": 105,
      "#8": 106,
      "]=[": 107,
      ";D1;H3:": 108,
      "-[c;H0;D3;+0:": 109,
      "]1": 110,
      "]-[c:": 111,
      "-[CH2;D2;+0:1": 112,
      "[#7;a:": 113,
      "-[C;H0;D3;+0:1](": 114,
      ";H0;D2;+0:": 115,
      "[C:": 116,
      "-[C;D1;H3:": 117,
      "6]": 118,
      "7]": 119,
      "](=[O;D1;H0:": 120,
      "](-[": 121,
      "4]:[c:": 122,
      "]>>C": 123,
      "#8:": 124,
      "10": 125,
      "H2": 126,
      "H2;D1;+0:": 127,
      "]):[c:": 128,
      "5]": 129,
      ";D3;+0:": 130,
      "#7:": 131,
      ":[c:3": 132,
      "#1": 133,
      "2]": 134,
      "#16": 135,
      "8]": 136,
      "2])-[": 137,
      "-O": 138,
      "]:[c;H0;D3;+0:": 139,
      "]-[NH;D2;+0:": 140,
      "Br": 141,
      "](-[C:": 142,
      "-[C;H0;D3;+0:1](=[O;D1;H0:": 143,
      "5]:[c:": 144,
      "])-[C:": 145,
      "](:[c:": 146,
      "c:c:": 147,
      "2]):[c:3": 148,
      "#16;a:": 149,
      "]=[C:": 150,
      "H;D1;+0:": 151,
      "1](:[c:": 152,
      "](:[#7;a:": 153,
      "-[CH;D3;+0:": 154,
      "3]": 155,
      "]>>Cl": 156,
      "]>>O": 157,
      "].[C:": 158,
      "])=[O;D1;H0:": 159,
      "4]": 160,
      "9]": 161,
      "-C)": 162,
      "]-[C:2": 163,
      "]1:[c:": 164,
      "c:3": 165,
      "1]": 166,
      "NH;D2;+0:": 167,
      "]>>Br": 168,
      "OH;D1;+0:": 169,
      "[C": 170,
      "4]:[#7;a:": 171,
      "-[C;H0;D3;+0:1](=[O;D1;H0:2])-[": 172,
      "=[C": 173,
      "2]:[c:": 174,
      "3]:[c:": 175,
      "]=[C": 176,
      "=[O;D1;H0:3": 177,
      "]-[NH2;D1;+0:": 178,
      "1:": 179,
      "1](:[c:2]):[c:3": 180
    },
    "merges": [
      "- [",
      "; D",
      "0 :",
      ": [",
      "; +",
      ";+ 0:",
      "; H",
      "c :",
      "-[ C",
      "] )",
      "] :[",
      "] (",
      ";D 1",
      ";H 0",
      ";H0 ;D",
      "; a",
      ";a :",
      "# 7",
      "3 ;+0:",
      ";D1 ;H",
      "= [",
      ";H0;D 3;+0:",
      "-[C :",
      "#7 ;a:",
      "2 ;+0:",
      "]:[ c:",
      "] -[",
      ";D1;H 0:",
      ";D 2;+0:",
      ":[ c:",
      "O ;D1;H0:",
      "=[ O;D1;H0:",
      "1 ](",
      "> >",
      "] -[C:",
      "c ;H0;D3;+0:",
      "2 ])",
      "] >>",
      "-[C H",
      "] .",
      "]:[ #7;a:",
      "C :",
      "H ;D2;+0:",
      "]. [",
      ";D1 ;+0:",
      "- C",
      "]) -[",
      "]-[ N",
      ": 1",
      "2 ;D2;+0:",
      "-[CH 2;D2;+0:",
      ":[ #7;a:",
      "-[C ;H0;D3;+0:",
      ";D1;H 3",
      "# 8",
      "] =[",
      ";D1;H3 :",
      "-[ c;H0;D3;+0:",
      "] 1",
      "]-[ c:",
      "-[CH2;D2;+0: 1",
      "[ #7;a:",
      "-[C;H0;D3;+0: 1](",
      ";H0;D 2;+0:",
      "[ C:",
      "-[C ;D1;H3:",
      "6 ]",
      "7 ]",
      "]( =[O;D1;H0:",
      "]( -[",
      "4 ]:[c:",
      "]>> C",
      "#8 :",
      "1 0",
      "H 2",
      "H2 ;D1;+0:",
      "]) :[c:",
      "5 ]",
      ";D 3;+0:",
      "#7 :",
      ":[c: 3",
      "# 1",
      "2 ]",
      "#1 6",
      "8 ]",
      "2]) -[",
      "- O",
      "]:[ c;H0;D3;+0:",
      "]-[N H;D2;+0:",
      "B r",
      "]( -[C:",
      "-[C;H0;D3;+0:1]( =[O;D1;H0:",
      "5 ]:[c:",
      "]) -[C:",
      "]( :[c:",
      "c: c:",
      "2]) :[c:3",
      "#16 ;a:",
      "]=[ C:",
      "H ;D1;+0:",
      "1]( :[c:",
      "]( :[#7;a:",
      "-[CH ;D3;+0:",
      "3 ]",
      "]>>C l",
      "]>> O",
      "].[ C:",
      "]) =[O;D1;H0:",
      "4 ]",
      "9 ]",
      "-C )",
      "]-[C: 2",
      "]1 :[c:",
      "c: 3",
      "1 ]",
      "N H;D2;+0:",
      "]>> Br",
      "O H;D1;+0:",
      "[ C",
      "4 ]:[#7;a:",
      "-[C;H0;D3;+0:1](=[O;D1;H0: 2])-[",
      "=[ C",
      "2 ]:[c:",
      "3 ]:[c:",
      "]=[ C",
      "=[O;D1;H0: 3",
      "]-[N H2;D1;+0:",
      "1 :",
      "1](:[c: 2]):[c:3"
    ]
  }
}
