{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "^",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "_",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": " ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "§",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "°",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": null,
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "^",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "_",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "^": {
        "id": "^",
        "ids": [
          0
        ],
        "tokens": [
          "^"
        ]
      },
      "_": {
        "id": "_",
        "ids": [
          1
        ],
        "tokens": [
          "_"
        ]
      }
    }
  },
  "decoder": null,
  "model": {
    "type": "Unigram",
    "unk_id": 3,
    "vocab": [
      [
        "^",
        0.0
      ],
      [
        "_",
        0.0
      ],
      [
        " ",
        0.0
      ],
      [
        "§",
        0.0
      ],
      [
        "°",
        0.0
      ],
      [
        "C",
        -2.3670857094110875
      ],
      [
        "N",
        -3.576732605483121
      ],
      [
        ")",
        -3.611994925007229
      ],
      [
        "O",
        -3.7013178103984306
      ],
      [
        "c1",
        -3.789173703159321
      ],
      [
        "(",
        -3.844422852612889
      ],
      [
        "CC",
        -3.939367828514104
      ],
      [
        "c(",
        -4.009258098054277
      ],
      [
        "n",
        -4.139539154660575
      ],
      [
        "C(=O)N",
        -4.225314440284592
      ],
      [
        "1",
        -4.246204754413334
      ],
      [
        "C(=O)",
        -4.259075347673516
      ],
      [
        "C1",
        -4.30128122672242
      ],
      [
        "2",
        -4.314354445831862
      ],
      [
        "c",
        -4.363104807300848
      ],
      [
        "C(",
        -4.42845762655843
      ],
      [
        "O)",
        -4.438554378857976
      ],
      [
        "cc",
        -4.475123793705391
      ],
      [
        "NC(=O)",
        -4.4874540886253165
      ],
      [
        "2)",
        -4.505819955230102
      ],
      [
        "cc1",
        -4.519758994957016
      ],
      [
        "3)",
        -4.524166343395827
      ],
      [
        "C2",
        -4.526709130307797
      ],
      [
        "c2",
        -4.529929885988928
      ],
      [
        "(C)",
        -4.55099881493547
      ],
      [
        "CC1",
        -4.557130254630117
      ],
      [
        "n1",
        -4.609537639086238
      ],
      [
        "=",
        -4.754594025099383
      ],
      [
        "cn",
        -4.808953904227806
      ],
      [
        "OC",
        -4.809543149332313
      ],
      [
        "c1ccc(",
        -4.825777142821153
      ],
      [
        "c3",
        -4.837203747059872
      ],
      [
        "CO",
        -4.853084512275169
      ],
      [
        "[nH]",
        -4.858347354053608
      ],
      [
        "o",
        -4.892445508574712
      ],
      [
        "c2ccc(",
        -4.900137288238513
      ],
      [
        "-",
        -4.915171701469822
      ],
      [
        "3",
        -4.945775208172822
      ],
      [
        "S(=O)(=O)",
        -4.960661166671505
      ],
      [
        "=O)",
        -4.989058077641406
      ],
      [
        "S",
        -4.991767682562511
      ],
      [
        "C)",
        -5.024935916651286
      ],
      [
        "c1ccccc1",
        -5.0259576080340675
      ],
      [
        "Cl)",
        -5.053261454754443
      ],
      [
        "CCC",
        -5.098749037755471
      ],
      [
        "s",
        -5.108745056390369
      ],
      [
        "C(O)",
        -5.13444193363773
      ],
      [
        "C=C",
        -5.140606412989607
      ],
      [
        "C(C",
        -5.174228948804485
      ],
      [
        "2)cc1",
        -5.183564083702166
      ],
      [
        "n2",
        -5.209626278278833
      ],
      [
        "c2n",
        -5.232468795078113
      ],
      [
        "cc2",
        -5.247614519595649
      ],
      [
        "4)",
        -5.265256227234602
      ],
      [
        "c2ccccc2)",
        -5.279550817910641
      ],
      [
        "c(Cl)c",
        -5.280316537808073
      ],
      [
        "c2ccccc2",
        -5.28273733814032
      ],
      [
        "cc(",
        -5.299264225979039
      ],
      [
        "c(=O)",
        -5.332478171393131
      ],
      [
        "C3",
        -5.333246479166888
      ],
      [
        "=N",
        -5.341192279551059
      ],
      [
        "c2ccc",
        -5.355489904722081
      ],
      [
        "c(-",
        -5.369533831876344
      ],
      [
        "F)",
        -5.373477702065255
      ],
      [
        "nc",
        -5.374035152658893
      ],
      [
        "c4",
        -5.387736064225425
      ],
      [
        "c1c",
        -5.3899721385786865
      ],
      [
        "c3c",
        -5.414538349932162
      ],
      [
        "1)",
        -5.433595249170038
      ],
      [
        "cc2)",
        -5.433627680222834
      ],
      [
        "C(C)",
        -5.454922318458287
      ],
      [
        "5",
        -5.460599976477237
      ],
      [
        "CC(",
        -5.463342379442878
      ],
      [
        "c2c",
        -5.475861395427682
      ],
      [
        "c3ccc(",
        -5.481617557997863
      ],
      [
        "N1",
        -5.483493096363459
      ],
      [
        "O=C(",
        -5.503170643675116
      ],
      [
        "COc1ccc(",
        -5.517972959676573
      ],
      [
        "c3ccc",
        -5.590728164827876
      ],
      [
        "CC2)",
        -5.606852549690043
      ],
      [
        "C(C)(C)",
        -5.612145895025645
      ],
      [
        "N(C",
        -5.628578190664818
      ],
      [
        "C(=O)O)",
        -5.654565836846121
      ],
      [
        "c1cccc(",
        -5.6584901501730425
      ],
      [
        "c(F)c",
        -5.669168863518788
      ],
      [
        "c3ccccc3",
        -5.673730185416952
      ],
      [
        "Cc1c",
        -5.680938074213374
      ],
      [
        "CC(C)",
        -5.686285744062111
      ],
      [
        "C(=O)O",
        -5.6890934746630055
      ],
      [
        "CN",
        -5.691927273439374
      ],
      [
        "c1ccc",
        -5.692407073188102
      ],
      [
        "CCN",
        -5.717307958646893
      ],
      [
        "c4cc",
        -5.735255209714108
      ],
      [
        "N2CC",
        -5.736995212877112
      ],
      [
        "OC)",
        -5.783119388373242
      ],
      [
        "c3ccccc3)",
        -5.799938426506907
      ],
      [
        "nc2",
        -5.864699265092055
      ],
      [
        "cc3",
        -5.864939328771666
      ],
      [
        "nc(",
        -5.871413175513343
      ],
      [
        "c2cc",
        -5.884251508414659
      ],
      [
        "c1ccccc1)",
        -5.902171209818039
      ],
      [
        "c(C)c",
        -5.919273333008714
      ],
      [
        "c(OC)c",
        -5.920299812715886
      ],
      [
        "CCCC",
        -5.92143749842757
      ],
      [
        "c2c(",
        -5.9220075542327475
      ],
      [
        "C4",
        -5.923307110456733
      ],
      [
        "Cc1ccc(",
        -5.94200353403116
      ],
      [
        "C1CC",
        -5.950272556020009
      ],
      [
        "ccc2",
        -5.977430071675942
      ],
      [
        "CCN(C",
        -5.98929521334871
      ],
      [
        "c(O)c",
        -5.993987023701131
      ],
      [
        "C(N)",
        -5.9952965291779154
      ],
      [
        "cc(-",
        -6.018246323074026
      ],
      [
        "CC2",
        -6.022398533077942
      ],
      [
        "CC3)",
        -6.04548188136323
      ],
      [
        "4",
        -6.048872651049832
      ],
      [
        "c2cc(",
        -6.069206876117075
      ],
      [
        "C(F)(F)F)",
        -6.0804321883121215
      ],
      [
        "n(C",
        -6.092708383821515
      ],
      [
        "O=C(N",
        -6.098009975942894
      ],
      [
        "c3n",
        -6.121645550968054
      ],
      [
        "c4ccccc4",
        -6.145269524620591
      ],
      [
        "C(C)C)",
        -6.148492486332856
      ],
      [
        "[N+](=O)[O-])",
        -6.161581937519614
      ],
      [
        "C#N)",
        -6.19019507740828
      ],
      [
        "=C(",
        -6.221592791298136
      ],
      [
        "CS",
        -6.2258516493737055
      ],
      [
        "nc(-",
        -6.285443754525042
      ],
      [
        "CN(C)",
        -6.319784985142304
      ],
      [
        "CCCCCC",
        -6.35594720150192
      ],
      [
        "N1CCN(",
        -6.384967298711743
      ],
      [
        "F",
        -6.422622388596507
      ],
      [
        "C3CC",
        -6.451922867430504
      ],
      [
        "c(C(F)(F)F)c",
        -6.475524714269936
      ],
      [
        "CN1CC",
        -6.4756374136123895
      ],
      [
        "c(-c3cc",
        -6.480491132622776
      ],
      [
        "CN(C(=O)",
        -6.4956203324746
      ],
      [
        "Br)",
        -6.545501147116248
      ],
      [
        "O=C1",
        -6.579529366590574
      ],
      [
        "]",
        -6.581562880127784
      ],
      [
        "[",
        -6.581562880127784
      ],
      [
        "c1ccc2c(c1)",
        -6.618559989417037
      ],
      [
        "c1ccc(Cl)cc1",
        -6.639175001718414
      ],
      [
        "C1=O",
        -6.644361703758314
      ],
      [
        "N=C",
        -6.671347281034768
      ],
      [
        "c(Br)c",
        -6.688652735905373
      ],
      [
        "c1ccc(-c2c",
        -6.736898465226075
      ],
      [
        "n(-",
        -6.745668415329096
      ],
      [
        "#",
        -6.777277708216408
      ],
      [
        "c(C)n",
        -6.790227348431575
      ],
      [
        "N2CCN(",
        -6.8187302399900585
      ],
      [
        "+",
        -6.908160894499925
      ],
      [
        "c2ccccc12",
        -6.917584481977999
      ],
      [
        "6",
        -7.04630401822326
      ],
      [
        "P(=O)(",
        -7.052860000279621
      ],
      [
        "C(F)(F)",
        -7.164782238794308
      ],
      [
        "[O-]",
        -7.17149015501669
      ],
      [
        "[N+]",
        -7.256318503537777
      ],
      [
        "S(C)(=O)=O)",
        -7.3979985379663376
      ],
      [
        "c5ccccc5",
        -7.70951585527745
      ],
      [
        "B",
        -7.76885961902372
      ],
      [
        "I",
        -7.824439414391488
      ],
      [
        "O=S(=O)(",
        -7.86001926100138
      ],
      [
        "P",
        -8.632962569605594
      ],
      [
        "7",
        -8.812510537827128
      ],
      [
        "H",
        -9.515090926822122
      ],
      [
        "8",
        -10.424587300278862
      ],
      [
        "9",
        -11.368930312176657
      ],
      [
        "%",
        -12.889044460354429
      ],
      [
        "0",
        -13.261076222804254
      ],
      [
        "p",
        -13.480686602854744
      ],
      [
        "i",
        -17.407557641873808
      ],
      [
        "l",
        -17.407657641873808
      ],
      [
        "r",
        -17.407757641873808
      ],
      [
        "b",
        -17.407857641873807
      ],
      [
        "e",
        -17.407857641873807
      ]
    ],
    "byte_fallback": false
  }
}
