{
  "version": "1.0",
  "truncation": null,
  "padding": {
    "strategy": "BatchLongest",
    "direction": "Right",
    "pad_to_multiple_of": null,
    "pad_id": 2,
    "pad_type_id": 0,
    "pad_token": " "
  },
  "added_tokens": [
    {
      "id": 0,
      "content": "^",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "_",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": " ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "§",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "°",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": null,
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "^",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "_",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "^": {
        "id": "^",
        "ids": [
          0
        ],
        "tokens": [
          "^"
        ]
      },
      "_": {
        "id": "_",
        "ids": [
          1
        ],
        "tokens": [
          "_"
        ]
      }
    }
  },
  "decoder": null,
  "model": {
    "type": "Unigram",
    "unk_id": 3,
    "vocab": [
      [
        "^",
        0.0
      ],
      [
        "_",
        0.0
      ],
      [
        " ",
        0.0
      ],
      [
        "§",
        0.0
      ],
      [
        "°",
        0.0
      ],
      [
        "C",
        -2.3670857094118443
      ],
      [
        "N",
        -3.5767326054834605
      ],
      [
        ")",
        -3.611994925006522
      ],
      [
        "O",
        -3.7013178103986206
      ],
      [
        "c1",
        -3.7891737031590225
      ],
      [
        "(",
        -3.844422852612425
      ],
      [
        "CC",
        -3.93936782851374
      ],
      [
        "c(",
        -4.009258098054188
      ],
      [
        "n",
        -4.139539154660383
      ],
      [
        "C(=O)N",
        -4.225314440284734
      ],
      [
        "1",
        -4.246204754413393
      ],
      [
        "C(=O)",
        -4.259075347672752
      ],
      [
        "C1",
        -4.301281226722315
      ],
      [
        "2",
        -4.31435444583205
      ],
      [
        "c",
        -4.36310480730147
      ],
      [
        "C(",
        -4.428457626559338
      ],
      [
        "O)",
        -4.438554378857754
      ],
      [
        "cc",
        -4.47512379370635
      ],
      [
        "NC(=O)",
        -4.487454088625094
      ],
      [
        "2)",
        -4.505819955230107
      ],
      [
        "cc1",
        -4.519758994957103
      ],
      [
        "3)",
        -4.524166343395692
      ],
      [
        "C2",
        -4.526709130307816
      ],
      [
        "c2",
        -4.529929885988846
      ],
      [
        "(C)",
        -4.550998814935596
      ],
      [
        "CC1",
        -4.557130254630271
      ],
      [
        "n1",
        -4.609537639086064
      ],
      [
        "=",
        -4.754594025099646
      ],
      [
        "cn",
        -4.808953904227673
      ],
      [
        "OC",
        -4.809543149331887
      ],
      [
        "c1ccc(",
        -4.825777142821117
      ],
      [
        "c3",
        -4.837203747059643
      ],
      [
        "CO",
        -4.8530845122748065
      ],
      [
        "[nH]",
        -4.858347354053279
      ],
      [
        "o",
        -4.892445508574612
      ],
      [
        "c2ccc(",
        -4.900137288238421
      ],
      [
        "-",
        -4.915171701469827
      ],
      [
        "3",
        -4.945775208172575
      ],
      [
        "S(=O)(=O)",
        -4.960661166671205
      ],
      [
        "=O)",
        -4.98905807764168
      ],
      [
        "S",
        -4.991767682562692
      ],
      [
        "C)",
        -5.024935916650753
      ],
      [
        "c1ccccc1",
        -5.025957608033954
      ],
      [
        "Cl)",
        -5.053261454754516
      ],
      [
        "CCC",
        -5.098749037755079
      ],
      [
        "s",
        -5.108745056390319
      ],
      [
        "C(O)",
        -5.134441933637497
      ],
      [
        "C=C",
        -5.140606412989511
      ],
      [
        "C(C",
        -5.174228948804329
      ],
      [
        "2)cc1",
        -5.183564083702075
      ],
      [
        "n2",
        -5.2096262782786535
      ],
      [
        "c2n",
        -5.232468795077949
      ],
      [
        "cc2",
        -5.247614519595464
      ],
      [
        "4)",
        -5.265256227234527
      ],
      [
        "c2ccccc2)",
        -5.279550817910451
      ],
      [
        "c(Cl)c",
        -5.280316537807948
      ],
      [
        "c2ccccc2",
        -5.282737338140285
      ],
      [
        "cc(",
        -5.29926422597905
      ],
      [
        "c(=O)",
        -5.33247817139304
      ],
      [
        "C3",
        -5.333246479166883
      ],
      [
        "=N",
        -5.34119227955116
      ],
      [
        "c2ccc",
        -5.355489904722413
      ],
      [
        "c(-",
        -5.3695338318761845
      ],
      [
        "F)",
        -5.3734777020652285
      ],
      [
        "nc",
        -5.374035152658825
      ],
      [
        "c4",
        -5.387736064225349
      ],
      [
        "c1c",
        -5.389972138578507
      ],
      [
        "c3c",
        -5.414538349932057
      ],
      [
        "1)",
        -5.4335952491698905
      ],
      [
        "cc2)",
        -5.433627680222749
      ],
      [
        "C(C)",
        -5.454922318457955
      ],
      [
        "5",
        -5.460599976477123
      ],
      [
        "CC(",
        -5.463342379442739
      ],
      [
        "c2c",
        -5.475861395427577
      ],
      [
        "c3ccc(",
        -5.481617557997776
      ],
      [
        "N1",
        -5.483493096363377
      ],
      [
        "O=C(",
        -5.503170643675059
      ],
      [
        "COc1ccc(",
        -5.517972959676426
      ],
      [
        "c3ccc",
        -5.5907281648278015
      ],
      [
        "CC2)",
        -5.606852549689821
      ],
      [
        "C(C)(C)",
        -5.612145895025526
      ],
      [
        "N(C",
        -5.6285781906647845
      ],
      [
        "C(=O)O)",
        -5.654565836845956
      ],
      [
        "c1cccc(",
        -5.658490150173028
      ],
      [
        "c(F)c",
        -5.669168863518674
      ],
      [
        "c3ccccc3",
        -5.673730185416938
      ],
      [
        "Cc1c",
        -5.680938074212985
      ],
      [
        "CC(C)",
        -5.686285744061838
      ],
      [
        "C(=O)O",
        -5.689093474662943
      ],
      [
        "CN",
        -5.691927273439147
      ],
      [
        "c1ccc",
        -5.692407073187697
      ],
      [
        "CCN",
        -5.717307958646877
      ],
      [
        "c4cc",
        -5.735255209713998
      ],
      [
        "N2CC",
        -5.736995212877051
      ],
      [
        "OC)",
        -5.783119388373189
      ],
      [
        "c3ccccc3)",
        -5.7999384265069125
      ],
      [
        "nc2",
        -5.864699265091989
      ],
      [
        "cc3",
        -5.864939328771877
      ],
      [
        "nc(",
        -5.871413175513309
      ],
      [
        "c2cc",
        -5.884251508414543
      ],
      [
        "c1ccccc1)",
        -5.9021712098179755
      ],
      [
        "c(C)c",
        -5.919273333008542
      ],
      [
        "c(OC)c",
        -5.9202998127158075
      ],
      [
        "CCCC",
        -5.921437498427194
      ],
      [
        "c2c(",
        -5.922007554232602
      ],
      [
        "C4",
        -5.923307110456673
      ],
      [
        "Cc1ccc(",
        -5.942003534030791
      ],
      [
        "C1CC",
        -5.950272556019904
      ],
      [
        "ccc2",
        -5.97743007167618
      ],
      [
        "CCN(C",
        -5.989295213348608
      ],
      [
        "c(O)c",
        -5.993987023700921
      ],
      [
        "C(N)",
        -5.9952965291778195
      ],
      [
        "cc(-",
        -6.018246323073905
      ],
      [
        "CC2",
        -6.022398533077736
      ],
      [
        "CC3)",
        -6.045481881363001
      ],
      [
        "4",
        -6.048872651049768
      ],
      [
        "c2cc(",
        -6.0692068761169935
      ],
      [
        "C(F)(F)F)",
        -6.080432188312082
      ],
      [
        "n(C",
        -6.092708383821481
      ],
      [
        "O=C(N",
        -6.098009975942762
      ],
      [
        "c3n",
        -6.121645550967999
      ],
      [
        "c4ccccc4",
        -6.145269524620506
      ],
      [
        "C(C)C)",
        -6.14849248633279
      ],
      [
        "[N+](=O)[O-])",
        -6.161581937519514
      ],
      [
        "C#N)",
        -6.19019507740818
      ],
      [
        "=C(",
        -6.2215927912982
      ],
      [
        "CS",
        -6.225851649373521
      ],
      [
        "nc(-",
        -6.285443754524984
      ],
      [
        "CN(C)",
        -6.319784985142297
      ],
      [
        "CCCCCC",
        -6.3559472015018645
      ],
      [
        "N1CCN(",
        -6.38496729871169
      ],
      [
        "F",
        -6.422622388596265
      ],
      [
        "C3CC",
        -6.451922867430351
      ],
      [
        "c(C(F)(F)F)c",
        -6.475524714269811
      ],
      [
        "CN1CC",
        -6.475637413612281
      ],
      [
        "c(-c3cc",
        -6.4804911326226815
      ],
      [
        "CN(C(=O)",
        -6.495620332474539
      ],
      [
        "Br)",
        -6.545501147116182
      ],
      [
        "O=C1",
        -6.579529366590435
      ],
      [
        "]",
        -6.581562880128002
      ],
      [
        "[",
        -6.581562880128002
      ],
      [
        "c1ccc2c(c1)",
        -6.61855998941693
      ],
      [
        "c1ccc(Cl)cc1",
        -6.639175001718321
      ],
      [
        "C1=O",
        -6.644361703758179
      ],
      [
        "N=C",
        -6.671347281034745
      ],
      [
        "c(Br)c",
        -6.6886527359052454
      ],
      [
        "c1ccc(-c2c",
        -6.7368984652259485
      ],
      [
        "n(-",
        -6.7456684153290105
      ],
      [
        "#",
        -6.777277708216307
      ],
      [
        "c(C)n",
        -6.790227348431468
      ],
      [
        "N2CCN(",
        -6.818730239989984
      ],
      [
        "+",
        -6.908160894499808
      ],
      [
        "c2ccccc12",
        -6.917584481977892
      ],
      [
        "6",
        -7.046304018223157
      ],
      [
        "P(=O)(",
        -7.052860000279498
      ],
      [
        "C(F)(F)",
        -7.1647822387941655
      ],
      [
        "[O-]",
        -7.17149015501653
      ],
      [
        "[N+]",
        -7.256318503537619
      ],
      [
        "S(C)(=O)=O)",
        -7.397998537966252
      ],
      [
        "c5ccccc5",
        -7.7095158552773615
      ],
      [
        "B",
        -7.768859619023617
      ],
      [
        "I",
        -7.8244394143913905
      ],
      [
        "O=S(=O)(",
        -7.860019261001282
      ],
      [
        "P",
        -8.63296256960548
      ],
      [
        "7",
        -8.812510537826995
      ],
      [
        "H",
        -9.515090926822182
      ],
      [
        "8",
        -10.424587300278702
      ],
      [
        "9",
        -11.36893031217648
      ],
      [
        "%",
        -12.889044460354205
      ],
      [
        "0",
        -13.261076222804007
      ],
      [
        "p",
        -13.480686602854636
      ],
      [
        "i",
        -17.407557641873733
      ],
      [
        "e",
        -17.407657641873733
      ],
      [
        "r",
        -17.407757641873733
      ],
      [
        "b",
        -17.407857641873733
      ],
      [
        "l",
        -17.407857641873733
      ]
    ],
    "byte_fallback": false
  }
}
