{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "^",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "_",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": " ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "§",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "°",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": null,
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "^",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "_",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "^": {
        "id": "^",
        "ids": [
          0
        ],
        "tokens": [
          "^"
        ]
      },
      "_": {
        "id": "_",
        "ids": [
          1
        ],
        "tokens": [
          "_"
        ]
      }
    }
  },
  "decoder": null,
  "model": {
    "type": "Unigram",
    "unk_id": 3,
    "vocab": [
      [
        "^",
        0.0
      ],
      [
        "_",
        0.0
      ],
      [
        " ",
        0.0
      ],
      [
        "§",
        0.0
      ],
      [
        "°",
        0.0
      ],
      [
        "C",
        -1.903809870225908
      ],
      [
        "cc",
        -2.657823712176969
      ],
      [
        ")",
        -2.685447542749083
      ],
      [
        "N",
        -2.8042227554081745
      ],
      [
        "1",
        -3.100845616683367
      ],
      [
        "CC",
        -3.1167453923065267
      ],
      [
        "O",
        -3.133505155252518
      ],
      [
        "c2",
        -3.144584703599902
      ],
      [
        "n",
        -3.148385428410295
      ],
      [
        "c",
        -3.161481106919389
      ],
      [
        "c1",
        -3.320103203852611
      ],
      [
        "c(",
        -3.4292172195660378
      ],
      [
        "=",
        -3.5630181635602405
      ],
      [
        "(",
        -3.700068616136011
      ],
      [
        "2",
        -3.7032130713016937
      ],
      [
        "(C)",
        -3.9476036398647345
      ],
      [
        "3",
        -4.032172093353413
      ],
      [
        "4",
        -4.345631942744959
      ],
      [
        "-",
        -4.4297686511311305
      ],
      [
        "F",
        -4.924058450005877
      ],
      [
        "S",
        -5.177180932377015
      ],
      [
        "s",
        -5.451653154692574
      ],
      [
        "o",
        -5.471282693116729
      ],
      [
        "5",
        -5.847958789474834
      ],
      [
        "#",
        -6.0581260153371215
      ],
      [
        "]",
        -6.240643872618298
      ],
      [
        "[",
        -6.240643872618298
      ],
      [
        "B",
        -6.353814856917229
      ],
      [
        "+",
        -6.7866529396267055
      ],
      [
        "P",
        -7.444402746164254
      ],
      [
        "6",
        -7.625141202765295
      ],
      [
        "I",
        -8.403276598933505
      ],
      [
        "7",
        -9.39134772236918
      ],
      [
        "H",
        -10.093927976908134
      ],
      [
        "8",
        -11.003424484820892
      ],
      [
        "9",
        -11.947767496718694
      ],
      [
        "%",
        -13.467881644896352
      ],
      [
        "0",
        -13.83991340734617
      ],
      [
        "p",
        -14.05952378739678
      ],
      [
        "i",
        -17.986394826376007
      ],
      [
        "l",
        -17.986494826376006
      ],
      [
        "e",
        -17.986594826376006
      ],
      [
        "b",
        -17.986694826376006
      ],
      [
        "r",
        -17.986694826376006
      ]
    ],
    "byte_fallback": false
  }
}
