{
  "version": "1.0",
  "truncation": null,
  "padding": {
    "strategy": "BatchLongest",
    "direction": "Right",
    "pad_to_multiple_of": null,
    "pad_id": 2,
    "pad_type_id": 0,
    "pad_token": " "
  },
  "added_tokens": [
    {
      "id": 0,
      "content": "^",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "_",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": " ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "§",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "°",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": null,
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "^",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "_",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "^": {
        "id": "^",
        "ids": [
          0
        ],
        "tokens": [
          "^"
        ]
      },
      "_": {
        "id": "_",
        "ids": [
          1
        ],
        "tokens": [
          "_"
        ]
      }
    }
  },
  "decoder": null,
  "model": {
    "type": "Unigram",
    "unk_id": 3,
    "vocab": [
      [
        "^",
        0.0
      ],
      [
        "_",
        0.0
      ],
      [
        " ",
        0.0
      ],
      [
        "§",
        0.0
      ],
      [
        "°",
        0.0
      ],
      [
        ":",
        -2.7344835320808354
      ],
      [
        "(",
        -2.8951069798552176
      ],
      [
        ")",
        -2.8951069798552194
      ],
      [
        "1",
        -3.0045085206433875
      ],
      [
        ":[c:",
        -3.053662616694343
      ],
      [
        "]",
        -3.246166039593941
      ],
      [
        "-[",
        -3.274607903915122
      ],
      [
        "3]",
        -3.2797196204783745
      ],
      [
        "4]",
        -3.296002818268647
      ],
      [
        "5]",
        -3.3422779793995776
      ],
      [
        "1]",
        -3.3684004264785905
      ],
      [
        "2]",
        -3.376491673767383
      ],
      [
        "C",
        -3.386557016231878
      ],
      [
        "-[C:",
        -3.4379827638101013
      ],
      [
        "[",
        -3.4451106539522076
      ],
      [
        "0",
        -3.446751889725979
      ],
      [
        "6]",
        -3.472061151947736
      ],
      [
        "7]",
        -3.691266852331509
      ],
      [
        "-",
        -3.698276980840916
      ],
      [
        ":[#7;a:",
        -3.768679874901
      ],
      [
        "O",
        -3.9878429314498
      ],
      [
        ".",
        -4.135422471738723
      ],
      [
        "=[O;D1;H0:",
        -4.143423851101726
      ],
      [
        "[C:",
        -4.231974606171555
      ],
      [
        "-[c:",
        -4.284823055612861
      ],
      [
        "=",
        -4.314250690666649
      ],
      [
        "-[c;H0;D3;+0:",
        -4.517599651680092
      ],
      [
        "2",
        -4.636811642609251
      ],
      [
        "[#7;a:",
        -4.657482743275359
      ],
      [
        "-[CH2;D2;+0:",
        -4.670408671216013
      ],
      [
        "c",
        -4.676840037115953
      ],
      [
        "-[C;H0;D3;+0:",
        -4.697254962514565
      ],
      [
        "C;D1;H3:",
        -4.716058680452848
      ],
      [
        "N",
        -4.732554996968693
      ],
      [
        "-[NH;D2;+0:",
        -4.868868832281008
      ],
      [
        ";H0;D3;+0:",
        -4.912464790520309
      ],
      [
        "3",
        -5.021491463027727
      ],
      [
        ";H0;D2;+0:",
        -5.0697786866834305
      ],
      [
        "B",
        -5.116325549904188
      ],
      [
        ":[c;H0;D3;+0:",
        -5.250587513259146
      ],
      [
        "n",
        -5.393107082113132
      ],
      [
        "1](=[O;D1;H0:2])",
        -5.425314249608953
      ],
      [
        "[#16;a:",
        -5.562477291093005
      ],
      [
        "-[NH2;D1;+0:",
        -5.593085550856357
      ],
      [
        "S",
        -5.606495713048129
      ],
      [
        "OH;D1;+0:",
        -5.813615954437792
      ],
      [
        "=[CH;D2;+0:",
        -6.089635685900279
      ],
      [
        "/",
        -6.104334111899319
      ],
      [
        "4",
        -6.148658793803749
      ],
      [
        "I",
        -6.59215812182131
      ],
      [
        "\\",
        -7.660232763386453
      ],
      [
        "#",
        -8.50532597104072
      ],
      [
        "r",
        -8.50542597104072
      ],
      [
        "Z",
        -8.50552597104072
      ],
      [
        ">",
        -8.505625971040722
      ],
      [
        "g",
        -8.505725971040722
      ],
      [
        "M",
        -8.505825971040721
      ],
      [
        "P",
        -8.505925971040721
      ],
      [
        "F",
        -8.506025971040721
      ],
      [
        "l",
        -8.50612597104072
      ],
      [
        "D",
        -8.50622597104072
      ],
      [
        "o",
        -8.50632597104072
      ],
      [
        "u",
        -8.506425971040722
      ],
      [
        "6",
        -8.506525971040722
      ],
      [
        "9",
        -8.506625971040721
      ],
      [
        "8",
        -8.506725971040721
      ],
      [
        "i",
        -8.50682597104072
      ],
      [
        "@",
        -8.50692597104072
      ],
      [
        "+",
        -8.50702597104072
      ],
      [
        "a",
        -8.50712597104072
      ],
      [
        "H",
        -8.507225971040722
      ],
      [
        ";",
        -8.507325971040721
      ],
      [
        "5",
        -8.507425971040721
      ],
      [
        "7",
        -8.507525971040721
      ],
      [
        "s",
        -8.507525971040721
      ]
    ],
    "byte_fallback": false
  }
}
