{
  "version": "1.0",
  "truncation": null,
  "padding": {
    "strategy": "BatchLongest",
    "direction": "Right",
    "pad_to_multiple_of": null,
    "pad_id": 2,
    "pad_type_id": 0,
    "pad_token": " "
  },
  "added_tokens": [
    {
      "id": 0,
      "content": "^",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "_",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": " ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "§",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "°",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": null,
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "^",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "_",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "^": {
        "id": "^",
        "ids": [
          0
        ],
        "tokens": [
          "^"
        ]
      },
      "_": {
        "id": "_",
        "ids": [
          1
        ],
        "tokens": [
          "_"
        ]
      }
    }
  },
  "decoder": null,
  "model": {
    "type": "Unigram",
    "unk_id": 3,
    "vocab": [
      [
        "^",
        0.0
      ],
      [
        "_",
        0.0
      ],
      [
        " ",
        0.0
      ],
      [
        "§",
        0.0
      ],
      [
        "°",
        0.0
      ],
      [
        ")",
        -2.85973375572925
      ],
      [
        "(",
        -2.9877801896888236
      ],
      [
        "4]",
        -3.0318673768058435
      ],
      [
        "5]",
        -3.080141239525865
      ],
      [
        ":[c:",
        -3.2212829652844253
      ],
      [
        "-[C:",
        -3.240706453522913
      ],
      [
        "2]",
        -3.2941422760643952
      ],
      [
        "3]",
        -3.360529405567858
      ],
      [
        "6]",
        -3.3679816185053113
      ],
      [
        "7]",
        -3.4291301086090904
      ],
      [
        ":[#7;a:",
        -3.540232517491761
      ],
      [
        "1",
        -3.5656118350089603
      ],
      [
        "-[",
        -3.59441278173281
      ],
      [
        "1]",
        -3.62146114468594
      ],
      [
        "-",
        -3.7162426423605446
      ],
      [
        "8]",
        -3.7586000705363265
      ],
      [
        ":",
        -3.7991555407740942
      ],
      [
        "C",
        -3.923088478254897
      ],
      [
        "=[O;D1;H0:",
        -4.013582214336818
      ],
      [
        "-[c:",
        -4.021289770907602
      ],
      [
        "[",
        -4.116820898868625
      ],
      [
        "9]",
        -4.245532440179208
      ],
      [
        ".",
        -4.339465010561987
      ],
      [
        "[#7;a:",
        -4.438634672971915
      ],
      [
        "C;D1;H3:",
        -4.453921949794111
      ],
      [
        "-[C;H0;D3;+0:",
        -4.576830861014214
      ],
      [
        "-[NH;D2;+0:",
        -4.6067321016223435
      ],
      [
        "-[c;H0;D3;+0:",
        -4.673217301098285
      ],
      [
        "10]",
        -4.823230929228905
      ],
      [
        "[C:",
        -4.824140531752361
      ],
      [
        "[#7:",
        -4.887825623557928
      ],
      [
        "=",
        -4.908504890921882
      ],
      [
        "c",
        -4.923062028374
      ],
      [
        ";H0;D3;+0:",
        -4.943988295727693
      ],
      [
        "O",
        -4.945953137414059
      ],
      [
        "0",
        -4.9915119974127835
      ],
      [
        "1](=[O;D1;H0:2])",
        -5.163212750333743
      ],
      [
        "[#8:",
        -5.225590650715184
      ],
      [
        ">>Cl-[",
        -5.235436835688226
      ],
      [
        ";H0;D2;+0:",
        -5.254447768870865
      ],
      [
        "[#16;a:",
        -5.300340560434381
      ],
      [
        ">>Br-[",
        -5.306511514717958
      ],
      [
        "-[NH2;D1;+0:",
        -5.3309488201977135
      ],
      [
        "S",
        -5.344358982389425
      ],
      [
        ";H0;D",
        -5.4323351414762096
      ],
      [
        "n",
        -5.531901465568362
      ],
      [
        "OH;D1;+0:",
        -5.551479223779093
      ],
      [
        "-[CH2;D2;+0:",
        -5.63815441967257
      ],
      [
        "N",
        -5.645761040860217
      ],
      [
        "1](:[c:2]):[c:3]",
        -5.730262874786732
      ],
      [
        "CH2;D2;+0:1]",
        -5.777758058171692
      ],
      [
        "=[CH;D2;+0:",
        -5.82749895524161
      ],
      [
        "/",
        -5.842197381240658
      ],
      [
        "4",
        -5.921817497971126
      ],
      [
        "2",
        -5.962806590278622
      ],
      [
        ":[nH;D2;+0:",
        -6.239499122147248
      ],
      [
        "]",
        -6.286279266870702
      ],
      [
        "I",
        -6.330021391162613
      ],
      [
        "-[CH;D2;+0:",
        -6.347398018625759
      ],
      [
        ":[cH;D2;+0:",
        -6.4333741335981
      ],
      [
        ".[NH2;D1;+0:",
        -6.51493021619309
      ],
      [
        "B",
        -6.866437007447599
      ],
      [
        "\\",
        -7.39809603272782
      ],
      [
        "3",
        -7.595202193217557
      ],
      [
        "Z",
        -8.243189240382044
      ],
      [
        "#",
        -8.243289240382044
      ],
      [
        "o",
        -8.243389240382044
      ],
      [
        "D",
        -8.243489240382045
      ],
      [
        "H",
        -8.243589240382045
      ],
      [
        "@",
        -8.243689240382045
      ],
      [
        "g",
        -8.243789240382045
      ],
      [
        "r",
        -8.243889240382044
      ],
      [
        "8",
        -8.243989240382044
      ],
      [
        ">",
        -8.244089240382044
      ],
      [
        "9",
        -8.244189240382044
      ],
      [
        "7",
        -8.244289240382045
      ],
      [
        ";",
        -8.244389240382045
      ],
      [
        "i",
        -8.244489240382045
      ],
      [
        "6",
        -8.244589240382044
      ],
      [
        "u",
        -8.244689240382044
      ],
      [
        "M",
        -8.244789240382044
      ],
      [
        "a",
        -8.244889240382044
      ],
      [
        "P",
        -8.244989240382044
      ],
      [
        "5",
        -8.245089240382045
      ],
      [
        "l",
        -8.245189240382045
      ],
      [
        "F",
        -8.245289240382045
      ],
      [
        "+",
        -8.245389240382044
      ],
      [
        "s",
        -8.245389240382044
      ]
    ],
    "byte_fallback": false
  }
}
