{
  "version": "1.0",
  "truncation": null,
  "padding": {
    "strategy": "BatchLongest",
    "direction": "Right",
    "pad_to_multiple_of": null,
    "pad_id": 2,
    "pad_type_id": 0,
    "pad_token": " "
  },
  "added_tokens": [
    {
      "id": 0,
      "content": "^",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "_",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": " ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "§",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "°",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": null,
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "^",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "_",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "^": {
        "id": "^",
        "ids": [
          0
        ],
        "tokens": [
          "^"
        ]
      },
      "_": {
        "id": "_",
        "ids": [
          1
        ],
        "tokens": [
          "_"
        ]
      }
    }
  },
  "decoder": null,
  "model": {
    "type": "Unigram",
    "unk_id": 3,
    "vocab": [
      [
        "^",
        0.0
      ],
      [
        "_",
        0.0
      ],
      [
        " ",
        0.0
      ],
      [
        "§",
        0.0
      ],
      [
        "°",
        0.0
      ],
      [
        "C",
        -1.350089539558219
      ],
      [
        ")",
        -2.5775625250698155
      ],
      [
        "n",
        -2.98156890669867
      ],
      [
        "1",
        -2.985445827516492
      ],
      [
        "c",
        -3.115399049402024
      ],
      [
        "(",
        -3.2236627398028226
      ],
      [
        "N",
        -3.2653354093129225
      ],
      [
        "O",
        -3.3422002324669258
      ],
      [
        "c1",
        -3.4299243121009955
      ],
      [
        "3",
        -3.859648411622696
      ],
      [
        "(C)",
        -3.8603807222105737
      ],
      [
        "=",
        -3.873497546751854
      ],
      [
        "c(",
        -3.8853747143566952
      ],
      [
        "2",
        -3.9095823825378586
      ],
      [
        "c2",
        -3.953794118185504
      ],
      [
        "C(=O)N",
        -4.201151684108403
      ],
      [
        "C(=O)",
        -4.4213836113617235
      ],
      [
        "[C@H](",
        -4.655107308066752
      ],
      [
        "[C@@H](",
        -4.693116562507936
      ],
      [
        "S",
        -4.752984687557242
      ],
      [
        "-",
        -4.800361859105844
      ],
      [
        "F",
        -4.806221116815133
      ],
      [
        "s",
        -4.9576617001645795
      ],
      [
        "/",
        -5.136832933300225
      ],
      [
        "[NH+]",
        -5.167486524339047
      ],
      [
        "o",
        -5.240098662908157
      ],
      [
        "[C@H]1",
        -5.256976600523886
      ],
      [
        "4",
        -5.345923498961009
      ],
      [
        "[C@@H]1",
        -5.413256099288604
      ],
      [
        "S(=O)(=O)",
        -5.647654337994178
      ],
      [
        "5",
        -7.282404623699229
      ],
      [
        "+",
        -9.59963361698095
      ],
      [
        "@",
        -9.59973361698095
      ],
      [
        "7",
        -9.59983361698095
      ],
      [
        "[",
        -9.59993361698095
      ],
      [
        "#",
        -9.60003361698095
      ],
      [
        "H",
        -9.60013361698095
      ],
      [
        "]",
        -9.60023361698095
      ],
      [
        "r",
        -9.60033361698095
      ],
      [
        "l",
        -9.60043361698095
      ],
      [
        "\\",
        -9.60053361698095
      ],
      [
        "I",
        -9.600633616941035
      ],
      [
        "B",
        -9.60063361698095
      ],
      [
        "6",
        -9.60063361698095
      ]
    ],
    "byte_fallback": false
  }
}
