{
  "version": "1.0",
  "truncation": null,
  "padding": {
    "strategy": "BatchLongest",
    "direction": "Right",
    "pad_to_multiple_of": null,
    "pad_id": 2,
    "pad_type_id": 0,
    "pad_token": " "
  },
  "added_tokens": [
    {
      "id": 0,
      "content": "^",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "_",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": " ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "§",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "°",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": null,
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "^",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "_",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "^": {
        "id": "^",
        "ids": [
          0
        ],
        "tokens": [
          "^"
        ]
      },
      "_": {
        "id": "_",
        "ids": [
          1
        ],
        "tokens": [
          "_"
        ]
      }
    }
  },
  "decoder": null,
  "model": {
    "type": "Unigram",
    "unk_id": 3,
    "vocab": [
      [
        "^",
        0.0
      ],
      [
        "_",
        0.0
      ],
      [
        " ",
        0.0
      ],
      [
        "§",
        0.0
      ],
      [
        "°",
        0.0
      ],
      [
        "C",
        -1.350089539558219
      ],
      [
        ")",
        -2.5775625250698173
      ],
      [
        "n",
        -2.981568906698671
      ],
      [
        "1",
        -2.985445827516494
      ],
      [
        "c",
        -3.115399049402021
      ],
      [
        "(",
        -3.22366273980282
      ],
      [
        "N",
        -3.2653354093129208
      ],
      [
        "O",
        -3.3422002324669267
      ],
      [
        "c1",
        -3.429924312100998
      ],
      [
        "3",
        -3.859648411622693
      ],
      [
        "(C)",
        -3.860380722210575
      ],
      [
        "=",
        -3.8734975467518513
      ],
      [
        "c(",
        -3.885374714356693
      ],
      [
        "2",
        -3.9095823825378586
      ],
      [
        "c2",
        -3.9537941181855025
      ],
      [
        "C(=O)N",
        -4.201151684108403
      ],
      [
        "C(=O)",
        -4.4213836113617235
      ],
      [
        "[C@H](",
        -4.655107308066751
      ],
      [
        "[C@@H](",
        -4.693116562507939
      ],
      [
        "S",
        -4.75298468755724
      ],
      [
        "-",
        -4.800361859105838
      ],
      [
        "F",
        -4.80622111681513
      ],
      [
        "s",
        -4.957661700164578
      ],
      [
        "/",
        -5.136832933300223
      ],
      [
        "[NH+]",
        -5.167486524339047
      ],
      [
        "o",
        -5.240098662908158
      ],
      [
        "[C@H]1",
        -5.256976600523888
      ],
      [
        "4",
        -5.345923498961003
      ],
      [
        "[C@@H]1",
        -5.413256099288601
      ],
      [
        "S(=O)(=O)",
        -5.6476543379941795
      ],
      [
        "5",
        -7.282404623699229
      ],
      [
        "B",
        -9.59963361698099
      ],
      [
        "l",
        -9.59973361698099
      ],
      [
        "[",
        -9.59983361698099
      ],
      [
        "r",
        -9.599933616980987
      ],
      [
        "#",
        -9.600033616980989
      ],
      [
        "+",
        -9.600133616980989
      ],
      [
        "]",
        -9.600233616980988
      ],
      [
        "@",
        -9.60033361698099
      ],
      [
        "\\",
        -9.60043361698099
      ],
      [
        "7",
        -9.60053361698099
      ],
      [
        "I",
        -9.600633616980986
      ],
      [
        "H",
        -9.60063361698099
      ],
      [
        "6",
        -9.60063361698099
      ]
    ],
    "byte_fallback": false
  }
}
