{
  "version": "1.0",
  "truncation": null,
  "padding": {
    "strategy": "BatchLongest",
    "direction": "Right",
    "pad_to_multiple_of": null,
    "pad_id": 2,
    "pad_type_id": 0,
    "pad_token": " "
  },
  "added_tokens": [
    {
      "id": 0,
      "content": "^",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "_",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": " ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "§",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "°",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": null,
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "^",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "_",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "^": {
        "id": "^",
        "ids": [
          0
        ],
        "tokens": [
          "^"
        ]
      },
      "_": {
        "id": "_",
        "ids": [
          1
        ],
        "tokens": [
          "_"
        ]
      }
    }
  },
  "decoder": {
    "type": "WordPiece",
    "prefix": "##",
    "cleanup": false
  },
  "model": {
    "type": "WordPiece",
    "unk_token": "§",
    "continuing_subword_prefix": "##",
    "max_input_chars_per_word": 1024,
    "vocab": {
      "^": 0,
      "_": 1,
      " ": 2,
      "§": 3,
      "°": 4,
      "#": 5,
      "(": 6,
      ")": 7,
      "+": 8,
      "-": 9,
      ".": 10,
      "/": 11,
      "0": 12,
      "1": 13,
      "2": 14,
      "3": 15,
      "4": 16,
      "5": 17,
      "6": 18,
      "7": 19,
      "8": 20,
      "9": 21,
      ":": 22,
      ";": 23,
      "=": 24,
      ">": 25,
      "@": 26,
      "B": 27,
      "C": 28,
      "D": 29,
      "F": 30,
      "H": 31,
      "I": 32,
      "M": 33,
      "N": 34,
      "O": 35,
      "P": 36,
      "S": 37,
      "Z": 38,
      "[": 39,
      "\\": 40,
      "]": 41,
      "a": 42,
      "c": 43,
      "g": 44,
      "i": 45,
      "l": 46,
      "n": 47,
      "o": 48,
      "r": 49,
      "s": 50,
      "u": 51,
      "###": 52,
      "##7": 53,
      "##;": 54,
      "##a": 55,
      "##:": 56,
      "##2": 57,
      "##]": 58,
      "##[": 59,
      "##c": 60,
      "##H": 61,
      "##0": 62,
      "##D": 63,
      "##3": 64,
      "##+": 65,
      "##1": 66,
      "##(": 67,
      "##-": 68,
      "##C": 69,
      "##=": 70,
      "##8": 71,
      "##)": 72,
      "##4": 73,
      "##5": 74,
      "##O": 75,
      "##6": 76,
      "##>": 77,
      "##B": 78,
      "##r": 79,
      "##.": 80,
      "##S": 81,
      "##n": 82,
      "##N": 83,
      "##l": 84,
      "##9": 85,
      "##I": 86,
      "##/": 87,
      "##@": 88,
      "##M": 89,
      "##g": 90,
      "##F": 91,
      "##\\": 92,
      "##i": 93,
      "##P": 94,
      "##s": 95,
      "##Z": 96,
      "##o": 97,
      "##u": 98,
      "##-[": 99,
      "##;D": 100,
      "##0:": 101,
      "##:[": 102,
      "##;+": 103,
      "##;+0:": 104,
      "##;H": 105,
      "##c:": 106,
      "##-[C": 107,
      "##])": 108,
      "##]:[": 109,
      "##](": 110,
      "##;D1": 111,
      "##;H0": 112,
      "##;H0;D": 113,
      "##;a": 114,
      "##;a:": 115,
      "###7": 116,
      "##3;+0:": 117,
      "##;D1;H": 118,
      "##=[": 119,
      "##;H0;D3;+0:": 120,
      "##-[C:": 121,
      "###7;a:": 122,
      "##2;+0:": 123,
      "##]:[c:": 124,
      "##]-[": 125,
      "##;D1;H0:": 126,
      "##;D2;+0:": 127,
      "##:[c:": 128,
      "##O;D1;H0:": 129,
      "##=[O;D1;H0:": 130,
      "##1](": 131,
      "##>>": 132,
      "##]-[C:": 133,
      "##c;H0;D3;+0:": 134,
      "##2])": 135,
      "##]>>": 136,
      "##-[CH": 137,
      "##].": 138,
      "##]:[#7;a:": 139,
      "##C:": 140,
      "##H;D2;+0:": 141,
      "##].[": 142,
      "##;D1;+0:": 143,
      "##-C": 144,
      "##])-[": 145,
      "##]-[N": 146,
      "##:1": 147,
      "##2;D2;+0:": 148,
      "##-[CH2;D2;+0:": 149,
      "##:[#7;a:": 150,
      "##-[C;H0;D3;+0:": 151,
      "##;D1;H3": 152,
      "###8": 153,
      "##]=[": 154,
      "##;D1;H3:": 155,
      "##-[c;H0;D3;+0:": 156,
      "##]1": 157,
      "##]-[c:": 158,
      "##-[CH2;D2;+0:1": 159,
      "##-[C;H0;D3;+0:1](": 160,
      "##;H0;D2;+0:": 161,
      "##-[C;D1;H3:": 162,
      "##6]": 163,
      "[#7;a:": 164,
      "##7]": 165,
      "##](=[O;D1;H0:": 166,
      "##](-[": 167,
      "##4]:[c:": 168,
      "##]>>C": 169,
      "###8:": 170,
      "##10": 171,
      "##H2": 172,
      "##H2;D1;+0:": 173,
      "##]):[c:": 174,
      "##5]": 175,
      "##;D3;+0:": 176,
      "###7:": 177,
      "##:[c:3": 178,
      "###1": 179,
      "##2]": 180
    }
  }
}
