{
  "version": "1.0",
  "truncation": null,
  "padding": {
    "strategy": "BatchLongest",
    "direction": "Right",
    "pad_to_multiple_of": null,
    "pad_id": 2,
    "pad_type_id": 0,
    "pad_token": " "
  },
  "added_tokens": [
    {
      "id": 0,
      "content": "^",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "_",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": " ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "§",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "°",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": null,
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "^",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "_",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "^": {
        "id": "^",
        "ids": [
          0
        ],
        "tokens": [
          "^"
        ]
      },
      "_": {
        "id": "_",
        "ids": [
          1
        ],
        "tokens": [
          "_"
        ]
      }
    }
  },
  "decoder": {
    "type": "WordPiece",
    "prefix": "##",
    "cleanup": false
  },
  "model": {
    "type": "WordPiece",
    "unk_token": "§",
    "continuing_subword_prefix": "##",
    "max_input_chars_per_word": 1024,
    "vocab": {
      "^": 0,
      "_": 1,
      " ": 2,
      "§": 3,
      "°": 4,
      "#": 5,
      "(": 6,
      ")": 7,
      "+": 8,
      "-": 9,
      "/": 10,
      "1": 11,
      "2": 12,
      "3": 13,
      "4": 14,
      "5": 15,
      "6": 16,
      "7": 17,
      "=": 18,
      "@": 19,
      "B": 20,
      "C": 21,
      "F": 22,
      "H": 23,
      "I": 24,
      "N": 25,
      "O": 26,
      "S": 27,
      "[": 28,
      "\\": 29,
      "]": 30,
      "c": 31,
      "l": 32,
      "n": 33,
      "o": 34,
      "r": 35,
      "s": 36,
      "##n": 37,
      "##1": 38,
      "##c": 39,
      "##[": 40,
      "##H": 41,
      "##+": 42,
      "##]": 43,
      "##C": 44,
      "##@": 45,
      "##N": 46,
      "##(": 47,
      "##2": 48,
      "##-": 49,
      "##3": 50,
      "##l": 51,
      "##)": 52,
      "##o": 53,
      "##=": 54,
      "##O": 55,
      "##s": 56,
      "##S": 57,
      "##/": 58,
      "##F": 59,
      "##\\": 60,
      "###": 61,
      "##B": 62,
      "##r": 63,
      "##4": 64,
      "##5": 65,
      "##6": 66,
      "##7": 67,
      "##I": 68,
      "##cc": 69,
      "##CC": 70,
      "##c1": 71,
      "##(C": 72,
      "##O)": 73,
      "##=O)": 74,
      "##(=O)": 75,
      "##c2": 76,
      "##H]": 77,
      "##[C": 78,
      "##[C@": 79,
      "##c1cc": 80,
      "##(C)": 81,
      "##c(": 82,
      "##C(=O)": 83,
      "##[C@H]": 84,
      "##[C@@": 85,
      "##c2cc": 86,
      "##[C@@H]": 87,
      "##)cc": 88,
      "##c3": 89,
      "##CCC": 90,
      "##NC(=O)": 91,
      "##+]": 92
    }
  }
}
