{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "^",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "_",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": " ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "§",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "°",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": null,
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "^",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "_",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "^": {
        "id": "^",
        "ids": [
          0
        ],
        "tokens": [
          "^"
        ]
      },
      "_": {
        "id": "_",
        "ids": [
          1
        ],
        "tokens": [
          "_"
        ]
      }
    }
  },
  "decoder": {
    "type": "WordPiece",
    "prefix": "##",
    "cleanup": false
  },
  "model": {
    "type": "WordPiece",
    "unk_token": "§",
    "continuing_subword_prefix": "##",
    "max_input_chars_per_word": 100,
    "vocab": {
      "^": 0,
      "_": 1,
      " ": 2,
      "§": 3,
      "°": 4,
      "#": 5,
      "%": 6,
      "(": 7,
      ")": 8,
      "+": 9,
      "-": 10,
      "0": 11,
      "1": 12,
      "2": 13,
      "3": 14,
      "4": 15,
      "5": 16,
      "6": 17,
      "7": 18,
      "8": 19,
      "9": 20,
      "=": 21,
      "B": 22,
      "C": 23,
      "F": 24,
      "H": 25,
      "I": 26,
      "N": 27,
      "O": 28,
      "P": 29,
      "S": 30,
      "[": 31,
      "]": 32,
      "b": 33,
      "c": 34,
      "e": 35,
      "i": 36,
      "l": 37,
      "n": 38,
      "o": 39,
      "p": 40,
      "r": 41,
      "s": 42,
      "##O": 43,
      "##c": 44,
      "##1": 45,
      "##(": 46,
      "##-": 47,
      "##2": 48,
      "##n": 49,
      "##C": 50,
      "##S": 51,
      "##=": 52,
      "##)": 53,
      "##N": 54,
      "##3": 55,
      "##4": 56,
      "##F": 57,
      "##o": 58,
      "##l": 59,
      "###": 60,
      "##[": 61,
      "##H": 62,
      "##]": 63,
      "##s": 64,
      "##+": 65,
      "##P": 66,
      "##B": 67,
      "##r": 68,
      "##I": 69,
      "##5": 70,
      "##6": 71,
      "##i": 72,
      "##e": 73,
      "##7": 74,
      "##8": 75,
      "##9": 76,
      "##%": 77,
      "##0": 78,
      "##p": 79,
      "##b": 80
    }
  }
}
