{
  "version": "1.0",
  "truncation": null,
  "padding": {
    "strategy": "BatchLongest",
    "direction": "Right",
    "pad_to_multiple_of": null,
    "pad_id": 2,
    "pad_type_id": 0,
    "pad_token": " "
  },
  "added_tokens": [
    {
      "id": 0,
      "content": "^",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "_",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": " ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "§",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "°",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": null,
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "^",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "_",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "^": {
        "id": "^",
        "ids": [
          0
        ],
        "tokens": [
          "^"
        ]
      },
      "_": {
        "id": "_",
        "ids": [
          1
        ],
        "tokens": [
          "_"
        ]
      }
    }
  },
  "decoder": null,
  "model": {
    "type": "Unigram",
    "unk_id": 3,
    "vocab": [
      [
        "^",
        0.0
      ],
      [
        "_",
        0.0
      ],
      [
        " ",
        0.0
      ],
      [
        "§",
        0.0
      ],
      [
        "°",
        0.0
      ],
      [
        ")",
        -2.8601217070365195
      ],
      [
        "(",
        -3.140605667801347
      ],
      [
        "5]",
        -3.1782025170376578
      ],
      [
        "4]",
        -3.365909611653075
      ],
      [
        "6]",
        -3.484278174258673
      ],
      [
        "7]",
        -3.539270281563841
      ],
      [
        "3]",
        -3.6172126346023057
      ],
      [
        "2]",
        -3.7058918271089656
      ],
      [
        "1]",
        -3.7855199697138016
      ],
      [
        "8]",
        -3.8412701746698374
      ],
      [
        "1",
        -3.873559884761363
      ],
      [
        ":[#7;a:",
        -3.900077131064535
      ],
      [
        ":[c:",
        -3.9862299128827594
      ],
      [
        "=[O;D1;H0:",
        -4.114093169933133
      ],
      [
        "9]",
        -4.231124809319757
      ],
      [
        "-[NH;D2;+0:",
        -4.301450011996774
      ],
      [
        "-[",
        -4.3348754814576385
      ],
      [
        "-[c:",
        -4.341743584447478
      ],
      [
        "-[C:",
        -4.34537968419713
      ],
      [
        "-[C;H0;D3;+0:",
        -4.402633717600597
      ],
      [
        "-[c;H0;D3;+0:",
        -4.452701082337118
      ],
      [
        "10]",
        -4.517910533454386
      ],
      [
        ":1",
        -4.52332508709664
      ],
      [
        "[#7;a:",
        -4.595713156860389
      ],
      [
        ":",
        -4.66729028712913
      ],
      [
        "[",
        -4.713421781455602
      ],
      [
        "-",
        -4.770584425219703
      ],
      [
        ".",
        -4.806983886561109
      ],
      [
        "[C:",
        -4.854102758757671
      ],
      [
        "1](=[O;D1;H0:2])",
        -4.857890865743462
      ],
      [
        ":[c:6]",
        -4.885080688897209
      ],
      [
        ":[c:3]",
        -4.914436463510357
      ],
      [
        "-[CH2;D2;+0:1]",
        -4.932004957364493
      ],
      [
        ">>",
        -4.9351069951763415
      ],
      [
        "=[C:",
        -4.937846194013145
      ],
      [
        "-[C:3]",
        -4.977662773849168
      ],
      [
        ".[C:",
        -5.001308910607978
      ],
      [
        "-[NH2;D1;+0:",
        -5.025666730572137
      ],
      [
        ":[c;H0;D3;+0:",
        -5.036501346221029
      ],
      [
        "-[C:2]",
        -5.048206277451069
      ],
      [
        "-[N;H0;D3;+0:",
        -5.054641696181007
      ],
      [
        ">>Cl-[",
        -5.11631353399942
      ],
      [
        "[#7:",
        -5.141325475555945
      ],
      [
        "-[C:7]",
        -5.152495925661591
      ],
      [
        ">>O",
        -5.161245425553629
      ],
      [
        "-[c:3]",
        -5.193081131505675
      ],
      [
        "(-[C;D1;H3:",
        -5.217332425479559
      ],
      [
        "11]",
        -5.21852532806421
      ],
      [
        "-[CH;D3;+0:",
        -5.222671872331446
      ],
      [
        "OH;D1;+0:",
        -5.246197134153529
      ],
      [
        "=",
        -5.277876166303866
      ],
      [
        "[#8:",
        -5.3040159512947325
      ],
      [
        "-[CH2;D2;+0:",
        -5.336721071648527
      ],
      [
        "C",
        -5.339321611968445
      ],
      [
        ">>Br-[",
        -5.344809633502644
      ],
      [
        "-C",
        -5.346509711629579
      ],
      [
        "-[C;D1;H3:",
        -5.370710166496074
      ],
      [
        "O",
        -5.372412335148858
      ],
      [
        "c;H0;D3;+0:",
        -5.39293364666007
      ],
      [
        ":[c:2]",
        -5.4158275890897505
      ],
      [
        "1](:[c:2]):[c:3]",
        -5.428131226214702
      ],
      [
        ":[#7;a:4]",
        -5.430942080866116
      ],
      [
        "-[#7:",
        -5.431429988326403
      ],
      [
        "(-[#8:",
        -5.4932956445310435
      ],
      [
        "1](-[C:2])",
        -5.50647882639188
      ],
      [
        "-[O;H0;D2;+0:",
        -5.525381008631341
      ],
      [
        "N",
        -5.609248671248777
      ],
      [
        ":[c:9]",
        -5.621311061354426
      ],
      [
        "[#16;a:",
        -5.625015557968806
      ],
      [
        "(=[O;D1;H0:3])",
        -5.671650173976438
      ],
      [
        ".[",
        -5.676995756828978
      ],
      [
        "0",
        -5.748031326119908
      ],
      [
        ":[#16;a:",
        -5.75631792479929
      ],
      [
        "=[C;H0;D3;+0:",
        -5.767926800387143
      ],
      [
        ":[#8;a:",
        -5.779211136794078
      ],
      [
        "=[O;D1;H0:3]",
        -5.817350284526307
      ],
      [
        ":[c:4]:[#7;a:5]",
        -5.852321546328033
      ],
      [
        "6]:[c:7]",
        -5.868457855600631
      ],
      [
        "2",
        -5.898250863729372
      ],
      [
        ":[nH;D2;+0:",
        -5.934217032521675
      ],
      [
        "=[CH;D2;+0:",
        -5.959584057604338
      ],
      [
        "C;H0;D3;+0:",
        -5.9747465542086875
      ],
      [
        ":[#7;a:4]:[c:5]",
        -6.021621680061297
      ],
      [
        "1](-[C;D1;H3:2])",
        -6.024857183820878
      ],
      [
        "-[CH;D2;+0:",
        -6.042115929000188
      ],
      [
        ":[cH;D2;+0:",
        -6.1280920439725195
      ],
      [
        ";H0;D2;+0:",
        -6.160092632721411
      ],
      [
        "(=[O;D1;H0:6])",
        -6.169617922434285
      ],
      [
        "-[O;D1;H1:",
        -6.177025469249182
      ],
      [
        "S",
        -6.188543505845839
      ],
      [
        ";H0;D3;+0:",
        -6.204437774670528
      ],
      [
        "=[O;H0;D1;+0:",
        -6.209648126567513
      ],
      [
        ".[NH2;D1;+0:",
        -6.209648126567515
      ],
      [
        "(=[O;D1;H0:5])",
        -6.214626899340594
      ],
      [
        "c;H0;D3;+0:1](:[",
        -6.233032237713027
      ],
      [
        ">>Br-[CH",
        -6.237505174045397
      ],
      [
        "]",
        -6.249354262806882
      ],
      [
        ";H0;D",
        -6.2628521425363965
      ],
      [
        "7]-[C:8]",
        -6.2763805737911875
      ],
      [
        "2;D2;+0:1]-[C:2]",
        -6.291020986922743
      ],
      [
        "[#16:",
        -6.321361492015832
      ],
      [
        ":[c:5]:[#7;a:6]",
        -6.336465054249028
      ],
      [
        "[C;D1;H2:",
        -6.36397146816863
      ],
      [
        "CH3;D1;+0:",
        -6.363971468168632
      ],
      [
        "[O;D1;H0:",
        -6.382900439181896
      ],
      [
        ">>I-[",
        -6.387112717968656
      ],
      [
        "#7;a:2]):[c:3]",
        -6.400334118957272
      ],
      [
        "1](:[#7;a:2])",
        -6.432347308658684
      ],
      [
        "C;D1;H3:",
        -6.438149038840919
      ],
      [
        ":[n;H0;D2;+0:",
        -6.485818707804147
      ],
      [
        "1](:[c:2])",
        -6.503221070630579
      ],
      [
        "-c1:c:c:c:c:c:1",
        -6.529268166601708
      ],
      [
        "/",
        -6.5833679719992
      ],
      [
        "CH2;D2;+0:1]",
        -6.587169252802862
      ],
      [
        "2;D2;+0:1]-[c:2]",
        -6.6247834313203695
      ],
      [
        "-[n;H0;D3;+0:",
        -6.628165540634291
      ],
      [
        ".O-B(-O)",
        -6.640829442300916
      ],
      [
        ":[n;H0;D3;+0:",
        -6.676547591796225
      ],
      [
        "[N;D1;H2:",
        -6.686514344257503
      ],
      [
        "c;H0;D3;+0:1]1:[",
        -6.690871428187627
      ],
      [
        "-[C@@H;D3;+0:",
        -6.727405861990031
      ],
      [
        "-[C@H;D3;+0:",
        -6.744950153639005
      ],
      [
        "1]1:[c:2]:[c:3]",
        -6.759337943890292
      ],
      [
        ")-O-C-1(-C)-C",
        -6.792060262292491
      ],
      [
        "#7;a:2]:[c:3]",
        -6.801985249901241
      ],
      [
        "[N;D1;H0:",
        -6.822194333498814
      ],
      [
        "[#8;a:",
        -6.8397510888326405
      ],
      [
        "CH;D3;+0:",
        -6.881673795369553
      ],
      [
        "c:2](:[#7;a:3])",
        -6.9539973692419235
      ],
      [
        "B",
        -6.965883468567832
      ],
      [
        "4](:[c:5]):[c:6]",
        -7.087815266837537
      ],
      [
        "\\",
        -7.092813943102236
      ],
      [
        "=[N;H0;D2;+0:",
        -7.11819640009829
      ],
      [
        "F;D1;H0:",
        -7.186796363006195
      ],
      [
        "I",
        -7.218376626484861
      ],
      [
        "n",
        -7.241482782702738
      ],
      [
        "[C;D1;H1:",
        -7.381330969246465
      ],
      [
        ">>C-C1(-C)-O-B(",
        -7.450562483963288
      ],
      [
        ";H0;D4;+0:",
        -7.485892977362647
      ],
      [
        ">>C-C(-C)(-C)-O-",
        -7.487062724036051
      ],
      [
        ".C-C1(-C)-O-B(",
        -7.524945860650018
      ],
      [
        "C-C-[Sn](-C-C",
        -7.524945860650018
      ],
      [
        "-C-C)(-C-C-C-C)",
        -7.540510298634516
      ],
      [
        "Br;H0;D1;+0:1]",
        -7.6656727125421265
      ],
      [
        "c",
        -7.717666246145677
      ],
      [
        "F-C(-F)(-F)-",
        -7.720480567649006
      ],
      [
        "O;D1;H0:4]=[C:5]",
        -7.7313804869776
      ],
      [
        "4",
        -7.776545895273518
      ],
      [
        ">>C-S(=O)(=O)-",
        -7.850714412953078
      ],
      [
        "3",
        -7.915030710375467
      ],
      [
        "s",
        -7.940107150756398
      ],
      [
        "=[S;H0;D1;+0:",
        -7.975824811314578
      ],
      [
        ".[NH3;D0;+0:",
        -8.06448926067063
      ],
      [
        "g",
        -8.546957751363093
      ],
      [
        "l",
        -8.547057751363093
      ],
      [
        "M",
        -8.547157751363093
      ],
      [
        "r",
        -8.547257751363095
      ],
      [
        "o",
        -8.547357751363094
      ],
      [
        "Z",
        -8.547457751363094
      ],
      [
        "8",
        -8.547557751363094
      ],
      [
        ";",
        -8.547657751363094
      ],
      [
        "F",
        -8.547757751363093
      ],
      [
        "D",
        -8.547857751363093
      ],
      [
        "P",
        -8.547957751363093
      ],
      [
        "a",
        -8.548057751363094
      ],
      [
        "+",
        -8.548157751363094
      ],
      [
        "#",
        -8.548257751363094
      ],
      [
        "7",
        -8.548357751363094
      ],
      [
        "@",
        -8.548457751363093
      ],
      [
        "i",
        -8.548557751363093
      ],
      [
        "9",
        -8.548657751363093
      ],
      [
        "6",
        -8.548757751363093
      ],
      [
        ">",
        -8.548857751363094
      ],
      [
        "H",
        -8.548957751363094
      ],
      [
        "u",
        -8.549057751363094
      ],
      [
        "5",
        -8.549157751363094
      ]
    ],
    "byte_fallback": false
  }
}
