{
  "version": "1.0",
  "truncation": null,
  "padding": {
    "strategy": "BatchLongest",
    "direction": "Right",
    "pad_to_multiple_of": null,
    "pad_id": 2,
    "pad_type_id": 0,
    "pad_token": " "
  },
  "added_tokens": [
    {
      "id": 0,
      "content": "^",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "_",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": " ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "§",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "°",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": null,
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "^",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "_",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "^": {
        "id": "^",
        "ids": [
          0
        ],
        "tokens": [
          "^"
        ]
      },
      "_": {
        "id": "_",
        "ids": [
          1
        ],
        "tokens": [
          "_"
        ]
      }
    }
  },
  "decoder": null,
  "model": {
    "type": "Unigram",
    "unk_id": 3,
    "vocab": [
      [
        "^",
        0.0
      ],
      [
        "_",
        0.0
      ],
      [
        " ",
        0.0
      ],
      [
        "§",
        0.0
      ],
      [
        "°",
        0.0
      ],
      [
        ")",
        -2.8601217070365177
      ],
      [
        "(",
        -3.140605667801349
      ],
      [
        "5]",
        -3.178202517037656
      ],
      [
        "4]",
        -3.3659096116530804
      ],
      [
        "6]",
        -3.484278174258666
      ],
      [
        "7]",
        -3.539270281563839
      ],
      [
        "3]",
        -3.617212634602309
      ],
      [
        "2]",
        -3.7058918271089727
      ],
      [
        "1]",
        -3.7855199697138
      ],
      [
        "8]",
        -3.841270174669836
      ],
      [
        "1",
        -3.873559884761347
      ],
      [
        ":[#7;a:",
        -3.900077131064537
      ],
      [
        ":[c:",
        -3.986229912882761
      ],
      [
        "=[O;D1;H0:",
        -4.114093169933138
      ],
      [
        "9]",
        -4.231124809319759
      ],
      [
        "-[NH;D2;+0:",
        -4.301450011996774
      ],
      [
        "-[",
        -4.334875481457646
      ],
      [
        "-[c:",
        -4.34174358444748
      ],
      [
        "-[C:",
        -4.34537968419713
      ],
      [
        "-[C;H0;D3;+0:",
        -4.402633717600598
      ],
      [
        "-[c;H0;D3;+0:",
        -4.452701082337125
      ],
      [
        "10]",
        -4.517910533454383
      ],
      [
        ":1",
        -4.523325087096643
      ],
      [
        "[#7;a:",
        -4.595713156860394
      ],
      [
        ":",
        -4.66729028712911
      ],
      [
        "[",
        -4.71342178145559
      ],
      [
        "-",
        -4.770584425219684
      ],
      [
        ".",
        -4.806983886561109
      ],
      [
        "[C:",
        -4.854102758757673
      ],
      [
        "1](=[O;D1;H0:2])",
        -4.857890865743465
      ],
      [
        ":[c:6]",
        -4.885080688897208
      ],
      [
        ":[c:3]",
        -4.914436463510354
      ],
      [
        "-[CH2;D2;+0:1]",
        -4.932004957364495
      ],
      [
        ">>",
        -4.9351069951763415
      ],
      [
        "=[C:",
        -4.937846194013141
      ],
      [
        "-[C:3]",
        -4.977662773849172
      ],
      [
        ".[C:",
        -5.001308910607979
      ],
      [
        "-[NH2;D1;+0:",
        -5.025666730572139
      ],
      [
        ":[c;H0;D3;+0:",
        -5.0365013462210335
      ],
      [
        "-[C:2]",
        -5.0482062774510705
      ],
      [
        "-[N;H0;D3;+0:",
        -5.054641696181003
      ],
      [
        ">>Cl-[",
        -5.116313533999416
      ],
      [
        "[#7:",
        -5.141325475555951
      ],
      [
        "-[C:7]",
        -5.152495925661588
      ],
      [
        ">>O",
        -5.161245425553633
      ],
      [
        "-[c:3]",
        -5.193081131505672
      ],
      [
        "(-[C;D1;H3:",
        -5.217332425479562
      ],
      [
        "11]",
        -5.218525328064214
      ],
      [
        "-[CH;D3;+0:",
        -5.222671872331447
      ],
      [
        "OH;D1;+0:",
        -5.246197134153531
      ],
      [
        "=",
        -5.277876166303839
      ],
      [
        "[#8:",
        -5.304015951294728
      ],
      [
        "-[CH2;D2;+0:",
        -5.336721071648528
      ],
      [
        "C",
        -5.339321611968442
      ],
      [
        ">>Br-[",
        -5.344809633502644
      ],
      [
        "-C",
        -5.34650971162958
      ],
      [
        "-[C;D1;H3:",
        -5.3707101664960755
      ],
      [
        "O",
        -5.37241233514886
      ],
      [
        "c;H0;D3;+0:",
        -5.392933646660072
      ],
      [
        ":[c:2]",
        -5.415827589089749
      ],
      [
        "1](:[c:2]):[c:3]",
        -5.428131226214703
      ],
      [
        ":[#7;a:4]",
        -5.430942080866121
      ],
      [
        "-[#7:",
        -5.4314299883264034
      ],
      [
        "(-[#8:",
        -5.493295644531047
      ],
      [
        "1](-[C:2])",
        -5.5064788263918825
      ],
      [
        "-[O;H0;D2;+0:",
        -5.525381008631345
      ],
      [
        "N",
        -5.609248671248748
      ],
      [
        ":[c:9]",
        -5.621311061354428
      ],
      [
        "[#16;a:",
        -5.625015557968803
      ],
      [
        "(=[O;D1;H0:3])",
        -5.671650173976439
      ],
      [
        ".[",
        -5.676995756828971
      ],
      [
        "0",
        -5.748031326119868
      ],
      [
        ":[#16;a:",
        -5.75631792479929
      ],
      [
        "=[C;H0;D3;+0:",
        -5.7679268003871496
      ],
      [
        ":[#8;a:",
        -5.77921113679408
      ],
      [
        "=[O;D1;H0:3]",
        -5.817350284526308
      ],
      [
        ":[c:4]:[#7;a:5]",
        -5.852321546328037
      ],
      [
        "6]:[c:7]",
        -5.868457855600633
      ],
      [
        "2",
        -5.8982508637293565
      ],
      [
        ":[nH;D2;+0:",
        -5.934217032521678
      ],
      [
        "=[CH;D2;+0:",
        -5.9595840576043395
      ],
      [
        "C;H0;D3;+0:",
        -5.97474655420869
      ],
      [
        ":[#7;a:4]:[c:5]",
        -6.0216216800612985
      ],
      [
        "1](-[C;D1;H3:2])",
        -6.024857183820887
      ],
      [
        "-[CH;D2;+0:",
        -6.042115929000188
      ],
      [
        ":[cH;D2;+0:",
        -6.128092043972521
      ],
      [
        ";H0;D2;+0:",
        -6.160092632721405
      ],
      [
        "(=[O;D1;H0:6])",
        -6.169617922434288
      ],
      [
        "-[O;D1;H1:",
        -6.177025469249184
      ],
      [
        "S",
        -6.188543505845839
      ],
      [
        ";H0;D3;+0:",
        -6.204437774670533
      ],
      [
        "=[O;H0;D1;+0:",
        -6.209648126567517
      ],
      [
        ".[NH2;D1;+0:",
        -6.209648126567521
      ],
      [
        "(=[O;D1;H0:5])",
        -6.214626899340597
      ],
      [
        "c;H0;D3;+0:1](:[",
        -6.233032237713025
      ],
      [
        ">>Br-[CH",
        -6.2375051740453955
      ],
      [
        "]",
        -6.249354262806902
      ],
      [
        ";H0;D",
        -6.2628521425363655
      ],
      [
        "7]-[C:8]",
        -6.276380573791191
      ],
      [
        "2;D2;+0:1]-[C:2]",
        -6.291020986922749
      ],
      [
        "[#16:",
        -6.321361492015837
      ],
      [
        ":[c:5]:[#7;a:6]",
        -6.336465054249029
      ],
      [
        "CH3;D1;+0:",
        -6.363971468168629
      ],
      [
        "[C;D1;H2:",
        -6.3639714681686295
      ],
      [
        "[O;D1;H0:",
        -6.38290043918189
      ],
      [
        ">>I-[",
        -6.387112717968656
      ],
      [
        "#7;a:2]):[c:3]",
        -6.400334118957272
      ],
      [
        "1](:[#7;a:2])",
        -6.4323473086586835
      ],
      [
        "C;D1;H3:",
        -6.438149038840908
      ],
      [
        ":[n;H0;D2;+0:",
        -6.485818707804157
      ],
      [
        "1](:[c:2])",
        -6.5032210706305795
      ],
      [
        "-c1:c:c:c:c:c:1",
        -6.5292681666017165
      ],
      [
        "/",
        -6.583367971999201
      ],
      [
        "CH2;D2;+0:1]",
        -6.587169252802862
      ],
      [
        "2;D2;+0:1]-[c:2]",
        -6.624783431320369
      ],
      [
        "-[n;H0;D3;+0:",
        -6.628165540634301
      ],
      [
        ".O-B(-O)",
        -6.640829442300915
      ],
      [
        ":[n;H0;D3;+0:",
        -6.676547591796232
      ],
      [
        "[N;D1;H2:",
        -6.686514344257505
      ],
      [
        "c;H0;D3;+0:1]1:[",
        -6.6908714281876245
      ],
      [
        "-[C@@H;D3;+0:",
        -6.727405861990026
      ],
      [
        "-[C@H;D3;+0:",
        -6.744950153638999
      ],
      [
        "1]1:[c:2]:[c:3]",
        -6.759337943890287
      ],
      [
        ")-O-C-1(-C)-C",
        -6.792060262292495
      ],
      [
        "#7;a:2]:[c:3]",
        -6.801985249901237
      ],
      [
        "[N;D1;H0:",
        -6.822194333498819
      ],
      [
        "[#8;a:",
        -6.839751088832632
      ],
      [
        "CH;D3;+0:",
        -6.8816737953695535
      ],
      [
        "c:2](:[#7;a:3])",
        -6.953997369241925
      ],
      [
        "B",
        -6.965883468567816
      ],
      [
        "4](:[c:5]):[c:6]",
        -7.087815266837545
      ],
      [
        "\\",
        -7.092813943102233
      ],
      [
        "=[N;H0;D2;+0:",
        -7.118196400098286
      ],
      [
        "F;D1;H0:",
        -7.186796363006215
      ],
      [
        "I",
        -7.2183766264848686
      ],
      [
        "n",
        -7.241482782702749
      ],
      [
        "[C;D1;H1:",
        -7.381330969246465
      ],
      [
        ">>C-C1(-C)-O-B(",
        -7.450562483963292
      ],
      [
        ";H0;D4;+0:",
        -7.485892977362641
      ],
      [
        ">>C-C(-C)(-C)-O-",
        -7.487062724036049
      ],
      [
        "C-C-[Sn](-C-C",
        -7.524945860650024
      ],
      [
        ".C-C1(-C)-O-B(",
        -7.524945860650025
      ],
      [
        "-C-C)(-C-C-C-C)",
        -7.540510298634519
      ],
      [
        "Br;H0;D1;+0:1]",
        -7.665672712542131
      ],
      [
        "c",
        -7.71766624614568
      ],
      [
        "F-C(-F)(-F)-",
        -7.720480567648999
      ],
      [
        "O;D1;H0:4]=[C:5]",
        -7.731380486977603
      ],
      [
        "4",
        -7.77654589527353
      ],
      [
        ">>C-S(=O)(=O)-",
        -7.850714412953056
      ],
      [
        "3",
        -7.915030710375446
      ],
      [
        "s",
        -7.940107150756417
      ],
      [
        "=[S;H0;D1;+0:",
        -7.975824811314604
      ],
      [
        ".[NH3;D0;+0:",
        -8.064489260670637
      ],
      [
        ">",
        -8.546957751363099
      ],
      [
        "g",
        -8.547057751363099
      ],
      [
        "F",
        -8.547157751363098
      ],
      [
        "6",
        -8.5472577513631
      ],
      [
        "+",
        -8.5473577513631
      ],
      [
        "l",
        -8.5474577513631
      ],
      [
        "i",
        -8.5475577513631
      ],
      [
        "u",
        -8.547657751363099
      ],
      [
        "@",
        -8.547757751363099
      ],
      [
        "#",
        -8.547857751363098
      ],
      [
        ";",
        -8.547957751363098
      ],
      [
        "D",
        -8.5480577513631
      ],
      [
        "8",
        -8.5481577513631
      ],
      [
        "Z",
        -8.5482577513631
      ],
      [
        "o",
        -8.548357751363099
      ],
      [
        "5",
        -8.548457751363099
      ],
      [
        "H",
        -8.548557751363099
      ],
      [
        "7",
        -8.548657751363098
      ],
      [
        "P",
        -8.548757751363098
      ],
      [
        "9",
        -8.5488577513631
      ],
      [
        "r",
        -8.5489577513631
      ],
      [
        "M",
        -8.5490577513631
      ],
      [
        "a",
        -8.549157751363099
      ]
    ],
    "byte_fallback": false
  }
}
