{
  "version": "1.0",
  "truncation": null,
  "padding": {
    "strategy": "BatchLongest",
    "direction": "Right",
    "pad_to_multiple_of": null,
    "pad_id": 2,
    "pad_type_id": 0,
    "pad_token": " "
  },
  "added_tokens": [
    {
      "id": 0,
      "content": "^",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "_",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": " ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "§",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "°",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": null,
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "^",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "_",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "^": {
        "id": "^",
        "ids": [
          0
        ],
        "tokens": [
          "^"
        ]
      },
      "_": {
        "id": "_",
        "ids": [
          1
        ],
        "tokens": [
          "_"
        ]
      }
    }
  },
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "§",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "vocab": {
      "^": 0,
      "_": 1,
      " ": 2,
      "§": 3,
      "°": 4,
      "#": 5,
      "(": 6,
      ")": 7,
      "+": 8,
      "-": 9,
      "/": 10,
      "1": 11,
      "2": 12,
      "3": 13,
      "4": 14,
      "5": 15,
      "6": 16,
      "7": 17,
      "=": 18,
      "@": 19,
      "B": 20,
      "C": 21,
      "F": 22,
      "H": 23,
      "I": 24,
      "N": 25,
      "O": 26,
      "S": 27,
      "[": 28,
      "\\": 29,
      "]": 30,
      "c": 31,
      "l": 32,
      "n": 33,
      "o": 34,
      "r": 35,
      "s": 36,
      "cc": 37,
      "CC": 38,
      "c1": 39,
      "(C": 40,
      "O)": 41,
      "=O)": 42,
      "(=O)": 43,
      "c2": 44,
      "H]": 45,
      "C@": 46,
      "[C@": 47,
      "c1cc": 48,
      "(C)": 49,
      "c(": 50,
      "C(=O)": 51,
      "[C@H]": 52,
      "[C@@": 53,
      "c2cc": 54,
      "[C@@H]": 55,
      ")cc": 56,
      "c3": 57,
      "CCC": 58,
      "NC(=O)": 59,
      "+]": 60,
      "[N": 61,
      "2)": 62,
      "=C": 63,
      "[NH": 64,
      "CO": 65,
      "c(C": 66,
      "c1cccc": 67,
      "(=O)N": 68,
      ")cc1": 69,
      "c1ccc(": 70,
      "n1": 71,
      "F)": 72,
      "C1": 73,
      "c2cccc": 74,
      "c3cc": 75,
      "CC1": 76,
      "(C)C": 77,
      "nn": 78,
      "3)": 79,
      "2CC": 80,
      "c2ccccc2": 81,
      "C(=O)N": 82,
      "[NH+]": 83,
      "1CC": 84,
      "C[C@H]": 85,
      "c1ccccc1": 86,
      "(N": 87,
      "OC": 88,
      "cn": 89,
      "l)": 90,
      "O=C": 91,
      "c(C)": 92
    },
    "merges": [
      "c c",
      "C C",
      "c 1",
      "( C",
      "O )",
      "= O)",
      "( =O)",
      "c 2",
      "H ]",
      "C @",
      "[ C@",
      "c1 cc",
      "(C )",
      "c (",
      "C (=O)",
      "[C@ H]",
      "[C@ @",
      "c2 cc",
      "[C@@ H]",
      ") cc",
      "c 3",
      "CC C",
      "N C(=O)",
      "+ ]",
      "[ N",
      "2 )",
      "= C",
      "[N H",
      "C O",
      "c (C",
      "c1cc cc",
      "(=O) N",
      ")cc 1",
      "c1cc c(",
      "n 1",
      "F )",
      "C 1",
      "c2cc cc",
      "c3 cc",
      "CC 1",
      "(C) C",
      "n n",
      "3 )",
      "2 CC",
      "c2cccc c2",
      "C(=O) N",
      "[NH +]",
      "1 CC",
      "C [C@H]",
      "c1cccc c1",
      "( N",
      "O C",
      "c n",
      "l )",
      "O =C",
      "c (C)"
    ]
  }
}
