{
  "version": "1.0",
  "truncation": null,
  "padding": {
    "strategy": "BatchLongest",
    "direction": "Right",
    "pad_to_multiple_of": null,
    "pad_id": 2,
    "pad_type_id": 0,
    "pad_token": " "
  },
  "added_tokens": [
    {
      "id": 0,
      "content": "^",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "_",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": " ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "§",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "°",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": null,
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "^",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "_",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "^": {
        "id": "^",
        "ids": [
          0
        ],
        "tokens": [
          "^"
        ]
      },
      "_": {
        "id": "_",
        "ids": [
          1
        ],
        "tokens": [
          "_"
        ]
      }
    }
  },
  "decoder": null,
  "model": {
    "type": "Unigram",
    "unk_id": 3,
    "vocab": [
      [
        "^",
        0.0
      ],
      [
        "_",
        0.0
      ],
      [
        " ",
        0.0
      ],
      [
        "§",
        0.0
      ],
      [
        "°",
        0.0
      ],
      [
        "C",
        -2.233912006369673
      ],
      [
        "c1",
        -3.1081781864843805
      ],
      [
        "cc",
        -3.271937014755782
      ],
      [
        "N",
        -3.2932537094114203
      ],
      [
        "O",
        -3.29483418819283
      ],
      [
        "n",
        -3.30534618178884
      ],
      [
        ")",
        -3.347521228865494
      ],
      [
        "CC",
        -3.431220650619059
      ],
      [
        "(",
        -3.5624560302929495
      ],
      [
        "c(",
        -3.7658138899612865
      ],
      [
        "c",
        -3.8218193367096447
      ],
      [
        "C(=O)",
        -3.856958418800305
      ],
      [
        "c3",
        -3.925406232496817
      ],
      [
        "=",
        -3.975334503896594
      ],
      [
        "c2",
        -4.003423620505826
      ],
      [
        "1",
        -4.112680698162677
      ],
      [
        "(C)",
        -4.121209869930366
      ],
      [
        "2",
        -4.136176182684526
      ],
      [
        "C1",
        -4.217689818358796
      ],
      [
        "c1ccc(",
        -4.2517352471193774
      ],
      [
        "-",
        -4.2524118038487195
      ],
      [
        "2)",
        -4.270562896653201
      ],
      [
        "cc(",
        -4.276471688539161
      ],
      [
        "C(",
        -4.308636867140015
      ],
      [
        "CO",
        -4.337904719409261
      ],
      [
        "C(=O)N",
        -4.42884622469847
      ],
      [
        "3)",
        -4.4492472923480015
      ],
      [
        "C2",
        -4.522375726064716
      ],
      [
        "O)",
        -4.537155620339098
      ],
      [
        "CCC",
        -4.589271525416073
      ],
      [
        "3",
        -4.724794788521143
      ],
      [
        "C(C)",
        -4.750491328822768
      ],
      [
        "cc1",
        -4.774712806543233
      ],
      [
        "cn",
        -4.786244699315764
      ],
      [
        "NC(=O)",
        -4.789019365906151
      ],
      [
        "CC1",
        -4.7936620670850925
      ],
      [
        "=O)",
        -4.84348009293687
      ],
      [
        "C)",
        -4.843704819057809
      ],
      [
        "S",
        -4.85023983222912
      ],
      [
        "n1",
        -4.86451017386112
      ],
      [
        "c1ccccc1",
        -4.924998441953765
      ],
      [
        "c2ccc(",
        -5.024291675091224
      ],
      [
        "[nH]",
        -5.110243493192602
      ],
      [
        "c4",
        -5.110439906923178
      ],
      [
        "s",
        -5.124712107024331
      ],
      [
        "N1",
        -5.13109013422188
      ],
      [
        "o",
        -5.1443416454484865
      ],
      [
        "F)",
        -5.173986710082017
      ],
      [
        "N(C",
        -5.185845166644551
      ],
      [
        "S(=O)(=O)",
        -5.2125573529680445
      ],
      [
        "Cl)",
        -5.2201681826244855
      ],
      [
        "c2ccc",
        -5.2702619038111145
      ],
      [
        "C(O)",
        -5.276647874822931
      ],
      [
        "2)cc1",
        -5.31425651751643
      ],
      [
        "O=C(",
        -5.316263615262406
      ],
      [
        "c3ccccc3",
        -5.3531973743275145
      ],
      [
        "4",
        -5.365584577985722
      ],
      [
        "c(Cl)c",
        -5.396247268723942
      ],
      [
        "C=C",
        -5.43551600096642
      ],
      [
        "5",
        -5.52101774180659
      ],
      [
        "N2CC",
        -5.731120719935696
      ],
      [
        "c(F)c",
        -5.761758311176198
      ],
      [
        "C(F)(F)F)",
        -5.816389560958179
      ],
      [
        "]",
        -5.913702822741753
      ],
      [
        "[",
        -5.913702822741753
      ],
      [
        "c(OC)c",
        -5.948373907492362
      ],
      [
        "c(-c3cc",
        -6.076591700433106
      ],
      [
        "Br)",
        -6.173257390984215
      ],
      [
        "#",
        -6.4067196061694975
      ],
      [
        "[N+](=O)[O-])",
        -6.413478073407886
      ],
      [
        "+",
        -6.459711891958461
      ],
      [
        "F",
        -6.666152699126236
      ],
      [
        "P",
        -7.117461698496008
      ],
      [
        "6",
        -7.298200155097025
      ],
      [
        "B",
        -8.020755755897493
      ],
      [
        "I",
        -8.076335551265265
      ],
      [
        "7",
        -9.064406674700862
      ],
      [
        "H",
        -9.76698682513355
      ],
      [
        "8",
        -10.676483437152587
      ],
      [
        "9",
        -11.620826449050387
      ],
      [
        "%",
        -13.140940597228251
      ],
      [
        "0",
        -13.512972359678049
      ],
      [
        "p",
        -13.732582739728535
      ],
      [
        "r",
        -17.65945377874763
      ],
      [
        "l",
        -17.65955377874763
      ],
      [
        "i",
        -17.65965377874763
      ],
      [
        "b",
        -17.65975377874763
      ],
      [
        "e",
        -17.65975377874763
      ]
    ],
    "byte_fallback": false
  }
}
