{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "^",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "_",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": " ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "§",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "°",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": null,
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "^",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "_",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "^": {
        "id": "^",
        "ids": [
          0
        ],
        "tokens": [
          "^"
        ]
      },
      "_": {
        "id": "_",
        "ids": [
          1
        ],
        "tokens": [
          "_"
        ]
      }
    }
  },
  "decoder": null,
  "model": {
    "type": "Unigram",
    "unk_id": 3,
    "vocab": [
      [
        "^",
        0.0
      ],
      [
        "_",
        0.0
      ],
      [
        " ",
        0.0
      ],
      [
        "§",
        0.0
      ],
      [
        "°",
        0.0
      ],
      [
        "C",
        -2.2339120063697244
      ],
      [
        "c1",
        -3.1081781864835527
      ],
      [
        "cc",
        -3.271937014755215
      ],
      [
        "N",
        -3.293253709411644
      ],
      [
        "O",
        -3.294834188192972
      ],
      [
        "n",
        -3.3053461817892877
      ],
      [
        ")",
        -3.3475212288652987
      ],
      [
        "CC",
        -3.4312206506182754
      ],
      [
        "(",
        -3.562456030292905
      ],
      [
        "c(",
        -3.765813889960226
      ],
      [
        "c",
        -3.8218193367107993
      ],
      [
        "C(=O)",
        -3.85695841879976
      ],
      [
        "c3",
        -3.9254062324959857
      ],
      [
        "=",
        -3.975334503896391
      ],
      [
        "c2",
        -4.003423620506085
      ],
      [
        "1",
        -4.112680698165528
      ],
      [
        "(C)",
        -4.121209869930812
      ],
      [
        "2",
        -4.136176182684141
      ],
      [
        "C1",
        -4.217689818358416
      ],
      [
        "c1ccc(",
        -4.251735247119425
      ],
      [
        "-",
        -4.2524118038487995
      ],
      [
        "2)",
        -4.270562896653393
      ],
      [
        "cc(",
        -4.276471688539328
      ],
      [
        "C(",
        -4.308636867140807
      ],
      [
        "CO",
        -4.337904719409291
      ],
      [
        "C(=O)N",
        -4.428846224698672
      ],
      [
        "3)",
        -4.449247292348053
      ],
      [
        "C2",
        -4.522375726064482
      ],
      [
        "O)",
        -4.537155620339265
      ],
      [
        "CCC",
        -4.589271525416391
      ],
      [
        "3",
        -4.7247947885207076
      ],
      [
        "C(C)",
        -4.750491328823394
      ],
      [
        "cc1",
        -4.774712806543164
      ],
      [
        "cn",
        -4.786244699315903
      ],
      [
        "NC(=O)",
        -4.789019365906416
      ],
      [
        "CC1",
        -4.793662067085185
      ],
      [
        "=O)",
        -4.843480092936945
      ],
      [
        "C)",
        -4.843704819057839
      ],
      [
        "S",
        -4.8502398322292315
      ],
      [
        "n1",
        -4.864510173861133
      ],
      [
        "c1ccccc1",
        -4.9249984419539174
      ],
      [
        "c2ccc(",
        -5.024291675091334
      ],
      [
        "[nH]",
        -5.110243493192636
      ],
      [
        "c4",
        -5.110439906923462
      ],
      [
        "s",
        -5.124712107024434
      ],
      [
        "N1",
        -5.131090134222044
      ],
      [
        "o",
        -5.1443416454485895
      ],
      [
        "F)",
        -5.173986710081916
      ],
      [
        "N(C",
        -5.185845166644658
      ],
      [
        "S(=O)(=O)",
        -5.212557352968133
      ],
      [
        "Cl)",
        -5.22016818262456
      ],
      [
        "c2ccc",
        -5.270261903811077
      ],
      [
        "C(O)",
        -5.276647874822949
      ],
      [
        "2)cc1",
        -5.314256517516542
      ],
      [
        "O=C(",
        -5.3162636152626614
      ],
      [
        "c3ccccc3",
        -5.353197374327491
      ],
      [
        "4",
        -5.365584577985324
      ],
      [
        "c(Cl)c",
        -5.396247268724105
      ],
      [
        "C=C",
        -5.435516000966773
      ],
      [
        "5",
        -5.521017741806693
      ],
      [
        "N2CC",
        -5.7311207199358805
      ],
      [
        "c(F)c",
        -5.761758311176187
      ],
      [
        "C(F)(F)F)",
        -5.8163895609581715
      ],
      [
        "]",
        -5.913702822742204
      ],
      [
        "[",
        -5.913702822742204
      ],
      [
        "c(OC)c",
        -5.948373907492384
      ],
      [
        "c(-c3cc",
        -6.076591700433331
      ],
      [
        "Br)",
        -6.173257390984318
      ],
      [
        "#",
        -6.406719606169599
      ],
      [
        "[N+](=O)[O-])",
        -6.413478073407989
      ],
      [
        "+",
        -6.459711891958564
      ],
      [
        "F",
        -6.66615269912632
      ],
      [
        "P",
        -7.11746169849612
      ],
      [
        "6",
        -7.298200155097154
      ],
      [
        "B",
        -8.020755755897602
      ],
      [
        "I",
        -8.076335551265368
      ],
      [
        "7",
        -9.06440667470104
      ],
      [
        "H",
        -9.766986825133454
      ],
      [
        "8",
        -10.676483437152768
      ],
      [
        "9",
        -11.620826449050552
      ],
      [
        "%",
        -13.14094059722827
      ],
      [
        "0",
        -13.512972359678088
      ],
      [
        "p",
        -13.732582739728649
      ],
      [
        "r",
        -17.659453778747732
      ],
      [
        "l",
        -17.659553778747732
      ],
      [
        "e",
        -17.65965377874773
      ],
      [
        "i",
        -17.65975377874773
      ],
      [
        "b",
        -17.65975377874773
      ]
    ],
    "byte_fallback": false
  }
}
