{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "^",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "_",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": " ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "§",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "°",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Split",
    "pattern": {
      "Regex": "\\[|\\]|A[cglmrstu]?|B[aeihkr]?|C[adeflmorsu]?|D[bsy]?|E[rsu]?|F[emr]?|G[ade]?|H[efgos]?|I[nr]?|K[r]?|L[aru]?|M[dgnot]?|N[abdeiop]?|Os?|P[abdmortu]?|R[aefghnu]?|S[bcdegimnr]?|T[abcehilm]?|U|V|W|Xe|Yb?|Z[nr]?|as|b|c|n|o|p|se?|\\(|\\)|@@?|\\+\\d+|\\++|-\\d+|-+|\\.|-|=|#\\d{1}|\\$\\(?|:[0-9]*|~|@|\\/\\??|\\\\\\??|\\%[0-9]{2}|[0-9]|\\*|>>?|D\\d{1}|H\\d{1}|h\\d{1}|R\\d{1}|r\\d{1}|v\\d{1}|X\\d{1}|x\\d{1}|#\\d{1}|!|&|,|;"
    },
    "behavior": "Isolated",
    "invert": false
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "^",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "_",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "^": {
        "id": "^",
        "ids": [
          0
        ],
        "tokens": [
          "^"
        ]
      },
      "_": {
        "id": "_",
        "ids": [
          1
        ],
        "tokens": [
          "_"
        ]
      }
    }
  },
  "decoder": null,
  "model": {
    "type": "WordLevel",
    "vocab": {
      "^": 0,
      "_": 1,
      " ": 2,
      "§": 3,
      "°": 4,
      "c": 5,
      "C": 6,
      "(": 7,
      ")": 8,
      "O": 9,
      "1": 10,
      "2": 11,
      "=": 12,
      "N": 13,
      "n": 14,
      "3": 15,
      "F": 16,
      "4": 17,
      "-": 18,
      "[": 19,
      "]": 20,
      "S": 21,
      "Cl": 22,
      "H": 23,
      "s": 24,
      "o": 25,
      "5": 26,
      "#": 27,
      "+": 28,
      "Br": 29,
      "Sc": 30,
      "P": 31,
      "6": 32,
      "I": 33,
      "-2": 34,
      "-3": 35,
      "7": 36,
      "B": 37,
      "Si": 38,
      "-4": 39,
      "Se": 40,
      "-1": 41,
      "8": 42,
      "se": 43,
      "9": 44,
      "-5": 45,
      "%10": 46,
      "p": 47,
      "-6": 48,
      "%11": 49,
      "Sn": 50,
      "+2": 51,
      "+3": 52,
      "-7": 53,
      "b": 54
    },
    "unk_token": "§"
  }
}
