{
  "version": "1.0",
  "truncation": null,
  "padding": {
    "strategy": "BatchLongest",
    "direction": "Right",
    "pad_to_multiple_of": null,
    "pad_id": 2,
    "pad_type_id": 0,
    "pad_token": " "
  },
  "added_tokens": [
    {
      "id": 0,
      "content": "^",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "_",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": " ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "§",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "°",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Split",
    "pattern": {
      "Regex": "\\[[^\\]]+]|A[cglmrstu]?|B[aeihkr]?|C[adeflmorsu]?|D[bsy]?|E[rsu]?|F[emr]?|G[ade]?|H[efgos]?|I[nr]?|K[r]?|L[aru]?|M[dgnot]?|N[abdeiop]?|Os?|P[abdmortu]?|R[aefghnu]?|S[bcdegimnr]?|T[abcehilm]?|U|V|W|Xe|Yb?|Z[nr]?|as|b|c|n|o|p|se?|\\(|\\)|@@?|\\+\\d+|\\++|-\\d+|-+|\\.|-|=|#\\d{1}|\\$\\(?|:[0-9]*|~|@|\\/\\??|\\\\\\??|\\%[0-9]{2}|[0-9]|\\*|>>?|D\\d{1}|H\\d{1}|h\\d{1}|R\\d{1}|r\\d{1}|v\\d{1}|X\\d{1}|x\\d{1}|#\\d{1}|!|&|,|;"
    },
    "behavior": "Isolated",
    "invert": false
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "^",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "_",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "^": {
        "id": "^",
        "ids": [
          0
        ],
        "tokens": [
          "^"
        ]
      },
      "_": {
        "id": "_",
        "ids": [
          1
        ],
        "tokens": [
          "_"
        ]
      }
    }
  },
  "decoder": null,
  "model": {
    "type": "WordLevel",
    "vocab": {
      "^": 0,
      "_": 1,
      " ": 2,
      "§": 3,
      "°": 4,
      "-": 5,
      ":": 6,
      "(": 7,
      ")": 8,
      "=": 9,
      ">>": 10,
      ".": 11,
      "C": 12,
      "[c:3]": 13,
      "O": 14,
      "[c:2]": 15,
      "[c;H0;D3;+0:1]": 16,
      "[C:2]": 17,
      "1": 18,
      "[c:5]": 19,
      "[C;H0;D3;+0:1]": 20,
      "[#7;a:4]": 21,
      "[c:6]": 22,
      ":1": 23,
      "[C:4]": 24,
      "[CH2;D2;+0:1]": 25,
      "c": 26,
      "[c:4]": 27,
      "[C:3]": 28,
      "[C:5]": 29,
      "[C:6]": 30,
      "[c:7]": 31,
      "[#7;a:5]": 32,
      "[O;D1;H0:2]": 33,
      "Cl": 34,
      "[C:7]": 35,
      "[c:8]": 36,
      "[#7;a:3]": 37,
      "[O;D1;H0:3]": 38,
      "Br": 39,
      "[#7;a:2]": 40,
      "[#7;a:6]": 41,
      "[C:8]": 42,
      "[c:9]": 43,
      "[#7;a:7]": 44,
      "[O;D1;H0:5]": 45,
      "[O;D1;H0:4]": 46,
      "/": 47,
      "[O;D1;H0:6]": 48,
      "-1": 49,
      "[C;D1;H3:2]": 50,
      "[C:9]": 51,
      "#": 52,
      "[#7;a:8]": 53,
      "[CH;D2;+0:1]": 54,
      "[O;D1;H0:7]": 55,
      "[CH;D3;+0:1]": 56,
      "B": 57,
      "[c;H0;D3;+0:4]": 58,
      "[O;D1;H0:8]": 59,
      "[c:10]": 60,
      "[NH;D2;+0:7]": 61,
      "I": 62,
      "[NH;D2;+0:6]": 63,
      "[#7:4]": 64,
      "[#8:3]": 65,
      "[C;D1;H3:6]": 66,
      "[#7;a:9]": 67,
      "[#8:4]": 68,
      "[c;H0;D3;+0:6]": 69,
      "F": 70,
      "[NH;D2;+0:5]": 71,
      "[C;D1;H3:5]": 72,
      "[NH;D2;+0:8]": 73,
      "[O;D1;H0:9]": 74,
      "[C:10]": 75,
      "[#16;a:4]": 76,
      "[C;D1;H3:3]": 77,
      "[C:1]": 78,
      "[#7;a:1]": 79,
      "[c;H0;D3;+0:5]": 80,
      "[#7:5]": 81,
      "[NH2;D1;+0:7]": 82,
      "[C;D1;H3:4]": 83,
      "[C;D1;H3:7]": 84,
      "[c:11]": 85,
      "[#7:3]": 86,
      "[S;H0;D4;+0:1]": 87,
      "[#8:5]": 88,
      "[c;H0;D3;+0:7]": 89,
      "[NH2;D1;+0:6]": 90,
      "[C;H0;D3;+0:4]": 91,
      "[#8:2]": 92,
      "[#7;a:10]": 93,
      "[N;H0;D3;+0:6]": 94,
      "[N;H0;D3;+0:7]": 95,
      "[NH2;D1;+0:8]": 96,
      "[#7:2]": 97,
      "[#16;a:2]": 98,
      "[#8;a:4]": 99,
      "[NH2;D1;+0:5]": 100,
      "[#16;a:5]": 101,
      "[NH;D2;+0:9]": 102,
      "[N;H0;D3;+0:5]": 103,
      "[c;H0;D3;+0:3]": 104,
      "[CH3;D1;+0:1]": 105,
      "[NH;D2;+0:4]": 106,
      "[#7:1]": 107,
      "[#8:1]": 108,
      "[C;H0;D3;+0:5]": 109,
      "[#8:7]": 110,
      "[CH2;D2;+0:4]": 111,
      "[CH;D2;+0:4]": 112,
      "2": 113,
      "[OH;D1;+0:5]": 114,
      "[C;D1;H3:8]": 115,
      "[#8:6]": 116,
      "[O;D1;H0:10]": 117,
      "[OH;D1;+0:6]": 118,
      "[#7:6]": 119,
      "[N;H0;D3;+0:8]": 120,
      "[OH;D1;+0:7]": 121,
      "\\": 122,
      "[CH;D3;+0:4]": 123,
      "[C;H0;D3;+0:3]": 124,
      "[NH2;D1;+0:4]": 125,
      "[#16;a:3]": 126,
      "[#8;a:5]": 127,
      "[CH2;D2;+0:5]": 128,
      ":2": 129,
      "[NH2;D1;+0:9]": 130,
      "S": 131,
      "[O;H0;D2;+0:7]": 132,
      "[#8:8]": 133,
      "[c:12]": 134,
      "[C:11]": 135,
      "[C;H0;D3;+0:2]": 136,
      "[c;H0;D3;+0:8]": 137,
      "[c;H0;D3;+0:2]": 138,
      "[CH;D2;+0:3]": 139,
      "[#7:7]": 140,
      "[C;H0;D3;+0:6]": 141,
      "[CH2;D2;+0:3]": 142,
      "[O;H0;D2;+0:6]": 143,
      "[Sn]": 144,
      "[C;H0;D4;+0:1]": 145,
      "[NH;D2;+0:10]": 146,
      "[#16;a:1]": 147,
      "[CH;D2;+0:5]": 148,
      "[CH;D3;+0:3]": 149,
      "[OH;D1;+0:1]": 150,
      "[C;D1;H3:9]": 151,
      "[NH;D2;+0:1]": 152,
      "[OH;D1;+0:4]": 153,
      "[#7;a:11]": 154,
      "N": 155,
      "[#8;a:3]": 156,
      "[n;H0;D3;+0:7]": 157,
      "[CH2;D2;+0:6]": 158,
      "[CH;D3;+0:5]": 159,
      "[nH;D2;+0:7]": 160,
      "[O;D1;H0:11]": 161,
      "[Mg+]": 162,
      "[#16:4]": 163,
      "[CH;D3;+0:2]": 164,
      "[NH2;D1;+0:10]": 165,
      "[O;H0;D2;+0:5]": 166,
      "[CH2;D2;+0:2]": 167,
      "[CH2;D2;+0:7]": 168,
      "[O;D1;H1:6]": 169,
      "[#8;a:6]": 170,
      "[F;D1;H0:5]": 171,
      "[O;H0;D1;+0:5]": 172,
      "[N;H0;D3;+0:4]": 173,
      "[Br;H0;D1;+0:1]": 174,
      "[c;H0;D3;+0:9]": 175,
      "[C;D1;H3:1]": 176,
      "[F;D1;H0:6]": 177,
      "[O;H0;D2;+0:8]": 178,
      "[#16;a:6]": 179,
      "[nH;D2;+0:6]": 180,
      "[C;H0;D3;+0:7]": 181,
      "[CH;D2;+0:6]": 182,
      "[#16;a:7]": 183,
      "[OH;D1;+0:8]": 184,
      "[C;D1;H3:10]": 185,
      "[N;H0;D3;+0:9]": 186,
      "[C;D1;H2:3]": 187,
      "[O;H0;D2;+0:4]": 188,
      "[O;H0;D2;+0:1]": 189,
      "[n;H0;D3;+0:6]": 190,
      "[#7:8]": 191,
      "[cH;D2;+0:1]": 192,
      "[nH;D2;+0:5]": 193,
      "[C;D1;H2:4]": 194,
      "[C@@H;D3;+0:1]": 195,
      "[NH2;D1;+0:1]": 196,
      "[C@H;D3;+0:1]": 197,
      "[C;D1;H3:11]": 198,
      "[F;D1;H0:4]": 199,
      "[N;H0;D2;+0:5]": 200,
      "[n;H0;D3;+0:5]": 201,
      "[NH2;D1;+0:11]": 202,
      "[NH;D2;+0:11]": 203,
      "[CH;D2;+0:2]": 204,
      "[N;H0;D2;+0:6]": 205,
      "[n;H0;D3;+0:8]": 206,
      "[NH;D2;+0:3]": 207,
      "[O;H0;D1;+0:6]": 208,
      "[#8:9]": 209,
      "[C:12]": 210,
      "[CH;D3;+0:6]": 211,
      "[c:13]": 212,
      "[nH;D2;+0:8]": 213,
      "[N;H0;D3;+0:1]": 214,
      "[cH;D2;+0:3]": 215,
      "[O;H0;D1;+0:4]": 216,
      "[C;H0;D2;+0:5]": 217,
      "[#16:3]": 218,
      "[#8;a:7]": 219,
      "[C;H0;D2;+0:4]": 220,
      "[O;D1;H0:12]": 221,
      "[NH;D2;+0:2]": 222,
      "[N;H0;D2;+0:4]": 223,
      "[O;D1;H1:5]": 224,
      "[CH;D2;+0:7]": 225,
      "[P+]": 226,
      "[OH;D1;+0:3]": 227,
      "[C;H0;D2;+0:7]": 228,
      "[O;D1;H1:9]": 229,
      "P": 230,
      "[c;H0;D3;+0:10]": 231,
      "[CH2;D1;+0:1]": 232,
      "[C;D1;H3:12]": 233,
      "[C;H0;D3;+0:8]": 234,
      "[CH;D2;+0:8]": 235,
      "[cH;D2;+0:4]": 236,
      "[cH;D2;+0:6]": 237,
      "[#16:5]": 238,
      "[#7:9]": 239,
      "[#7;a:12]": 240,
      "[C;H0;D2;+0:6]": 241,
      "[O;H0;D1;+0:2]": 242,
      "[C;H0;D2;+0:1]": 243,
      "[CH2;D2;+0:8]": 244,
      "[N;H0;D2;+0:7]": 245,
      "[O;H0;D1;+0:1]": 246,
      "[nH;D2;+0:1]": 247,
      "[#8;a:2]": 248,
      "[CH;D3;+0:7]": 249,
      "[N;D1;H0:3]": 250,
      "[N;H0;D3;+0:10]": 251,
      "[O;D1;H0:1]": 252,
      "[O;H0;D2;+0:9]": 253,
      "[OH;D1;+0:2]": 254,
      "[OH;D1;+0:9]": 255,
      "[cH;D2;+0:5]": 256,
      "[O-]": 257,
      "[F;D1;H0:3]": 258,
      "[O;D1;H1:8]": 259,
      "[cH;D2;+0:7]": 260,
      "[#16:2]": 261,
      "[#8:10]": 262,
      "[O;D1;H1:7]": 263,
      "[S;H0;D2;+0:5]": 264,
      "[S;H0;D2;+0:6]": 265,
      "[C;H0;D2;+0:3]": 266,
      "[N;D1;H2:4]": 267,
      "[N;D1;H2:6]": 268,
      "[O;H0;D1;+0:7]": 269,
      "[n;H0;D2;+0:7]": 270,
      "[C:13]": 271,
      "[F;D1;H0:7]": 272,
      "[nH;D2;+0:9]": 273,
      "[#8;a:8]": 274,
      "[C;H0;D2;+0:2]": 275,
      "[c:1]": 276,
      "[O;H0;D1;+0:3]": 277,
      "[n;H0;D3;+0:9]": 278,
      "[#16:1]": 279,
      "[C;D1;H2:2]": 280,
      "[C;D1;H2:5]": 281,
      "[C;H0;D2;+0:8]": 282,
      "[NH2;D1;+0:3]": 283,
      "[O;H0;D2;+0:3]": 284,
      "[#8;a:1]": 285,
      "[C;D1;H1:3]": 286,
      "[N;D1;H2:3]": 287,
      "[C;H0;D3;+0:9]": 288,
      "[C@@H;D3;+0:3]": 289,
      "[CH3;D1;+0:5]": 290,
      "[N;D1;H2:5]": 291,
      "[S;H0;D2;+0:7]": 292,
      "[c;H0;D3;+0:11]": 293,
      "[n;H0;D2;+0:8]": 294,
      "[n;H0;D2;+0:6]": 295,
      "n": 296,
      "[#7:10]": 297,
      "[N;D1;H0:5]": 298,
      "[N;D1;H2:7]": 299,
      "[SH;D1;+0:7]": 300,
      "[Si]": 301,
      "[C@H;D3;+0:2]": 302,
      "[C@H;D3;+0:3]": 303,
      "[N;H0;D2;+0:8]": 304,
      "[N;H0;D3;+0:3]": 305,
      "[Zn+]": 306,
      "[#8:11]": 307,
      "[#8;a:9]": 308,
      "[C@@H;D3;+0:2]": 309,
      "[Cl;D1;H0:2]": 310,
      "[N;D1;H0:4]": 311,
      "[N;D1;H0:6]": 312,
      "[NH2;D1;+0:12]": 313,
      "[O;D1;H0:13]": 314,
      "[SH;D1;+0:6]": 315,
      "[N;H0;D2;+0:2]": 316,
      "[n;H0;D2;+0:9]": 317,
      "-2": 318,
      "[#16;a:9]": 319,
      "[#7;+:5]": 320,
      "[C;D1;H2:7]": 321,
      "[CH3;D1;+0:4]": 322,
      "[S;H0;D2;+0:4]": 323,
      "[c:14]": 324,
      "[cH;D2;+0:2]": 325,
      "[nH;D2;+0:4]": 326,
      "[C;H0;D4;+0:2]": 327,
      "[C;H0;D4;+0:5]": 328,
      "[n;H0;D3;+0:10]": 329,
      "[#16:6]": 330,
      "[C;H0;D3;+0:10]": 331,
      "[F;D1;H0:2]": 332,
      "[NH2;D1;+0:2]": 333,
      "[O;D1;H1:2]": 334,
      "[O;D1;H1:4]": 335,
      "[SH;D1;+0:5]": 336,
      "[c:15]": 337,
      "[C@@H;D3;+0:4]": 338,
      "[CH;D3;+0:8]": 339,
      "[n;H0;D2;+0:5]": 340,
      "[n;H0;D3;+0:1]": 341,
      "[C;D1;H1:5]": 342,
      "[C;D1;H2:8]": 343,
      "[C@@H;D3;+0:5]": 344,
      "[N;-;D1;H0:6]": 345,
      "[N;D1;H2:8]": 346,
      "[N;H0;D3;+0:11]": 347,
      "[S;D1;H0:6]": 348,
      "[S;H0;D2;+0:8]": 349,
      "[cH;D2;+0:8]": 350,
      "[C;H0;D4;+0:4]": 351,
      "[CH2;D1;+0:5]": 352,
      "[CH3;D1;+0:6]": 353,
      "[n;H0;D2;+0:11]": 354,
      "[#16;a:8]": 355,
      "[#7:11]": 356,
      "[CH2;D2;+0:9]": 357,
      "[CH;D2;+0:9]": 358,
      "[N;D1;H0:7]": 359,
      "[N;H0;D2;+0:3]": 360,
      "[n;H0;D2;+0:3]": 361,
      "[n;H0;D2;+0:4]": 362,
      "[n;H0;D3;+0:4]": 363,
      "[n;H0;D2;+0:10]": 364,
      "[C;D1;H3:13]": 365,
      "[C;H0;D4;+0:3]": 366,
      "[C@H;D3;+0:4]": 367,
      "[F;D1;H0:8]": 368,
      "[N;D1;H0:8]": 369,
      "[O;D1;H1:3]": 370,
      "[SH;D1;+0:4]": 371,
      "[CH2;D2;+0:10]": 372,
      "[#7;+:7]": 373,
      "[C;D1;H1:4]": 374,
      "[C@H;D3;+0:5]": 375,
      "[CH3;D1;+0:7]": 376,
      "[CH;D1;+0:7]": 377,
      "[CH;D3;+0:9]": 378,
      "[N;-;D1;H0:8]": 379,
      "[NH;D2;+0:12]": 380,
      "[O;H0;D2;+0:10]": 381,
      "[SH;D1;+0:8]": 382,
      "[OH;D1;+0:10]": 383,
      "[#7;a:13]": 384,
      "[#8:12]": 385,
      "[C;D1;H2:6]": 386,
      "[C;H0;D4;+0:6]": 387,
      "[N;H0;D3;+0:2]": 388,
      "[O;D1;H1:10]": 389,
      "[O;H0;D1;+0:8]": 390,
      "[S;H0;D2;+0:3]": 391,
      "[Sn;H0;D4;+0:1]": 392,
      "[nH;D2;+0:10]": 393,
      "[C@@H;D3;+0:6]": 394,
      "[c;H0;D3;+0:12]": 395,
      "[C;H0;D2;+0:9]": 396,
      "[CH;D2;+0:10]": 397,
      "[F;D1;H0:9]": 398,
      "[N-;H0;D1:6]": 399,
      "[S;D1;H0:4]": 400,
      "[n;H0;D2;+0:2]": 401,
      "[n;H0;D3;+0:11]": 402,
      "[nH;D2;+0:11]": 403,
      "[nH;D2;+0:3]": 404,
      "[CH2;D1;+0:4]": 405,
      "[Cu]": 406,
      "[N-;H0;D1:4]": 407,
      "[NH3;D0;+0:6]": 408,
      "[O-;H0;D1:6]": 409,
      "[O;H0;D2;+0:2]": 410,
      "[S;H0;D1;+0:9]": 411,
      "[cH;D2;+0:9]": 412,
      "[s;H0;D2;+0:9]": 413,
      "[C:15]": 414,
      "[C;D1;H1:1]": 415,
      "[C;D1;H2:1]": 416,
      "[C@H;D3;+0:6]": 417,
      "[NH3;D0;+0:5]": 418,
      "[NH3;D0;+0:7]": 419,
      "[O;D1;H0:14]": 420,
      "[S;D1;H0:3]": 421,
      "[O-;H0;D1:7]": 422,
      "[S;H0;D3;+0:3]": 423,
      "[#16;a:10]": 424,
      "[#7:12]": 425,
      "[#7;+:6]": 426,
      "[#7;a:14]": 427,
      "[#8;a:10]": 428,
      "[CH;D1;+0:5]": 429,
      "[CH;D1;+0:8]": 430,
      "[Cl;H0;D1;+0:1]": 431,
      "[N;-;D1;H0:7]": 432,
      "[N;D1;H0:2]": 433,
      "[N;D1;H2:9]": 434,
      "[NH2;D1;+0:13]": 435,
      "[C@H;D3;+0:7]": 436,
      "[N;H0;D2;+0:1]": 437,
      "[O-;H0;D1:5]": 438,
      "[c;H0;D3;+0:13]": 439,
      "[n;H0;D2;+0:12]": 440,
      "[#15:2]": 441,
      "[#16:8]": 442,
      "[C:14]": 443,
      "[C;D1;H1:7]": 444,
      "[C;D1;H3:14]": 445,
      "[N;H0;D1;+0:2]": 446,
      "[O-;H0;D1:8]": 447,
      "[S;D1;H0:8]": 448,
      "[C;H0;D2;+0:10]": 449,
      "[CH2;D1;+0:6]": 450,
      "[CH2;D1;+0:8]": 451,
      "[CH3;D1;+0:3]": 452,
      "[I;H0;D1;+0:1]": 453,
      "[NH3;D0;+0:4]": 454,
      "[S;H0;D1;+0:10]": 455,
      "[S;H0;D1;+0:12]": 456,
      "[S;H0;D3;+0:5]": 457,
      "[cH;D2;+0:10]": 458,
      "[n;H0;D3;+0:3]": 459,
      "[s;H0;D2;+0:10]": 460,
      "[s;H0;D2;+0:12]": 461,
      "3": 462,
      "[#7;+:1]": 463,
      "[#7;a;+:4]": 464,
      "[Br;D1;H0:2]": 465,
      "[C-;H0;D1:4]": 466,
      "[C:16]": 467,
      "[C;D1;H3:15]": 468,
      "[C;D1;H3:16]": 469,
      "[C@@H;D3;+0:7]": 470,
      "[N+;H0;D2:2]": 471,
      "[N+;H0;D3:1]": 472,
      "[N+]": 473,
      "[N-;H0;D1:3]": 474,
      "[N;D1;H0:9]": 475,
      "[N;D1;H1:4]": 476,
      "[N;D1;H2:1]": 477,
      "[N;H0;D1;+0:4]": 478,
      "[N;H0;D3;+0:12]": 479,
      "[NH;D2;+0:13]": 480,
      "[O;D1;H1:11]": 481,
      "[O;H0;D2;+0:11]": 482,
      "[S;D1;H0:7]": 483,
      "[S;H0;D2;+0:9]": 484,
      "[SH;D1;+0:9]": 485,
      "[cH;D2;+0:11]": 486,
      "[n;H0;D3;+0:2]": 487,
      "[N+;H0;D4:4]": 488,
      "[NH;D2;+0:14]": 489,
      "[O;H0;D1;+0:9]": 490,
      "[P;H0;D4;+0:2]": 491,
      "[S;H0;D2;+0:10]": 492,
      "[SH;D1;+0:10]": 493,
      "[#16:7]": 494,
      "[#16:9]": 495,
      "[#7;a;+:2]": 496,
      "[#8:13]": 497,
      "[Br;D1;H0:3]": 498,
      "[C;D1;H3:17]": 499,
      "[C@H;D3;+0:8]": 500,
      "[C@H;D3;+0:9]": 501,
      "[CH2;D1;+0:3]": 502,
      "[CH2;D1;+0:7]": 503,
      "[CH;D1;+0:2]": 504,
      "[CH;D2;+0:11]": 505,
      "[N-;H0;D1:5]": 506,
      "[N-]": 507,
      "[N;D1;H2:2]": 508,
      "[N;H0;D2;+0:9]": 509,
      "[O-;H0;D1:1]": 510,
      "[OH;D1;+0:11]": 511,
      "[P;H0;D3;+0:2]": 512,
      "[S+]": 513,
      "[S-;H0;D1:6]": 514,
      "[S;D1;H0:2]": 515,
      "[S;H0;D1;+0:11]": 516,
      "[S;H0;D3;+0:4]": 517,
      "[c;H0;D3;+0:14]": 518,
      "[s;H0;D2;+0:11]": 519,
      "[C-;H0;D1:6]": 520,
      "[C;H0;D4;+0:7]": 521,
      "[NH4+;D0:4]": 522,
      "[NH4+;D0:5]": 523,
      "[S-;H0;D1:5]": 524,
      "[Sn;H0;D4;+0:5]": 525,
      "[n;H0;D3;+0:12]": 526,
      "[#14:2]": 527,
      "[#16;a:11]": 528,
      "[#5:2]": 529,
      "[#7:13]": 530,
      "[#7;+:8]": 531,
      "[B;H0;D3;+0:1]": 532,
      "[B;H0;D3;+0:6]": 533,
      "[C;D1;H1:6]": 534,
      "[C;D1;H2:10]": 535,
      "[CH;D1;+0:9]": 536,
      "[F;D1;H0:10]": 537,
      "[F;D1;H0:1]": 538,
      "[N-;H0;D1:7]": 539,
      "[N;-;D1;H0:9]": 540,
      "[N;D1;H2:12]": 541,
      "[NH2;D1;+0:15]": 542,
      "[O-;H0;D1:4]": 543,
      "[O;D1;H0:15]": 544,
      "[S;D1;H0:9]": 545,
      "[S;H0;D3;+0:6]": 546,
      "[o;H0;D2;+0:6]": 547,
      "[s;H0;D2;+0:8]": 548,
      ":3": 549,
      "[C;H0;D3;+0:11]": 550,
      "[C@@H;D3;+0:8]": 551,
      "[CH2;D2;+0:16]": 552,
      "[CH;D1;+0:1]": 553,
      "[CH;D1;+0:6]": 554,
      "[N-;H0;D1:8]": 555,
      "[NH2;D1;+0:14]": 556,
      "[NH4+;D0:6]": 557,
      "[S;H0;D1;+0:8]": 558,
      "[SH;D1;+0:3]": 559,
      "[n;H0;D2;+0:1]": 560,
      "[o;H0;D2;+0:5]": 561,
      "[#14:7]": 562,
      "[#7;+:9]": 563,
      "[#7;a;+:5]": 564,
      "[#8:15]": 565,
      "[C;D1;H2:9]": 566,
      "[C;D1;H3:18]": 567,
      "[C;H0;D3;+0:13]": 568,
      "[CH2;D2;+0:11]": 569,
      "[CH2;D2;+0:12]": 570,
      "[CH2;D2;+0:18]": 571,
      "[CH2;D2;+0:19]": 572,
      "[CH;D3;+0:10]": 573,
      "[Cl;D1;H0:3]": 574,
      "[N+;H0;D2:7]": 575,
      "[N;-;D1;H0:10]": 576,
      "[N;D1;H0:10]": 577,
      "[N;H0;D1;+0:5]": 578,
      "[N;H0;D2;+0:10]": 579,
      "[N;H0;D2;+0:12]": 580,
      "[NH3+;D1:5]": 581,
      "[NH4+;D0:9]": 582,
      "[NH;D2;+0:16]": 583,
      "[O;D1;H1:12]": 584,
      "[O;D1;H1:13]": 585,
      "[S;D1;H0:10]": 586,
      "[S;D1;H0:5]": 587,
      "[n;H0;D2;+0:15]": 588,
      "[nH;D2;+0:12]": 589,
      "[nH;D2;+0:13]": 590,
      "[s;H0;D2;+0:6]": 591,
      "-3": 592,
      "[BrH;D0;+0:1]": 593,
      "[C-;H0;D1:3]": 594,
      "[CH2;D1;+0:11]": 595,
      "[CH2;D1;+0:9]": 596,
      "[CH3;D1;+0:8]": 597,
      "[CH;D1;+0:3]": 598,
      "[CH;D2;+0:12]": 599,
      "[N+;H0;D2:5]": 600,
      "[N+;H0;D4:3]": 601,
      "[N+;H0;D4:6]": 602,
      "[N;H0;D2;+0:11]": 603,
      "[NH2;D1;+0:16]": 604,
      "[NH2;D1;+0:17]": 605,
      "[NH3+;D1:1]": 606,
      "[NH;D1;+0:5]": 607,
      "[NH;D1;+0:7]": 608,
      "[OH2;D0;+0:5]": 609,
      "[S-;H0;D1:8]": 610,
      "[S;H0;D1;+0:13]": 611,
      "[S;H0;D1;+0:6]": 612,
      "[S;H0;D1;+0:7]": 613,
      "[Sn;H0;D4;+0:6]": 614,
      "[Zn]": 615,
      "[n;H0;D3;+0:14]": 616,
      "[s;H0;D2;+0:13]": 617,
      "[#14:8]": 618,
      "[#16:13]": 619,
      "[#16;a:14]": 620,
      "[#34;a:2]": 621,
      "[#7:17]": 622,
      "[#7;a:16]": 623,
      "[#7;a;+:3]": 624,
      "[#8:14]": 625,
      "[C-;H0;D1:7]": 626,
      "[C:17]": 627,
      "[C:18]": 628,
      "[C:19]": 629,
      "[C;D1;H1:2]": 630,
      "[C;D1;H1:8]": 631,
      "[C;D1;H1:9]": 632,
      "[C;D1;H2:14]": 633,
      "[C;D1;H3:21]": 634,
      "[C@@H;D3;+0:9]": 635,
      "[C@@H]": 636,
      "[CH2;D1;+0:10]": 637,
      "[CH2;D2;+0:15]": 638,
      "[CH2;D2;+0:22]": 639,
      "[CH3;D1;+0:14]": 640,
      "[CH3;D1;+0:2]": 641,
      "[CH;D1;+0:10]": 642,
      "[CH;D2;+0:13]": 643,
      "[CH;D3;+0:15]": 644,
      "[Cl;D1;H0:6]": 645,
      "[N;D1;H0:12]": 646,
      "[N;D1;H1:3]": 647,
      "[N;D1;H1:6]": 648,
      "[N;D1;H1:7]": 649,
      "[N;D1;H1:8]": 650,
      "[N;D1;H2:10]": 651,
      "[N;H0;D1;+0:6]": 652,
      "[N;H0;D3;+0:13]": 653,
      "[NH3+;D1:8]": 654,
      "[NH3;D0;+0:8]": 655,
      "[NH;D1;+0:6]": 656,
      "[NH;D2;+0:15]": 657,
      "[O-;H0;D1:3]": 658,
      "[O;D1;H1:14]": 659,
      "[O;H0;D1;+0:10]": 660,
      "[O;H0;D2;+0:12]": 661,
      "[OH;D1;+0:12]": 662,
      "[S;H0;D3;+0:7]": 663,
      "[S;H0;D4;+0:4]": 664,
      "[S;H0;D4;+0:5]": 665,
      "[Sn;H0;D4;+0:4]": 666,
      "[Sn;H0;D4;+0:7]": 667,
      "[n+;H0;D3:5]": 668,
      "[n;H0;D2;+0:14]": 669,
      "[n;H0;D3;+0:13]": 670,
      "[n;H0;D3;+0:15]": 671,
      "[n;H0;D3;+0:16]": 672,
      "[nH;D2;+0:2]": 673,
      "[o;H0;D2;+0:3]": 674,
      "[s;H0;D2;+0:7]": 675,
      "[C-;H0;D1:5]": 676,
      "[C;H0;D2;+0:11]": 677,
      "[C;H0;D3;+0:14]": 678,
      "[C;H0;D4;+0:8]": 679,
      "[C@;H0;D4;+0:2]": 680,
      "[C@;H0;D4;+0:3]": 681,
      "[C@@;H0;D4;+0:5]": 682,
      "[C@@H;D3;+0:10]": 683,
      "[C@@H;D3;+0:13]": 684,
      "[CH2;D1;+0:2]": 685,
      "[CH2;D2;+0:13]": 686,
      "[CH2;D2;+0:14]": 687,
      "[CH;D1;+0:4]": 688,
      "[CH;D3;+0:13]": 689,
      "[Cl;H0;D1;+0:6]": 690,
      "[N+;H0;D2:6]": 691,
      "[N+;H0;D2:8]": 692,
      "[N-;H0;D1:9]": 693,
      "[N;H0;D3;+0:14]": 694,
      "[N;H0;D3;+0:17]": 695,
      "[NH2+;D2:5]": 696,
      "[NH3+;D1:9]": 697,
      "[NH;D1;+0:9]": 698,
      "[NH;D2;+0:17]": 699,
      "[O-;H0;D1:10]": 700,
      "[OH2;D0;+0:6]": 701,
      "[OH;D1;+0:13]": 702,
      "[S-;H0;D1:7]": 703,
      "[S;H0;D1;+0:15]": 704,
      "[S;H0;D3;+0:1]": 705,
      "[S;H0;D4;+0:7]": 706,
      "[SH;D1;+0:1]": 707,
      "[cH;D2;+0:12]": 708,
      "[n;H0;D2;+0:13]": 709,
      "[n;H0;D2;+0:16]": 710,
      "[n;H0;D2;+0:17]": 711,
      "[o;H0;D2;+0:2]": 712,
      "[o;H0;D2;+0:7]": 713,
      "[s;H0;D2;+0:15]": 714,
      "-4": 715,
      "4": 716,
      "[#14:11]": 717,
      "[#14:1]": 718,
      "[#14:3]": 719,
      "[#14:9]": 720,
      "[#15:1]": 721,
      "[#15:3]": 722,
      "[#15;a:5]": 723,
      "[#16:11]": 724,
      "[#16;a:13]": 725,
      "[#34:3]": 726,
      "[#34;a:4]": 727,
      "[#50:2]": 728,
      "[#50:4]": 729,
      "[#5:4]": 730,
      "[#5:8]": 731,
      "[#7:15]": 732,
      "[#7;+:10]": 733,
      "[#7;+:4]": 734,
      "[#8;a:11]": 735,
      "[#8;a:12]": 736,
      "[#8;a:13]": 737,
      "[B;H0;D3;+0:5]": 738,
      "[B;H0;D3;+0:8]": 739,
      "[Br;D1;H0:1]": 740,
      "[Br;D1;H0:4]": 741,
      "[Br;D1;H0:6]": 742,
      "[C;D1;H1:12]": 743,
      "[C;D1;H2:11]": 744,
      "[C;D1;H2:20]": 745,
      "[C;D1;H3:19]": 746,
      "[C;D1;H3:20]": 747,
      "[C;D1;H3:23]": 748,
      "[C;D1;H3:29]": 749,
      "[C;D1;H3:30]": 750,
      "[C;H0;D2;+0:12]": 751,
      "[C;H0;D3;+0:12]": 752,
      "[C;H0;D3;+0:24]": 753,
      "[C;H0;D3;+0:26]": 754,
      "[C;H0;D4;+0:28]": 755,
      "[C@;H0;D4;+0:14]": 756,
      "[C@@;H0;D4;+0:1]": 757,
      "[C@@;H0;D4;+0:2]": 758,
      "[C@@;H0;D4;+0:4]": 759,
      "[C@@H;D3;+0:12]": 760,
      "[C@H;D3;+0:10]": 761,
      "[C@H;D3;+0:11]": 762,
      "[C@H;D3;+0:12]": 763,
      "[C@H;D3;+0:14]": 764,
      "[C@H;D3;+0:17]": 765,
      "[C@H]": 766,
      "[CH2;D2;+0:20]": 767,
      "[CH2;D2;+0:21]": 768,
      "[CH2;D2;+0:23]": 769,
      "[CH2;D2;+0:24]": 770,
      "[CH3;D1;+0:16]": 771,
      "[CH3;D1;+0:17]": 772,
      "[CH3;D1;+0:31]": 773,
      "[CH3;D1;+0:9]": 774,
      "[CH;D1;+0:11]": 775,
      "[CH;D1;+0:13]": 776,
      "[CH;D2;+0:17]": 777,
      "[CH;D3;+0:12]": 778,
      "[CH;D3;+0:14]": 779,
      "[CH;D3;+0:19]": 780,
      "[Cl;H0;D1;+0:7]": 781,
      "[F;D1;H0:11]": 782,
      "[F;D1;H0:12]": 783,
      "[Mg]": 784,
      "[N+;H0;D2:11]": 785,
      "[N+;H0;D2:1]": 786,
      "[N+;H0;D4:7]": 787,
      "[N-;H0;D1:12]": 788,
      "[N-;H0;D1:1]": 789,
      "[N-;H0;D1:2]": 790,
      "[N;-;D1;H0:11]": 791,
      "[N;-;D1;H0:5]": 792,
      "[N;D1;H0:11]": 793,
      "[N;D1;H0:1]": 794,
      "[N;D1;H1:12]": 795,
      "[N;D1;H1:1]": 796,
      "[N;D1;H1:5]": 797,
      "[N;D1;H1:9]": 798,
      "[N;H0;D1;+0:10]": 799,
      "[N;H0;D1;+0:3]": 800,
      "[N;H0;D2;+0:13]": 801,
      "[N;H0;D3;+0:21]": 802,
      "[N;H0;D3;+0:22]": 803,
      "[NH2+;D2:7]": 804,
      "[NH3+;D1:6]": 805,
      "[NH3;D0;+0:9]": 806,
      "[NH;D1;+0:10]": 807,
      "[NH;D1;+0:11]": 808,
      "[O-;H0;D1:11]": 809,
      "[O-;H0;D1:12]": 810,
      "[O-;H0;D1:9]": 811,
      "[O;-;D1;H0:8]": 812,
      "[O;D1;H0:16]": 813,
      "[O;D1;H0:18]": 814,
      "[O;D1;H0:25]": 815,
      "[O;D1;H0:27]": 816,
      "[O;D1;H1:1]": 817,
      "[O;H0;D1;+0:12]": 818,
      "[O;H0;D2;+0:13]": 819,
      "[O;H0;D2;+0:14]": 820,
      "[OH2;D0;+0:1]": 821,
      "[OH;D1;+0:14]": 822,
      "[P;H0;D3;+0:4]": 823,
      "[P;H0;D3;+0:5]": 824,
      "[P;H0;D4;+0:4]": 825,
      "[P;H0;D4;+0:5]": 826,
      "[S-;H0;D1:4]": 827,
      "[S;D1;H0:11]": 828,
      "[S;H0;D2;+0:1]": 829,
      "[S;H0;D4;+0:3]": 830,
      "[S;H0;D4;+0:6]": 831,
      "[Si;H0;D4;+0:1]": 832,
      "[SiH;D3;+0:1]": 833,
      "[c:16]": 834,
      "[n+;H0;D3:4]": 835,
      "[o;H0;D2;+0:4]": 836,
      "[o;H0;D2;+0:8]": 837,
      "[o;H0;D2;+0:9]": 838,
      "[s;H0;D2;+0:5]": 839,
      "[C-;H0;D1:1]": 840,
      "[C-;H0;D1:8]": 841,
      "[C;H0;D2;+0:13]": 842,
      "[C;H0;D2;+0:16]": 843,
      "[C@;H0;D4;+0:1]": 844,
      "[C@;H0;D4;+0:4]": 845,
      "[C@;H0;D4;+0:5]": 846,
      "[C@;H0;D4;+0:7]": 847,
      "[C@@;H0;D4;+0:3]": 848,
      "[C@@;H0;D4;+0:6]": 849,
      "[C@@;H0;D4;+0:9]": 850,
      "[C@@H;D3;+0:15]": 851,
      "[C@@H;D3;+0:18]": 852,
      "[C@@H;D3;+0:20]": 853,
      "[C@@H;D3;+0:26]": 854,
      "[C@@]": 855,
      "[C@H;D3;+0:13]": 856,
      "[C@H;D3;+0:16]": 857,
      "[C@H;D3;+0:18]": 858,
      "[C@H;D3;+0:20]": 859,
      "[C@H;D3;+0:24]": 860,
      "[C@H;D3;+0:26]": 861,
      "[CH2;D1;+0:12]": 862,
      "[CH2;D1;+0:13]": 863,
      "[CH2;D1;+0:16]": 864,
      "[CH;D1;+0:17]": 865,
      "[CH;D2;+0:15]": 866,
      "[CH;D3;+0:11]": 867,
      "[CH;D3;+0:16]": 868,
      "[CH;D3;+0:24]": 869,
      "[Cl;H0;D1;+0:5]": 870,
      "[Cl;H0;D1;+0:9]": 871,
      "[ClH;D0;+0:5]": 872,
      "[ClH;D0;+0:6]": 873,
      "[ClH;D0;+0:9]": 874,
      "[IH;D0;+0:1]": 875,
      "[N+;H0;D2:10]": 876,
      "[N+;H0;D2:3]": 877,
      "[N+;H0;D2:9]": 878,
      "[N+;H0;D3:3]": 879,
      "[N+;H0;D3:4]": 880,
      "[N+;H0;D4:11]": 881,
      "[N+;H0;D4:5]": 882,
      "[N+;H0;D4:9]": 883,
      "[N-;H0;D1:10]": 884,
      "[N-;H0;D1:11]": 885,
      "[N;H0;D1;+0:11]": 886,
      "[N;H0;D2;+0:16]": 887,
      "[N;H0;D3;+0:15]": 888,
      "[N;H0;D3;+0:16]": 889,
      "[N;H0;D3;+0:18]": 890,
      "[N;H0;D3;+0:23]": 891,
      "[N@@+;H0;D4:3]": 892,
      "[NH2+;D2:1]": 893,
      "[NH2+;D2:8]": 894,
      "[NH2;D1;+0:22]": 895,
      "[NH2;D1;+0:25]": 896,
      "[NH2;D1;+0:27]": 897,
      "[NH3+;D1:10]": 898,
      "[NH3+;D1:12]": 899,
      "[NH3+;D1:4]": 900,
      "[NH3+;D1:7]": 901,
      "[NH3;D0;+0:10]": 902,
      "[NH3;D0;+0:3]": 903,
      "[NH4+;D0:11]": 904,
      "[NH4+;D0:13]": 905,
      "[NH4+;D0:3]": 906,
      "[NH4+;D0:8]": 907,
      "[NH;D1;+0:12]": 908,
      "[NH;D1;+0:3]": 909,
      "[NH;D1;+0:4]": 910,
      "[NH;D1;+0:8]": 911,
      "[NH;D2;+0:18]": 912,
      "[NH;D2;+0:22]": 913,
      "[NH;D2;+0:23]": 914,
      "[NH;D2;+0:25]": 915,
      "[NH;D2;+0:27]": 916,
      "[O;H0;D1;+0:13]": 917,
      "[OH2;D0;+0:4]": 918,
      "[OH2;D0;+0:7]": 919,
      "[OH2;D0;+0:9]": 920,
      "[P+;H0;D4:2]": 921,
      "[P;H0;D3;+0:1]": 922,
      "[P;H0;D3;+0:6]": 923,
      "[P;H0;D3;+0:8]": 924,
      "[P;H0;D4;+0:6]": 925,
      "[P;H0;D4;+0:8]": 926,
      "[PH;D2;+0:1]": 927,
      "[S;H0;D1;+0:14]": 928,
      "[S;H0;D1;+0:16]": 929,
      "[S;H0;D1;+0:5]": 930,
      "[S;H0;D2;+0:12]": 931,
      "[S;H0;D3;+0:10]": 932,
      "[S;H0;D3;+0:11]": 933,
      "[S;H0;D3;+0:8]": 934,
      "[S;H0;D4;+0:10]": 935,
      "[S;H0;D4;+0:11]": 936,
      "[S;H0;D4;+0:8]": 937,
      "[S@@;H0;D3;+0:7]": 938,
      "[SH;D1;+0:12]": 939,
      "[SnH;D3;+0:5]": 940,
      "[SnH;D3;+0:6]": 941,
      "[c;H0;D3;+0:16]": 942,
      "[cH;D2;+0:13]": 943,
      "[cH;D2;+0:17]": 944,
      "[n+;H0;D3:3]": 945,
      "[n+;H0;D3:7]": 946,
      "[n-;H0;D2:6]": 947,
      "[nH;D2;+0:15]": 948,
      "[s;H0;D2;+0:14]": 949,
      "[s;H0;D2;+0:16]": 950,
      "s": 951
    },
    "unk_token": "§"
  }
}
