{
  "version": "1.0",
  "truncation": null,
  "padding": {
    "strategy": "BatchLongest",
    "direction": "Right",
    "pad_to_multiple_of": null,
    "pad_id": 2,
    "pad_type_id": 0,
    "pad_token": " "
  },
  "added_tokens": [
    {
      "id": 0,
      "content": "^",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "_",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": " ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "§",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "°",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": null,
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "^",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "_",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "^": {
        "id": "^",
        "ids": [
          0
        ],
        "tokens": [
          "^"
        ]
      },
      "_": {
        "id": "_",
        "ids": [
          1
        ],
        "tokens": [
          "_"
        ]
      }
    }
  },
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "§",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "vocab": {
      "^": 0,
      "_": 1,
      " ": 2,
      "§": 3,
      "°": 4,
      "#": 5,
      "%": 6,
      "(": 7,
      ")": 8,
      "+": 9,
      "-": 10,
      "0": 11,
      "1": 12,
      "2": 13,
      "3": 14,
      "4": 15,
      "5": 16,
      "6": 17,
      "7": 18,
      "8": 19,
      "9": 20,
      "=": 21,
      "B": 22,
      "C": 23,
      "F": 24,
      "H": 25,
      "I": 26,
      "N": 27,
      "O": 28,
      "P": 29,
      "S": 30,
      "[": 31,
      "]": 32,
      "b": 33,
      "c": 34,
      "e": 35,
      "i": 36,
      "l": 37,
      "n": 38,
      "o": 39,
      "p": 40,
      "r": 41,
      "s": 42,
      "cc": 43,
      "CC": 44,
      "O)": 45,
      "c1": 46,
      "C(": 47,
      "=O)": 48
    },
    "merges": [
      "c c",
      "C C",
      "O )",
      "c 1",
      "C (",
      "= O)"
    ]
  }
}
