{
  "version": "1.0",
  "truncation": null,
  "padding": {
    "strategy": "BatchLongest",
    "direction": "Right",
    "pad_to_multiple_of": null,
    "pad_id": 2,
    "pad_type_id": 0,
    "pad_token": " "
  },
  "added_tokens": [
    {
      "id": 0,
      "content": "^",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "_",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": " ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "§",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "°",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": null,
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "^",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "_",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "^": {
        "id": "^",
        "ids": [
          0
        ],
        "tokens": [
          "^"
        ]
      },
      "_": {
        "id": "_",
        "ids": [
          1
        ],
        "tokens": [
          "_"
        ]
      }
    }
  },
  "decoder": null,
  "model": {
    "type": "Unigram",
    "unk_id": 3,
    "vocab": [
      [
        "^",
        0.0
      ],
      [
        "_",
        0.0
      ],
      [
        " ",
        0.0
      ],
      [
        "§",
        0.0
      ],
      [
        "°",
        0.0
      ],
      [
        ":",
        -2.734483532080761
      ],
      [
        ")",
        -2.8951069798552176
      ],
      [
        "(",
        -2.8951069798552176
      ],
      [
        "1",
        -3.004508520643384
      ],
      [
        ":[c:",
        -3.0536626166943996
      ],
      [
        "]",
        -3.2461660395940832
      ],
      [
        "-[",
        -3.2746079039150775
      ],
      [
        "3]",
        -3.2797196204783585
      ],
      [
        "4]",
        -3.296002818268633
      ],
      [
        "5]",
        -3.3422779793995936
      ],
      [
        "1]",
        -3.368400426478587
      ],
      [
        "2]",
        -3.3764916737673776
      ],
      [
        "C",
        -3.386557016231855
      ],
      [
        "-[C:",
        -3.43798276381008
      ],
      [
        "[",
        -3.4451106539521916
      ],
      [
        "0",
        -3.4467518897259097
      ],
      [
        "6]",
        -3.4720611519477274
      ],
      [
        "7]",
        -3.691266852331509
      ],
      [
        "-",
        -3.698276980841001
      ],
      [
        ":[#7;a:",
        -3.768679874901073
      ],
      [
        "O",
        -3.9878429314497903
      ],
      [
        ".",
        -4.135422471738728
      ],
      [
        "=[O;D1;H0:",
        -4.14342385110171
      ],
      [
        "[C:",
        -4.231974606171583
      ],
      [
        "-[c:",
        -4.284823055612852
      ],
      [
        "=",
        -4.31425069066661
      ],
      [
        "-[c;H0;D3;+0:",
        -4.517599651680159
      ],
      [
        "2",
        -4.636811642609228
      ],
      [
        "[#7;a:",
        -4.657482743275402
      ],
      [
        "-[CH2;D2;+0:",
        -4.670408671215968
      ],
      [
        "c",
        -4.676840037116014
      ],
      [
        "-[C;H0;D3;+0:",
        -4.6972549625145525
      ],
      [
        "C;D1;H3:",
        -4.716058680452861
      ],
      [
        "N",
        -4.732554996968654
      ],
      [
        "-[NH;D2;+0:",
        -4.868868832281027
      ],
      [
        ";H0;D3;+0:",
        -4.912464790520277
      ],
      [
        "3",
        -5.021491463027639
      ],
      [
        ";H0;D2;+0:",
        -5.069778686683394
      ],
      [
        "B",
        -5.11632554990423
      ],
      [
        ":[c;H0;D3;+0:",
        -5.250587513259182
      ],
      [
        "n",
        -5.393107082113094
      ],
      [
        "1](=[O;D1;H0:2])",
        -5.425314249608933
      ],
      [
        "[#16;a:",
        -5.562477291093065
      ],
      [
        "-[NH2;D1;+0:",
        -5.593085550856393
      ],
      [
        "S",
        -5.60649571304809
      ],
      [
        "OH;D1;+0:",
        -5.813615954437763
      ],
      [
        "=[CH;D2;+0:",
        -6.089635685900283
      ],
      [
        "/",
        -6.10433411189935
      ],
      [
        "4",
        -6.148658793803616
      ],
      [
        "I",
        -6.592158121821318
      ],
      [
        "\\",
        -7.660232763386483
      ],
      [
        "r",
        -8.505325971040586
      ],
      [
        "P",
        -8.505425971040586
      ],
      [
        "M",
        -8.505525971040585
      ],
      [
        "a",
        -8.505625971040587
      ],
      [
        "5",
        -8.505725971040587
      ],
      [
        "#",
        -8.505825971040586
      ],
      [
        "o",
        -8.505925971040586
      ],
      [
        "g",
        -8.506025971040586
      ],
      [
        "@",
        -8.506125971040586
      ],
      [
        "l",
        -8.506225971040585
      ],
      [
        ">",
        -8.506325971040585
      ],
      [
        "D",
        -8.506425971040587
      ],
      [
        ";",
        -8.506525971040586
      ],
      [
        "8",
        -8.506625971040586
      ],
      [
        "u",
        -8.506725971040586
      ],
      [
        "7",
        -8.506825971040586
      ],
      [
        "6",
        -8.506925971040586
      ],
      [
        "9",
        -8.507025971040585
      ],
      [
        "+",
        -8.507125971040585
      ],
      [
        "Z",
        -8.507225971040587
      ],
      [
        "H",
        -8.507325971040586
      ],
      [
        "i",
        -8.507425971040586
      ],
      [
        "s",
        -8.507525971040586
      ],
      [
        "F",
        -8.507525971040586
      ]
    ],
    "byte_fallback": false
  }
}
