{
  "version": "1.0",
  "truncation": null,
  "padding": {
    "strategy": "BatchLongest",
    "direction": "Right",
    "pad_to_multiple_of": null,
    "pad_id": 2,
    "pad_type_id": 0,
    "pad_token": " "
  },
  "added_tokens": [
    {
      "id": 0,
      "content": "^",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "_",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": " ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "§",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "°",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": null,
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "^",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "_",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "^": {
        "id": "^",
        "ids": [
          0
        ],
        "tokens": [
          "^"
        ]
      },
      "_": {
        "id": "_",
        "ids": [
          1
        ],
        "tokens": [
          "_"
        ]
      }
    }
  },
  "decoder": null,
  "model": {
    "type": "Unigram",
    "unk_id": 3,
    "vocab": [
      [
        "^",
        0.0
      ],
      [
        "_",
        0.0
      ],
      [
        " ",
        0.0
      ],
      [
        "§",
        0.0
      ],
      [
        "°",
        0.0
      ],
      [
        "C",
        -1.712858327302465
      ],
      [
        ")",
        -3.427648210843482
      ],
      [
        "N",
        -3.552368101038197
      ],
      [
        "c1",
        -3.646497004158385
      ],
      [
        "n",
        -3.696401046908849
      ],
      [
        "(",
        -3.778497000378752
      ],
      [
        "c",
        -3.876712017418968
      ],
      [
        "C(=O)N",
        -3.930616218181499
      ],
      [
        "O",
        -3.991902222389721
      ],
      [
        "2",
        -3.997337938168359
      ],
      [
        "1",
        -4.119156157117749
      ],
      [
        "c(",
        -4.131495622712146
      ],
      [
        "NC(=O)",
        -4.274870177881736
      ],
      [
        "(C)",
        -4.360792453351725
      ],
      [
        "c2",
        -4.3657444377502514
      ],
      [
        "3",
        -4.393637601443147
      ],
      [
        "C1",
        -4.517053208153175
      ],
      [
        "n1",
        -4.530213194329812
      ],
      [
        "2)",
        -4.598448072490665
      ],
      [
        "S",
        -4.6003426001507375
      ],
      [
        "=",
        -4.687645553083461
      ],
      [
        "CCC",
        -4.718211128235128
      ],
      [
        "cc",
        -4.768715880328162
      ],
      [
        "3)",
        -4.785855753531374
      ],
      [
        "-",
        -4.79706919098421
      ],
      [
        "c1ccc(",
        -4.868612723740848
      ],
      [
        "C(=O)",
        -4.910927303459955
      ],
      [
        "CO",
        -4.950627982998383
      ],
      [
        "cc1",
        -5.020163303554342
      ],
      [
        "CC1",
        -5.025113936676718
      ],
      [
        "OC",
        -5.046652501673058
      ],
      [
        "/",
        -5.072777361692735
      ],
      [
        "c1n",
        -5.085293325055257
      ],
      [
        "c1ccccc1",
        -5.098084687847512
      ],
      [
        "O)",
        -5.1718661617766015
      ],
      [
        "c2ccccc2",
        -5.179250111312068
      ],
      [
        "o",
        -5.184500836877845
      ],
      [
        "c1cc",
        -5.205023600331012
      ],
      [
        "[C@@H](C)",
        -5.212301756980809
      ],
      [
        "s",
        -5.236380248560661
      ],
      [
        "[C@@H](",
        -5.245974638615423
      ],
      [
        "2)cc1",
        -5.24774757524029
      ],
      [
        "c2ccc",
        -5.271198213113298
      ],
      [
        "S(=O)(=O)",
        -5.276061784957743
      ],
      [
        "[C@H]1C",
        -5.281905365822392
      ],
      [
        "cn",
        -5.302192131453908
      ],
      [
        "[C@H](C)",
        -5.335164877024421
      ],
      [
        "=O)",
        -5.337340215261548
      ],
      [
        "nc(",
        -5.34006150001873
      ],
      [
        "C[C@H](",
        -5.393685205101016
      ],
      [
        "N1",
        -5.399845862958169
      ],
      [
        "[C@@H]1C",
        -5.400206522802913
      ],
      [
        "[nH]",
        -5.401186866120723
      ],
      [
        "[C@H](",
        -5.4023865305751935
      ],
      [
        "COc1ccc(",
        -5.404395873039291
      ],
      [
        "(=O)",
        -5.431332622941821
      ],
      [
        "Cl)",
        -5.434587529367328
      ],
      [
        "c1cccc(",
        -5.446687978583513
      ],
      [
        "c1ccc",
        -5.448248935361222
      ],
      [
        "O=C(",
        -5.461712681122094
      ],
      [
        "c(F)c",
        -5.468198071769428
      ],
      [
        "F)",
        -5.492149165638712
      ],
      [
        "c2c",
        -5.497023721737155
      ],
      [
        "[NH+]",
        -5.497067945251015
      ],
      [
        "Cc1ccc(",
        -5.536764154327047
      ],
      [
        "s1",
        -5.541293128407232
      ],
      [
        "C[C@@H](",
        -5.551534891995166
      ],
      [
        "nc",
        -5.553824288073068
      ],
      [
        "(C",
        -5.5798279569338725
      ],
      [
        ")cc1",
        -5.584086197032658
      ],
      [
        "c2ccccc2)",
        -5.6621124306529484
      ],
      [
        ")N",
        -5.663412381820681
      ],
      [
        "c2ccc(",
        -5.675743547265531
      ],
      [
        "CC(C)",
        -5.683461170947265
      ],
      [
        "c2cc",
        -5.68707809606799
      ],
      [
        "CCN(",
        -5.729360497957233
      ],
      [
        "[C@H]1",
        -5.73852792976273
      ],
      [
        "(C)C)",
        -5.7637506765435
      ],
      [
        "2CCC",
        -5.765040821357306
      ],
      [
        "C(C)(C)",
        -5.780269478915269
      ],
      [
        "4",
        -5.785830068477077
      ],
      [
        "c3ccccc3",
        -5.79088211578248
      ],
      [
        "=C(",
        -5.799791503283603
      ],
      [
        "NC(=O)N",
        -5.828622598353637
      ],
      [
        "c3ccc",
        -5.8307981646383595
      ],
      [
        "COC(=O)",
        -5.83594082728142
      ],
      [
        "[NH2+]",
        -5.883708108242175
      ],
      [
        "c(Br)c",
        -5.90155075653114
      ],
      [
        "[C@H]2C",
        -5.902092449016711
      ],
      [
        "ccc2",
        -5.906100316004808
      ],
      [
        "[C@@H]1",
        -5.956601323915034
      ],
      [
        "nc(-",
        -5.9681751448174705
      ],
      [
        "C#N)",
        -5.982671351731602
      ],
      [
        "[C@@H]2C",
        -5.990926726060167
      ],
      [
        "o1",
        -5.992986395302379
      ],
      [
        "(Cl)c",
        -5.994135433747713
      ],
      [
        "CN(C",
        -6.040965159451256
      ],
      [
        "COc1cc",
        -6.076364909599778
      ],
      [
        "[C@H]2",
        -6.080219363187839
      ],
      [
        "O=C(N",
        -6.10496435446243
      ],
      [
        "CC3)",
        -6.111136882508942
      ],
      [
        "C[NH+](C",
        -6.113738949099251
      ],
      [
        "C=C",
        -6.1255806764477025
      ],
      [
        "c3cc",
        -6.151936302580132
      ],
      [
        "c2nc",
        -6.16974069954791
      ],
      [
        "CNC(=O)",
        -6.173962694264163
      ],
      [
        "F",
        -6.174787994908682
      ],
      [
        "nc1",
        -6.192290611662736
      ],
      [
        "CS",
        -6.2001301384634
      ],
      [
        "C2=",
        -6.22677661781718
      ],
      [
        "cc3",
        -6.262875317881813
      ],
      [
        "C(=O)N1CC",
        -6.263560158017015
      ],
      [
        "[O-])",
        -6.264773936446837
      ],
      [
        "n2c",
        -6.308687997283545
      ],
      [
        "Cn1c",
        -6.311763220679991
      ],
      [
        "C(F)(F)F)",
        -6.313547342928162
      ],
      [
        "cc(C)c",
        -6.322515869845892
      ],
      [
        "COc1ccccc1",
        -6.352035937760281
      ],
      [
        "[NH+](C)C",
        -6.39898403568502
      ],
      [
        "(OC)c",
        -6.405478566280832
      ],
      [
        "c3c",
        -6.433641006450104
      ],
      [
        "[C@@H]3",
        -6.4840940650637595
      ],
      [
        "C(N)=O",
        -6.484516156209784
      ],
      [
        "c1ccc(F)cc1",
        -6.489613334625
      ],
      [
        "[C@@H]2",
        -6.517578290910153
      ],
      [
        "CN(C(=O)",
        -6.542713981153908
      ],
      [
        "cc(Cl)c",
        -6.548926704894869
      ],
      [
        "CC[NH2+]",
        -6.566102885460575
      ],
      [
        "c1ccc2c(c1)",
        -6.581536269392343
      ],
      [
        "c4ccccc4",
        -6.63435826512808
      ],
      [
        "c([N+](=O)[O-])",
        -6.687617445130717
      ],
      [
        "c(C)n",
        -6.698550628987222
      ],
      [
        "C1=O",
        -6.701573188707838
      ],
      [
        "c3nc",
        -6.8020235368800535
      ],
      [
        "[C@H]3C",
        -6.814537033868977
      ],
      [
        "[nH+]",
        -6.877890443264183
      ],
      [
        "/C=C/",
        -6.877988917480439
      ],
      [
        "c1ccc(Cl)cc1",
        -6.8795148688603724
      ],
      [
        "C2CC2)",
        -6.897623015993066
      ],
      [
        "/C(=",
        -6.926169030532234
      ],
      [
        "CN1C(=O)",
        -6.955283841889402
      ],
      [
        "2CCOCC2)",
        -7.018979929312616
      ],
      [
        "S(C)(=O)=O)",
        -7.026245338969352
      ],
      [
        "c1cccc(F)c1",
        -7.027210845365852
      ],
      [
        "(-c2cc",
        -7.105969791916252
      ],
      [
        "5",
        -7.109575424949318
      ],
      [
        "[C@](C)(",
        -7.200484515865665
      ],
      [
        "c3ccccc23)",
        -7.200603121634216
      ],
      [
        "c2ccc(Cl)cc2",
        -7.201803371311784
      ],
      [
        "[NH3+]",
        -7.365750955406786
      ],
      [
        "2CC[NH+](",
        -7.377437448508296
      ],
      [
        "[N+](=O)[O-])cc1",
        -7.416326098886598
      ],
      [
        "c3ccc(F)cc3)",
        -7.536599001151975
      ],
      [
        "c2ccc(F)cc2)",
        -7.540080141921626
      ],
      [
        "cc(S(=O)(=O)N2C",
        -7.600898646512323
      ],
      [
        "[N+](",
        -7.679429011333808
      ],
      [
        "[C@]1(C",
        -7.679452770767203
      ],
      [
        "NC(=S)N",
        -7.679455588198886
      ],
      [
        "Cc1noc(C)c1C",
        -8.046129616951067
      ],
      [
        ")C(F)(F)F",
        -8.29573773450276
      ],
      [
        "[S@@](=O)C",
        -8.296119436545922
      ],
      [
        "2ccc3c(c2)OCCO3)",
        -8.62945277014659
      ],
      [
        "]",
        -9.128452769879257
      ],
      [
        "B",
        -9.128552769879256
      ],
      [
        "#",
        -9.128652769879254
      ],
      [
        "\\",
        -9.128752769879254
      ],
      [
        "l",
        -9.128852769879254
      ],
      [
        "@",
        -9.128952769879254
      ],
      [
        "7",
        -9.129052769879252
      ],
      [
        "+",
        -9.129152769879257
      ],
      [
        "r",
        -9.129252769879256
      ],
      [
        "H",
        -9.129352769879254
      ],
      [
        "I",
        -9.129452769839308
      ],
      [
        "6",
        -9.12945276987922
      ],
      [
        "[",
        -9.129452769879254
      ],
      [
        "4ccc5c(c4)OCO5)c",
        -9.129452769879254
      ]
    ],
    "byte_fallback": false
  }
}
