{
  "version": "1.0",
  "truncation": null,
  "padding": {
    "strategy": "BatchLongest",
    "direction": "Right",
    "pad_to_multiple_of": null,
    "pad_id": 2,
    "pad_type_id": 0,
    "pad_token": " "
  },
  "added_tokens": [
    {
      "id": 0,
      "content": "^",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "_",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": " ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "§",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "°",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": null,
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "^",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "_",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "^": {
        "id": "^",
        "ids": [
          0
        ],
        "tokens": [
          "^"
        ]
      },
      "_": {
        "id": "_",
        "ids": [
          1
        ],
        "tokens": [
          "_"
        ]
      }
    }
  },
  "decoder": null,
  "model": {
    "type": "Unigram",
    "unk_id": 3,
    "vocab": [
      [
        "^",
        0.0
      ],
      [
        "_",
        0.0
      ],
      [
        " ",
        0.0
      ],
      [
        "§",
        0.0
      ],
      [
        "°",
        0.0
      ],
      [
        "C",
        -1.712858327302465
      ],
      [
        ")",
        -3.427648210843482
      ],
      [
        "N",
        -3.552368101038196
      ],
      [
        "c1",
        -3.646497004158384
      ],
      [
        "n",
        -3.696401046908848
      ],
      [
        "(",
        -3.778497000378753
      ],
      [
        "c",
        -3.876712017418967
      ],
      [
        "C(=O)N",
        -3.9306162181814983
      ],
      [
        "O",
        -3.99190222238972
      ],
      [
        "2",
        -3.997337938168357
      ],
      [
        "1",
        -4.119156157117748
      ],
      [
        "c(",
        -4.131495622712145
      ],
      [
        "NC(=O)",
        -4.274870177881737
      ],
      [
        "(C)",
        -4.360792453351725
      ],
      [
        "c2",
        -4.365744437750252
      ],
      [
        "3",
        -4.393637601443147
      ],
      [
        "C1",
        -4.517053208153175
      ],
      [
        "n1",
        -4.530213194329812
      ],
      [
        "2)",
        -4.5984480724906645
      ],
      [
        "S",
        -4.6003426001507375
      ],
      [
        "=",
        -4.687645553083459
      ],
      [
        "CCC",
        -4.718211128235128
      ],
      [
        "cc",
        -4.76871588032816
      ],
      [
        "3)",
        -4.785855753531371
      ],
      [
        "-",
        -4.7970691909842085
      ],
      [
        "c1ccc(",
        -4.868612723740848
      ],
      [
        "C(=O)",
        -4.910927303459953
      ],
      [
        "CO",
        -4.95062798299838
      ],
      [
        "cc1",
        -5.02016330355434
      ],
      [
        "CC1",
        -5.025113936676716
      ],
      [
        "OC",
        -5.046652501673058
      ],
      [
        "/",
        -5.072777361692731
      ],
      [
        "c1n",
        -5.085293325055257
      ],
      [
        "c1ccccc1",
        -5.0980846878475115
      ],
      [
        "O)",
        -5.171866161776601
      ],
      [
        "c2ccccc2",
        -5.179250111312069
      ],
      [
        "o",
        -5.1845008368778425
      ],
      [
        "c1cc",
        -5.20502360033101
      ],
      [
        "[C@@H](C)",
        -5.212301756980807
      ],
      [
        "s",
        -5.23638024856066
      ],
      [
        "[C@@H](",
        -5.245974638615421
      ],
      [
        "2)cc1",
        -5.247747575240288
      ],
      [
        "c2ccc",
        -5.271198213113297
      ],
      [
        "S(=O)(=O)",
        -5.276061784957742
      ],
      [
        "[C@H]1C",
        -5.281905365822392
      ],
      [
        "cn",
        -5.302192131453909
      ],
      [
        "[C@H](C)",
        -5.335164877024417
      ],
      [
        "=O)",
        -5.337340215261547
      ],
      [
        "nc(",
        -5.34006150001873
      ],
      [
        "C[C@H](",
        -5.393685205101015
      ],
      [
        "N1",
        -5.399845862958169
      ],
      [
        "[C@@H]1C",
        -5.400206522802913
      ],
      [
        "[nH]",
        -5.40118686612072
      ],
      [
        "[C@H](",
        -5.402386530575191
      ],
      [
        "COc1ccc(",
        -5.404395873039289
      ],
      [
        "(=O)",
        -5.43133262294182
      ],
      [
        "Cl)",
        -5.434587529367326
      ],
      [
        "c1cccc(",
        -5.446687978583513
      ],
      [
        "c1ccc",
        -5.448248935361222
      ],
      [
        "O=C(",
        -5.461712681122092
      ],
      [
        "c(F)c",
        -5.468198071769427
      ],
      [
        "F)",
        -5.492149165638713
      ],
      [
        "c2c",
        -5.497023721737153
      ],
      [
        "[NH+]",
        -5.497067945251017
      ],
      [
        "Cc1ccc(",
        -5.536764154327045
      ],
      [
        "s1",
        -5.54129312840723
      ],
      [
        "C[C@@H](",
        -5.551534891995165
      ],
      [
        "nc",
        -5.55382428807307
      ],
      [
        "(C",
        -5.579827956933871
      ],
      [
        ")cc1",
        -5.584086197032658
      ],
      [
        "c2ccccc2)",
        -5.662112430652947
      ],
      [
        ")N",
        -5.663412381820681
      ],
      [
        "c2ccc(",
        -5.675743547265528
      ],
      [
        "CC(C)",
        -5.683461170947263
      ],
      [
        "c2cc",
        -5.687078096067989
      ],
      [
        "CCN(",
        -5.7293604979572335
      ],
      [
        "[C@H]1",
        -5.7385279297627285
      ],
      [
        "(C)C)",
        -5.7637506765435
      ],
      [
        "2CCC",
        -5.765040821357305
      ],
      [
        "C(C)(C)",
        -5.780269478915269
      ],
      [
        "4",
        -5.78583006847708
      ],
      [
        "c3ccccc3",
        -5.79088211578248
      ],
      [
        "=C(",
        -5.7997915032836005
      ],
      [
        "NC(=O)N",
        -5.828622598353636
      ],
      [
        "c3ccc",
        -5.830798164638358
      ],
      [
        "COC(=O)",
        -5.83594082728142
      ],
      [
        "[NH2+]",
        -5.883708108242175
      ],
      [
        "c(Br)c",
        -5.901550756531139
      ],
      [
        "[C@H]2C",
        -5.9020924490167115
      ],
      [
        "ccc2",
        -5.906100316004807
      ],
      [
        "[C@@H]1",
        -5.9566013239150335
      ],
      [
        "nc(-",
        -5.9681751448174705
      ],
      [
        "C#N)",
        -5.9826713517316
      ],
      [
        "[C@@H]2C",
        -5.990926726060168
      ],
      [
        "o1",
        -5.992986395302378
      ],
      [
        "(Cl)c",
        -5.994135433747713
      ],
      [
        "CN(C",
        -6.040965159451254
      ],
      [
        "COc1cc",
        -6.0763649095997785
      ],
      [
        "[C@H]2",
        -6.080219363187841
      ],
      [
        "O=C(N",
        -6.10496435446243
      ],
      [
        "CC3)",
        -6.111136882508941
      ],
      [
        "C[NH+](C",
        -6.113738949099251
      ],
      [
        "C=C",
        -6.125580676447701
      ],
      [
        "c3cc",
        -6.151936302580131
      ],
      [
        "c2nc",
        -6.169740699547907
      ],
      [
        "CNC(=O)",
        -6.173962694264162
      ],
      [
        "F",
        -6.174787994908678
      ],
      [
        "nc1",
        -6.192290611662738
      ],
      [
        "CS",
        -6.2001301384634
      ],
      [
        "C2=",
        -6.22677661781718
      ],
      [
        "cc3",
        -6.262875317881809
      ],
      [
        "C(=O)N1CC",
        -6.263560158017013
      ],
      [
        "[O-])",
        -6.264773936446838
      ],
      [
        "n2c",
        -6.308687997283548
      ],
      [
        "Cn1c",
        -6.311763220679988
      ],
      [
        "C(F)(F)F)",
        -6.313547342928161
      ],
      [
        "cc(C)c",
        -6.322515869845893
      ],
      [
        "COc1ccccc1",
        -6.352035937760276
      ],
      [
        "[NH+](C)C",
        -6.39898403568502
      ],
      [
        "(OC)c",
        -6.40547856628083
      ],
      [
        "c3c",
        -6.433641006450104
      ],
      [
        "[C@@H]3",
        -6.4840940650637595
      ],
      [
        "C(N)=O",
        -6.484516156209782
      ],
      [
        "c1ccc(F)cc1",
        -6.489613334624997
      ],
      [
        "[C@@H]2",
        -6.517578290910155
      ],
      [
        "CN(C(=O)",
        -6.542713981153913
      ],
      [
        "cc(Cl)c",
        -6.548926704894869
      ],
      [
        "CC[NH2+]",
        -6.566102885460574
      ],
      [
        "c1ccc2c(c1)",
        -6.581536269392343
      ],
      [
        "c4ccccc4",
        -6.634358265128078
      ],
      [
        "c([N+](=O)[O-])",
        -6.687617445130716
      ],
      [
        "c(C)n",
        -6.6985506289872205
      ],
      [
        "C1=O",
        -6.701573188707836
      ],
      [
        "c3nc",
        -6.802023536880059
      ],
      [
        "[C@H]3C",
        -6.814537033868981
      ],
      [
        "[nH+]",
        -6.87789044326418
      ],
      [
        "/C=C/",
        -6.877988917480438
      ],
      [
        "c1ccc(Cl)cc1",
        -6.879514868860369
      ],
      [
        "C2CC2)",
        -6.897623015993069
      ],
      [
        "/C(=",
        -6.926169030532238
      ],
      [
        "CN1C(=O)",
        -6.955283841889404
      ],
      [
        "2CCOCC2)",
        -7.018979929312614
      ],
      [
        "S(C)(=O)=O)",
        -7.026245338969352
      ],
      [
        "c1cccc(F)c1",
        -7.027210845365852
      ],
      [
        "(-c2cc",
        -7.10596979191625
      ],
      [
        "5",
        -7.109575424949334
      ],
      [
        "[C@](C)(",
        -7.200484515865669
      ],
      [
        "c3ccccc23)",
        -7.200603121634215
      ],
      [
        "c2ccc(Cl)cc2",
        -7.2018033713117795
      ],
      [
        "[NH3+]",
        -7.36575095540678
      ],
      [
        "2CC[NH+](",
        -7.377437448508303
      ],
      [
        "[N+](=O)[O-])cc1",
        -7.416326098886603
      ],
      [
        "c3ccc(F)cc3)",
        -7.536599001151972
      ],
      [
        "c2ccc(F)cc2)",
        -7.540080141921624
      ],
      [
        "cc(S(=O)(=O)N2C",
        -7.60089864651232
      ],
      [
        "[N+](",
        -7.67942901133381
      ],
      [
        "[C@]1(C",
        -7.679452770767197
      ],
      [
        "NC(=S)N",
        -7.679455588198885
      ],
      [
        "Cc1noc(C)c1C",
        -8.046129616951067
      ],
      [
        ")C(F)(F)F",
        -8.295737734502758
      ],
      [
        "[S@@](=O)C",
        -8.29611943654592
      ],
      [
        "2ccc3c(c2)OCCO3)",
        -8.629452770146589
      ],
      [
        "B",
        -9.128452769879244
      ],
      [
        "7",
        -9.128552769879244
      ],
      [
        "r",
        -9.128652769879244
      ],
      [
        "l",
        -9.128752769879243
      ],
      [
        "]",
        -9.128852769879243
      ],
      [
        "H",
        -9.128952769879245
      ],
      [
        "#",
        -9.129052769879245
      ],
      [
        "\\",
        -9.129152769879244
      ],
      [
        "+",
        -9.129252769879244
      ],
      [
        "[",
        -9.129352769879244
      ],
      [
        "I",
        -9.129452769839297
      ],
      [
        "6",
        -9.129452769879236
      ],
      [
        "@",
        -9.129452769879244
      ],
      [
        "4ccc5c(c4)OCO5)c",
        -9.129452769879244
      ]
    ],
    "byte_fallback": false
  }
}
